{
    "Count": "45",
    "Last Update": "2014-03-10 20:11:02.635752",
    "Product Name": "Audio-Technica ATH-M50x Professional Headphones",
    "Reviews": [
        {
            "date": "February 15, 2014",
            "rating": "5.0",
            "text": "A lot of people are wondering what difference these headphones have compared to the ATH-M50 and the simple answer is they went with a don't fix what's not broken approach. The sound quality on these headphones remain unchanged from the old ATH-M50 which has superb quality for headphones in it's price range. What did change however is the removable cable which for some who learned the hard way can break and would require trying to fix them or picking up a whole new set of headphones altogether.\n\nThe headphone cushions are also noticeably more comfortable for extended periods of use. As comfortable as the previous model was after extended use I would get this feeling that my head was being suffocated and gripped which would lead to a headache and while I don't think that feeling can ever be removed these headphones do a great job of prolonging that feeling.\n\nFor those asking about the cable connection going into the LEFT headphone, it is a snug connection so you won't have to worry about the plug coming out.\n\nAll in all if you own a pair of ATH-M50's I wouldn't go rushing out the door to replace them with these unless removable cables are that big of an issue to you but if you don't own the M50s this is definitely the way to go since you won't have to choose between coiled or straight cables when you can have them both.",
            "title": "A worthy successor!",
            "userName": "MKBHD"
        },
        {
            "date": "February 17, 2014",
            "rating": "5.0",
            "text": "A real world and practical comparison of Audio Technica ATH-M50 and the new ATH-M50x. This review is for people who haven't owned the old or the new ones and is contemplating a purchase between the two. I am not a DJ or audiophile, so this review is geared towards common folks who just use headphones for listening to music, videos, audio books, movies in a real world setting using phones, tablets, laptops etc (i.e. not professional equipment).\n\nPrice -\nM50 - look for deals online and you can find a brand new one for under $100 easily (I bought mine brand new for $80) with a deal alert on Slickdeals.\nM50x - $169-189. Since they are relatively new there has not been any price reduction or deals yet and won't be for quite sometime.\n\nSound quality -\nSame as M50, i.e. excellent and the best you can get for this money. Tons of reviews covering this so I'm not going into details.\n\nSound isolation i.e. noise cancellation -\nSame as M50, i.e. very good. These aren't active noise cancelling, but its good enough for using in airplane, train, library, public transit or any other quiet environment. A very big plus compared to a lot of headphones that leak sound and renders it useless in such environments or in bed at night.\n\nBuild quality -\nSpeaker components - same\nBand - same\nPadding - uses a slightly better material, but Audio-Technica won't give out the exact specifications.\nBoth these are made in Taiwan.\n\nConvenience - (I found this to be a big deal)\nConnectors and wires - M50 comes with only 1 attached coiled/straight cable with a 3.5 mm plug and a 1/4\" adapter; M50x comes with 3 cables plus its removable. When I first bought my M50 I didn't realize that out of the box it won't really work cell phones or tablets if they're in a case. They work fine with laptops. The 3.5 mm plug on M50 is not a step-down version, its rather flat and wide, suitable for professional equipment, amplifiers etc. Most cases won't have such a wide opening and this will prevent it from fitting properly to the 3.5 mm audio out. The headphones will work fine with any cellphone or tablet when its out of the case, but with a case the wide plug just won't fit in completely. The only way around it is to\na) remove your case,\nb) buy another audio 3.5 mm cable/adapter with a step-down design with a female/male connector and use it (which is not ideal since the straight cable is already 3.5 m or 11.5 ft long, even the coiled one is long) or\nc) do a mod to make the M50 removable cable. Search on head-fi and you can do it yourself or get it done by a company for $40.\nThis is very important. The 3 cables that come with M50x, especially the 1.2 m with step-down plug makes it useful right out of the box for phones and tablets.\nIn some sense making the removable mod is better since it will provide you with an option of using your choice of 3.5 mm cables, whatever length you want, including the ones with mic attached to it. Read more about it and buy keeping this in mind. The M50x comes with proprietary cables so you can't use any other off-market cable, at least as of now.\n\nConvenience - fold-able and comes with a case.\nBoth fold and makes it easy to carry. Comes with a pleather case (looks same barring a logo print on the new one).\n\nComfort - decent and not as great as an open can with velour pads.\nComfort wise these aren't the most comfortable headphones, but obviously this depends on your head size, preference wrt velour vs. pleather pads etc. They are pretty tight fitting when they're new and will flex as you use them and will become more comfortable later. However, the pleather will make your ears warm and after continuous usage of over 2-3 hours you will have to occasionally remove them or readjust them. The new one uses a different material for the ear pads, slightly better and hence M50x is slightly softer and more comfortable.\n\nFinal conclusion - these are one of the best headphones you can buy for the money considering all the above aspects. If you are technically inclined and comfortable doing the mod definitely get the old M50 on a good deal for under $100 (this is what I actually recommend).",
            "title": "A real world and practical comparison; things to consider ATH-M50x vs. ATH-M50",
            "userName": "Inwester"
        },
        {
            "date": "February 11, 2014",
            "rating": "5.0",
            "text": "First of all I would like to say how great amazons service is. I got these headphones about 3 weeks before my estimated delivery date which was a pleasant surprise. The headphones themselves are a beauty. The build quality is fantastic and i love how to cable lock into the headphones so they don't get ripped out. They are extremely comfortable and i have personally worn them for our at a time almost forgetting i was wearing them. The thing is, i couldn't forget i was wearing them because of how amazing they sound compared to every other headphone i have tried at this price range. I got a pair of Beats by Dr. Dre for Christmas and I opted to sell them in order to buy these. I made a good choice. The highs, mids, and bass are evenly distributed and the bass is nice and punchy versus muddy and overbearing. These headphones are great for monitoring, listening to any music, and they look great.",
            "title": "Great All Around Studio Cans",
            "userName": "Clayton Hamrick"
        },
        {
            "date": "February 28, 2014",
            "rating": "5.0",
            "text": "I had some Beats By Dre. Studios ($300+) that I had been using for a while.\nI decided to pick up a pair of ATH-M50x's from Amazon and I was shocked from the results!\n\nThe bass is a tiny bit less than the Beats By Dre, but it sounds SO MUCH CLEANER! I totally prefer the ATH-M50x's bass over the Beats.\nSound quality is amazing.\nThey're huge, so they don't stress on your ears, which is great.\n\nOverall, 10/10, unbelievable.\n\nIgnore every other review that you've seen. These are 10/10 headphones.",
            "title": "WOW! - DESTROYED THE BEATS",
            "userName": "TheComputerDewd"
        },
        {
            "date": "February 10, 2014",
            "rating": "5.0",
            "text": "The \"too long didn't read\" version:\n\nWorth the money. Buy them. They produce clean sound and I find that they're great for the studio or for casual listening.\n\nThe longer version:\n\nJust for background sake, I tend to EQ everything I listen to (digitally) so I'm constantly pushing the lows, mids, and highs. I also play the keyboard (Nord Electro 4D and a Yamaha S90ES which I run through a sound mixer) on stage each Sunday. I also enjoy recording casually at home.\n\nWith that said, I've worked these headphones through a very wide range of frequencies. As some know, amps are not well suited for keyboards because of the wide range of frequencies that are required of them. For this reason (and for the purpose of reducing the volume level on stage), I went the route of routing my keyboards through a personal sound mixer, sending the main mix to the main sound board and using the Monitor/Aux Send on my mixer to act as my stage monitor. I also route the stage mix to it's own channel thus allowing me to balance the volumes of the main mix with that of my keyboards. Usually, I use a pair of Shures in-ears; but now that I have these, I can hear the full range of my keyboard tones (lows/mids/highs) as well as the full range of the main monitor mix. This has made mixing my sound SO much easier and thus I can more easily identify and EQ my tones. So getting to the point, my organ tones sound great. My piano tones sound great. My clavs sound wonderful. Smooth lows, clean mids, and crisp highs (low or no distortion). I love that I can hear every part much more distinctly. From the shakers to the different pieces in the drum set.\n\nThese headphones are great for the price-point. They look good. The cable is removable (without the need to mod the ATH-M50), and they're comfortable. Comfort-wise they have enough tension to stay on and seal to your head without feeling like you're head is getting squeezed.\n\nOverall, I really appreciated that Audio Technica provided 3 different (removable) cables. I find that I usually use the short straight cable and the coiled cable (depending on whether I'm recording or I'm casually listening); but it's great that I don't have to choose \"one\" and be stuck with my choice.\n\nOne final note about the cables. The cable that plugs into the headphones is a 2.5mm jack and it plugs in fairly deep into the headphone (1.05 inch from the insert to the end of the male connector). I suppose this makes it less likely to break or cause damage. But know that should you manage to destroy all 3 of your provided cables, that you may have to buy replacements from Audio Technica; however, I'm certain you could probably find a 2.5mm to 3.5mm cable out there that would work. You'll just have to be sure that the 2.5mm end is skinny enough to fit into the headphones. You'll need 0.6 inch of length between the insert and for the portion that will go into the insert to be no thicker than 0.25 inch.\n\nOther pros included slightly improved cushion and a carrying case, in what I think is pleather material. I prefer to travel with my headphones in the \"flat\" position; and while they do fit in the case this way, the band sticks out about an inch from the case so it's possible to scratch up the top of the headband but if you're like me, you won't let that happen. Otherwise, they'll fit completely in the carrying case if you store the headphones in the \"folded inward\" position, .\n\nSo go buy them already.",
            "title": "Great lows/mids/highs - nice extras",
            "userName": "Jarrett M. Barnett \"Developer\""
        },
        {
            "date": "February 28, 2014",
            "rating": "4.0",
            "text": "I searched for several months for a suitable set of headphones. I wanted them primarily the watch blu-ray movies and to listen to tv late at night and not disturb anyone. After several attempts from different manufacturers ( SONY, AKG, CREATIVE, BEYERDYNAMIC, BLUEDIO, LOGITECH ) I came across the Audio-Technica ATH-M50x on amazon, thank goodness the search is over. The M50x has a one of a kind sound signature. I know that sound is subjective and differs from person to person but having listened to many many headphones over the past few months I have finally found my sound signature! Deep bass not bloated or muddy, highs that don't screech and mids that are to my ears perfect. The only thing I don't like about the M50x is the look. I know it's silly but I've seen better looking headphones. The M50x are great for action movies, you don't just hear the explosions you feel them. These are hands down the best headphones I've tried to date better than headphones costing hundreds more. GET THEM!!",
            "title": "Audio-Technica ATH-M50x",
            "userName": "Lewis C. Johnson"
        },
        {
            "date": "February 20, 2014",
            "rating": "5.0",
            "text": "I'm a first-timer to Audio Technica Ath-50x and here are my thoughts. The main reason for my purchase is listening to it during commutes in NYC and also because it has three cables. From what I've researched, cables often gets damaged from the ATH-M50 and often you have to replace the whole headphone. Luckily, I stumbled across the m50x and I cancelled my order for my m50wh.\n\nThe best way to describe the sound of Audio Technica is like if you're in a movie theater and the floor/room vibrates when the sound gets high. Yes it's a good sensation especially if apple earbuds were your main source of music.\n\nThere were a lot of things that I've heard from songs that I havent heard before. For example, I've been obsessed with Let it go by idina Menzel. You can literally hear Elsa take off her cloak where before I couldnt. THE BASS, since this is the first time I bought and nice pair of headphones, the bass is ridiculous to me. I never knew there were bass in some songs that I've been listening to for years.\n\nNow that I have heard this pair of headphones, I always expect more from music, like bass and certain drops. In a way it made music even more wonderful, in another way, anything that's not of this quality is basically crap. Like my earbuds.\n\nAlso I've searched for almost every review and youtube clip regarding this pair of headphones. Shout out to Marquee Brown since he made awesome reviews leading to my purchase!",
            "title": "First time listening to Audio Technica ath-50x",
            "userName": "Chi Ng"
        },
        {
            "date": "March 1, 2014",
            "rating": "5.0",
            "text": "I'm not a hardcore audiophile by any means, so take this review as you wish. I decided to go with the M50x's after countless hours of reviews and research. The previous M50's got amazing reviews so when I saw these come out with the detachable cables, I thought why not? Well, I can honestly say you will NOT be disappointed. Every sound these headphones produce is so crisp and clear. The bass is not overwhelming (in a good way), the mids are crystal clear, and the highs are super clean. If you're looking at Beats, Sennheiser, or any other brand, please do yourself a favor and look into the M50 or M50x's. You will thank me later!\n\nJust amazing!!!",
            "title": "Amazing headphones, must buy!!!",
            "userName": "Eric Howard"
        },
        {
            "date": "February 12, 2014",
            "rating": "5.0",
            "text": "In short the ATH-M50x has removable cables and noticeably more comfortable padding. The sound and build is exactly the same as the old M50s. The 1.2m cable is also much more convenient.",
            "title": "An update to the triumphant ATH-M50",
            "userName": "alex"
        },
        {
            "date": "March 3, 2014",
            "rating": "5.0",
            "text": "As the title reads, these headphones have meet or rather amazingly exceeded my rather high expectations from the m50's. The range of music that these can be used for is absolutely stunning. I've listened to everything from Beethoven's symphonies/sonatas, Pink Floyd's 'Dark Side of the Moon', The Smiths, Kanye West's discography, to even Skrillex. The headphone's excel in almost every category of music.\n\nI reassure you that I am not ignorant or naive when on the topic of headphones. I have throughly listened to and even owned the Bose QC15's, Audio-techinca anc-9, Beyerdynamic Custom One Pro's, Monster Inspirations, Parrot Zik, V-moda M100/lp/lp2, and even the infamous Beats by Dre Studios. Certainly these are not audiophile headphones (as I am no audiophile), but rather headphones that can be used and bought by the average consumer. With these I have found that the m50's are certainly in the top in terms of value for money.\n\nObviously the noise cancelling headphones are priced much higher than the m50, and rightly so. But I have found that when noise cancellation in activated there is slight ambient noise created by the headphones themselves, which in all honestly may not be a concern to most people but it is for me. If you are a travelling person that is exposed to lots of noisy situations the qc15 or the and-9's are the better fit for you. I myself transit much of the time. However, the loudness at which I play my music blocks out much of the noise (with the m50s which is around 50%). It all depends on how much noise that surrounds an individual.\n\nNow concerning the sound quality. The m50's are all-round headphones that play all kinds of music extremely well, as stated before. i must warn bass heads that the bass you are looking for may not satisfy your tastes. I found the bass to be just the right amount without muffling the mids or highs which is how I like it. If you want more bass go with the M100's or the Beyerdynamics COP with adjustable bass. Actually I thought the Beyerdynamic's sound signature was the closest to the m50's if the bass level with around 1.5 clicks from the top. Furthermore, the Beyer's are in the same price range as the m50x.\n\nNow with the different types of music. The symphonies (especially the Symphony No. 5 in C minor by Beethoven) in Flac format was simply incredible. It was like I was sitting front and centre listening to a live orchestra, with the violins towards the left and the violas, cellos, and basses towards the right. The strings were resonating beautifully. Now on to the late 60's and 70's with Simon and Garfunkel, Pink Floyd, The Beatles, and many more. There were details that songs like Time, Money, The Boxer, Yellow Submarine, and many more that I haven't heard before so distinctively. Now with a great pair of headphone's I can truly appreciate the sound and subtleties the artists intended for us to hear. The 80's with The Smiths, Queen, and Michael Jackson just to name a few was a revolutionary decade. Once again the details exposed are stunning on almost every single artist and track. People reading this maybe more concerned with modern music and I have to say the headphones do a great job in bringing life to music. The headphones do justice to musical tastes throughout. There are many artists personally that these headphones truly do justice to: Radiohead, Outkast, Biggie, MF Doom, Eminem, Jay Z, Coldplay, Kanye West, Arcade Fire, Green Day, Death Grips, Beyonce, Kid Cudi, Drake, Frank Ocean, The Weeknd, Kendrick Lamar, Bon Iver, Daft Punk, and the list goes on.\n\nSimply put, these headphones live up to the hype and I personally recommend them to almost everyone who has a passion for music. The headphones are practically a bargain with amazing sound quality. Full marks from me.\n\nPS I recommend FLAC files, the extra memory it takes up is definitely worth it. Also, if you can afford an amp or dac I would get one, the fiio amp/dacs are fairly affordable and do make a noticeable difference.",
            "title": "Simply Amazing.",
            "userName": "Jas Sandhar"
        },
        {
            "date": "March 1, 2014",
            "rating": "5.0",
            "text": "These headphones deliver such clean sound it makes them extremely enjoyable to listen to music. Also they are excellent if you play video games, the ATH-M50x brings out sounds that you wouldn't normally hear. These headphones are also great for mixing multiple audio tracks as these headphones point out imperfections in sound very well.\n\nThe genres of music I mostly listen to are Rock, Alternative, some Prog, Pop, Electronica and Some hip-hop. The Audio-Technica ATH-M50x delivers punchy and sustainable low-end bass, the mid-range is present and clear and the high-end sound is crystal clear and doesn't distort no matter what volume you're listening to them at.\n\nThese headphones do become a bit uncomfortable and warm after a long period of use but something to get used to after all these are the first over-ear headphones that I've purchased in a long time.\n\nOverall the Audio-Technica ATH-M50x is a worthy investment if you're looking for nice, clean and uncolored sound.",
            "title": "The ATH-M50x are the First professional headphones I've ever purchased.",
            "userName": "Alex"
        },
        {
            "date": "February 21, 2014",
            "rating": "5.0",
            "text": "I'm coming from Sennheiser HD280s, so compared to the HD280s, the ATH-M50x provide a lot more clarity across the range, and are expressive in low end where the HD280s were silent. The ambient attenuation seems similar, but I do hear more sound leaking out from the ATH-M50x. Not a negative for me, but possibly important in other settings to other people.\n\nI got these as a replacement to a Sennheiser HD280 pro set, mostly because the darn coiled cable of the HD280s was chaining me to my desk chair at work, and otherwise being a coiled pain. So I knew I wanted something with a straight cable, or better an interchangeable cable. ATH-M50x to the have been delivered to me by fate, and just in time! The HD280s served well for many years and sound very good, but the M50x does out class them by a good amount.",
            "title": "Very detailed",
            "userName": "Dominic C."
        },
        {
            "date": "February 18, 2014",
            "rating": "5.0",
            "text": "I have been looking for a new pair of headphones for a while now. I had a pair of lower end Sennheisers (I forget the model) and I wanted an upgrade. My criteria?\n\n- Comfortable.\n- Stylish - simple and not cumbersome.\n- Detachable cable - ruined cables have made me lose more than a few pairs of headphones & earbuds.\n- Noise reducing - I live in NYC, so I wanted something that will drown out some of the NYC noise. I didn't necessarily need noise canceling headphones, just some that block out enough once they go on your head.\n- Above all, audio quality better than my last pair.\n\nThe M50x's met and surpassed every item on my list. They are comfortable, light and stylish. They aren't as stylish as something like Beats, but nothing is really. The build quality though is wonderful. They do not come with a detachable cable - they come with three! One's coiled, one's very long, and the third is perfect for using on the go with a cell phone. After reading reviews of the older model, I noticed that the plug couldn't fit into most phone cases. This new cable is perfectly suited for any case (I have a Nexus 5 with the Nexus 5 case from google). I listened to them on the train and they are great! The volume doesn't even have to be all the way up for me to drown out the noise of the trains and others.\n\nFinally, they sound simply AMAZING! If you do not care about anything else I have mentioned, I would buy them for this reason (or the M50s' since they haven't changed the sound of em).\n\nI could not recommend these more to anyone who's looking for something amazing and under $200! I'd even pay under $300 for these to show you how pleased I am with em. Good job Audio-Technica.",
            "title": "Headphone Heaven, under $300.",
            "userName": "Graham A. Reid"
        },
        {
            "date": "February 15, 2014",
            "rating": "5.0",
            "text": "For those who think paying more than 100$ on headsets isn't worth it I say: You're wrong. Quality sound emanates from these headphones. Nothing to do with cheap intra-auricular headphones. Not only do you hear the music, but you can feel it. Really, I recommend these for the price.",
            "title": "Unbelievable",
            "userName": "raphael"
        },
        {
            "date": "March 7, 2014",
            "rating": "3.0",
            "text": "Currently the reason for this one-star rating rests entirely on the shoulders of amazon per the title above.\n\nI received these headphones on March 3rd and immediately loved them. Unfortunately, when I finally had an opportunity for extended listening today (March 7th), I experienced intermittent buzzing distortion in each earcup with the right earcup occasionally dropping out entirely for intermittent periods. These intermittent failures occurred with all three of the cable sets, which pretty much means connection short within the headset.\n\nUpdate (March 8th): Last night I canceled my replacement order through Amazon and after some frustrating email exchanges ended up live chatting with an Amazon Rep, who processed my full refund to my credit card. I'm appreciative of that aspect of their customer service. Earlier yesterday, I had already UPS the defective item back to Amazon.\n\nI emailed another seller and after confirming that they were more than adequately stocked, re-purchased the headphones and a free bonus gift for the same price with free upgraded express shipping directly through their website. To be fair they are an Amazon recommended seller and those of you, who take the time to review all the questions and answers for thi(S P)roduct will know whom I'm referring to. I'll have my order no later than next Wednesday. Any performance review that I write will be on their website.\n\nI've upgraded my rating on this product here to three stars, which is defined as \"It's OK\". This is the highest review that I can honestly provide here. The headphones themselves are very comfortable to my noggin and the cables have a sufficiently rugged long lasting quality. The locking mechanism on the cable is simple and effective, which is to say well engineered. It is not necessary to rotate-lock the cable in place for functionality as the connection to the left earcup is very snug. From an external, human interaction aspect, these are well designed and constructed quality headphones. From an internal Reliability/Quality perspective...short of dissection, who really knows?\n\nWhen working properly, the headphones sounded great. I'm not going to trash them based on receiving a defective item. It shouldn't happen, but it does occur. If it happens too frequently then that's an internal Audio Technica problem between their Reliability/Quality Engineers and the other internal stakeholders within the company. For what it's worth, I'm willing to try again and give Audio Technica another shot.",
            "title": "Had to Return Defective Set to amazon on March 7th - Their Replacement Delivery Estimate: April 7th-23rd!!!",
            "userName": "Bill"
        },
        {
            "date": "March 7, 2014",
            "rating": "5.0",
            "text": "Just got my Ath M50x's and wow they look much better in person, the material on the ear cups looks sweet and is very soft. I got the white ones and the whole frame looks very sleek. The headphone cords are very thick and the locking mechanism works great.\n\nThe sound is very clear and these headphones don't leak unless you turn them all the way up. Everything is perfect about these headphones with one exception, they need to come out with a microphone cord! If you are looking for a great over the ear pair of headphones that have the best sound quality in the business go with these! The bass is amazing for both rap and metal music.",
            "title": "Worth Every Penny!",
            "userName": "James"
        },
        {
            "date": "March 2, 2014",
            "rating": "5.0",
            "text": "What a great pair of headphones, own a pair of M40s and when I heard of the M50x's I knew it was a must purchase. The build quality is great, solid feel to them and there jointed well. You will have no problem turning them wrong way, they will not break easily. As far as sound great blend of fullness mixed with good lows.\n\n My only gripe about these headphones is, if you have to go to another pair of headphones say like for gaming, or in ear for when you are on the go. You will notice immediately what is lacking. Yes the M50x's are just that good! Great work Audio-Technica! Also the detachable cables are icing on the cake.",
            "title": "How music is supposed to sound.",
            "userName": "Aerial J."
        },
        {
            "date": "March 2, 2014",
            "rating": "5.0",
            "text": "The headphones sound great so far, although I only have 1 week of listening time on them. I upgraded from mid-range Shure SRH240A headphones (which had served me well for 3+ years) and the improvement in sound quality is noticeable. The overall sound is warmer, the bass is punchier and the mids are more detailed. I find them to be very comfortable to wear so far. I'm very happy with the build quality, the packaging and the accessories. Only time will tell if these headphones last and break in well but they have exceeded my expectations from a first impressions perspective.\n\nI considered the Shure SRH440 and the Sennheiser HD 280 instead of the more expensive M50x but the deciding factor was that the M50x comes with 3 detachable cables (short straight, long straight, long coiled) and it does get higher reviews for quality of sound. So far the convenience of the extra cables has been useful since I leave the coiled cable attached to my mixer (with the 1/8 adapter) and I use the short cable to listen to my iPad. It saves me having to unscrew the 1/8 adapter when I want to plug into my laptop or phone as well. It may seem like a minor thing to some people, but since I was buying online and wasn't sure I'd even like a coiled cable - having the options was worth the extra cost. In hindsight I'm very glad to have the additional cables.\n\nThis item was shipped through The Sound Professionals and not Amazon.com. I received an email a couple of days after purchase (and after payment was posted to my credit card) that the item was not in stock (although it was still listed on the site as in stock) and delivery would be a couple of day late. It arrived 1 day outside of the delivery window but they had shipped it Priority and they included some free upgrade ear-pads. I was pleased with the customer service because they contacted me early to let me know of the issue and because they included a free upgrade as compensation. I don't get mad when these sorts of things happen and I only judge a company on how they handle it when it does happen - and Sound Professionals handled the situation professionally.",
            "title": "Great sounding headphones",
            "userName": "James J Fassett"
        },
        {
            "date": "February 20, 2014",
            "rating": "5.0",
            "text": "I am so accustomed to the earbuds that come with any smartphone, so I am by no means an expert on what is and isn't good sound quality, but I can say with certainty that I was absolutely blown away by these. As far as comfort, these headphones have a very soft set of ear pads as well as a comfortable headband, making the hours of listening enjoyable. They don't hug too tight, just enough to keep them on your head. They're fairly hefty in weight but that should be synonymous with anything of a high quality build (being made out of a hard plastic similar to that of a PS4 controller). The headphones come with three cables, as you can see in the description: Two 1.2 m cables (one straight, the other coiled) and a 3 m straight cable. I've been using the shorter of the straight cables as I use these primarily for enjoying music on the go or at home. Overall, my experience with these may only range in the 24-48 hours since they've been delivered, however, the impression that these have left for me is nothing short of great.",
            "title": "Not an audiophile but...",
            "userName": "Pieter"
        },
        {
            "date": "February 20, 2014",
            "rating": "5.0",
            "text": "Just received mine two days ago and at first I was wondering if they would sound good out of the box without any form of burn in. Well to put in one word, \"Yes\"! Before I bought the Klipsh S4 because of their overall good reviews. I find out that \"in ears\" for me are a no go. So I went on a search for \"over the ears\" and found these. The Klipsh S4 are out :-)\nThey have a very crisp and rich sound. The bass is perfect for me, it's there, but not in your face. Vocals and voices sound very detailed. Overall just a well balanced pair of headphones. Something everybody knows already, just wanted the mention it myself.\n\nYou'll enjoy them without any doubt.",
            "title": "Right out off the box they sound terrific!",
            "userName": "Simon Hermans"
        },
        {
            "date": "February 11, 2014",
            "rating": "5.0",
            "text": "Edit: This review is from a viewpoint of someone who haven't used the previous M50 version. This review is generally about the overall quality of this headphone!\nMy Review:\nThis is one of the best headphone I've owned. Even more expensive headphones like the Sennheiser HD series (besides the HD800 I guess) are not as good as this one. There are several factors that make this headphone awesome:\n\nComfort: 10/10\nFirst of all, I want to talk about the component that separates this headphone from the Sennheiser HD series or other headphones; the comfortable of this headphone is unmatchable by other brand headphones. I have big ears and the ear cups fit perfectly inside my ears as well as the tightness of the ear cups doesn't hurt my ears either which helps with extended listening/wearing. The earcups are made out of some sort of soft leatherish rubber which is once again...super soft and comfortable. Same thing for the headband, it's so soft and fit to my head so well. They also put some sort of soft cushion under the earpads for extra comfort. Which are all pretty neat and cool features.\n\nSound Quality 30/30:\n+Highs 10/10: Perfect, crisp\n+Mids 10/10: Really clear and balance\n+Lows 10/10: Very good base and smooth.\nI'm not an expert or audiophile but dang this headphone sounds good. Everything sounds differently, every song sounds like a new song and you can hear everything in the audio file as long as you have the good enough quality audio track. I've listen with this headphone from all kinds of music: classic, rock, pop, alternative, etc. Everything just sound so good. In my own opinion, I think that this headphone sounds better than the Sennheiser HD598 HD280 380 because of the improved base as well as the clearer background I guess (just my own opinion). Also in my own opinion, I think this headphone is better than the Bose QC15 and is comparable to the Shure SHR1440. Overall, everything sounds smooth crisp with incredible base. Get this for your own to try it out and you'll see what I mean.\n(I will update more as I break it in a little bit more, could be even better :D)\n\nLooks 9.99/10:\nIt looks great and well... This is again a personal reference/opinion. This headphone is very fashionable and awesome looking. It's also very light so you can wear it outside no problem!\nThis is just my opinion on the look but you can look at the picture and judge for yourself. :D\n\nFeels 10/10:\nVery solid and durable. Inside is made out of metals/aluminum (I'm not really sure). You can feel the quality of it from top to bottom , it feels very dense and solid (unlike the plasticky feel from say the QC15 or HD380)...From the ear cups to the leather padding. It's a great built headphone overall. The cables are also thick and durable (I like the coil one because I tend to move around a lot).\nOverall, great upgrade from the last model (which I never own one, I took this sentence from reading other reviews :D)\n\nPricing 10(+5) or 15/10:\nFor a headphone like this,I could pay 400 dollars for it and still feel worth it. I don't know, may be it's just me but I feel like getting this headphone for just around 200 dollars (plus tax) from Amazon is way too cheap. With this awesome quality built, comfort level as well as supreme sound, this headphone is way too good for its price/competitor.\n[Hurry, get this now before Audio Technica raise the price:) ...jkjk haha]\n\nConclusion:\nThat's all I have for now. I hope you find my review helpful and help you somewhat make up your mind to purchase a great headphone. If anyone would ask me which headphone to buy within the 500 dollars range, I would tell them to save the other 300 and get this headphone in a heartbeat!\n\nSome extra comparison:\n-ATH-M50x or Beats Pro HD $500 => Beats: Broncos ATH-M50x: Seahawks (lol sorry Broncos fans)\n-This heaphone or QC15: This headphone for sound quality and price. QC15 for sound cancellation. About the same comfort level.\n\nP/S: Sorry for any grammatical errors or mistakes. Please feel free to leave any comments, improvements that I could make for my reviews as well as some more comparisons that I could do. Thanks again for reading my review!",
            "title": "One of the best headphones out there (Could be within the 500 dollars range)",
            "userName": "Thien H. Nguyen \"Thien\""
        },
        {
            "date": "February 24, 2014",
            "rating": "5.0",
            "text": "Love this headset, recommended by MKBHD. If you don't subscribe to his youtube channel, you should. Love the detachable cable, the short cable is great for travel. Soft earcub makes it comfortable to wear all day long.",
            "title": "Had the ATH-M50s, wanting the new version, it's a great product",
            "userName": "Van"
        },
        {
            "date": "February 20, 2014",
            "rating": "5.0",
            "text": "This headphone is totally different from those cheap headphones and earphones. With it I can feel those songs which I have heard hundreds times become...more impressive! I mean you can hear everything! When I started to listen to music with this cool headphone, I am going to cry! The sound is so great! By the way, the shipment is awesome (sold by Amazon with Prime). I got it for two days after I placed the order. I couldn't be satisfied more! LOVE IT! ENJOY IT!",
            "title": "Worth every penny! Love it!",
            "userName": "Amber"
        },
        {
            "date": "February 18, 2014",
            "rating": "5.0",
            "text": "http://youtu.be/e-M4VLPKuG0\nHere's a link to the unboxing I made, in case your interested(if the sound of a sick nose bothers you, it might not be the video for you, just a heads ups(: )\nAnyways, this things get better by the day! I'm no pro, heck, this is the first can that I spend over 10 bucks on! If you plug them into craps, they'll sound like craps, plug them into something amazing, and they'll rewrite amazing! I also like how responsive they are to an eq, especially higher up quality eq's, so if ever theres a part of the spectrum that you feel is too much/ too little, you can tell it, and it'll respond like a boss! This thing brought 3 cables also, really loving that! I can't describe the sound this thing produces with words (I wish I knew how) but, I can say, it's getting better everyday!",
            "title": "Superb",
            "userName": "frank arroyo"
        },
        {
            "date": "March 8, 2014",
            "rating": "5.0",
            "text": "I tried a lot of headphones, Beats, Sol republic, Klipsch. These are the best over the ear headphones I ever had. After Sol republic, was afraid that these too will be unwearable after few minutes. But fortunately, they are very comfortable and sound great. The bass is just perfect, not to pronounced, very accurate. I also like the 3 different replaceable cables it comes with.",
            "title": "Best headphones I ever had",
            "userName": "Arie Schwartzman"
        },
        {
            "date": "March 7, 2014",
            "rating": "4.0",
            "text": "These headphones seem to produce a very clear and crisp audio quality. The feel of the headphones seem very durable and non-cheap. I only wish they were a little louder.",
            "title": "Duarable and functional",
            "userName": "Shane Barnett"
        },
        {
            "date": "March 3, 2014",
            "rating": "5.0",
            "text": "Sounds are extremely crisp.. Way better than the noise cancelling studio beats. Very comfortable even though its right out of box (it took me a while to get used to the beats).",
            "title": "I now know why these headphones are so highly acclaimed!",
            "userName": "David Kim"
        },
        {
            "date": "March 3, 2014",
            "rating": "5.0",
            "text": "This pair of headphones is the best you could get for the price. Other than the soundstage, these headphones are amazing. The bass is clear and punchy but not overwhelming, the mids and highs are crisp, and most importantly, they are really portable. I'm really happy with my purchase!!",
            "title": "Best headphones for under $200",
            "userName": "Oliver"
        },
        {
            "date": "February 26, 2014",
            "rating": "5.0",
            "text": "An amazing step up from what I used to own. When I was younger I was much more naive and ignorant on technology and ended up buying some gaming headphones. I thought they were fair but ended up breaking after a few months. I finally did solid research on headphones and saw some charts on /g/ that recommend these headphones. The experience from these headphones to my last set is night and day (and the last headphones I owned were the same price). Going through and listen to my favorite albums again is just incredible. If you are looking for headphones from 300 dollars and down these are the absolute best purchase to make.",
            "title": "Best purchase of 2014 so far",
            "userName": "John"
        },
        {
            "date": "February 19, 2014",
            "rating": "5.0",
            "text": "This is my first pair of Audio-Technica headphones. After reading several reviews I decided to go with the ath m50x over the original m50 because of the ability to interchange cables and the fact that the cable ends are now tapered to fit phones that have a case on them. And since Im going to use these for personal listening on my phone/ studio work, I could reason the 58$ difference in price. Even though I still haven't burned them in all the way (I'm only about 4 hours in), these are the best sounding pair of headphones Ive ever owned! My phone sounds great, even though there is no amp! But where these headphones really shine is when they are hooked up to my studio pc through my Creative Z 600 ohm sound card. I havent given them alot of juice yet (I'd say around 40-50% volume of my sound card would max these babies out) since they arent fully broken in, but damn is the sound clear! Super clear punchy bass, warm mid tones, and bright highs. A full spectrum of crystal clear distortionless sound. And the sound is only gunna get better as I burn them in! The 3 different size cables give you more versatility in how you use them. A short one for mobile listening, a long one for studio work, and a coiled one that I use on my digital piano. And there is also a very nice pouch to keep them in! Theses headphones make my digital piano sound AMAZING! I get lost in my music with these things on! They fit around the ear which blocks out almost all external sounds and the ear pads are super soft. Definitely something I can wear for hours on in. My only con is that the padding on the top is a bit deceiving. Nothing thats a deal breaker... it just looks in the pictures like a solid piece of padding. But, in reality, there is only a small 1/4 thick strip of padding stuck to a 1 thick hard plastic frame. Even so, the padding is sufficient enough to make these headphones super comfortable. If you are reading this then you are obviously thinking about buying a pair.... My vote is YES. BUY THEM NOW! You wont be disappointed! I'm not. Tried and true speakers with upgraded design. Its a win win! :)",
            "title": "These headphones live up to the legend!",
            "userName": "TylerAnton"
        },
        {
            "date": "March 4, 2014",
            "rating": "4.0",
            "text": "These headphones have an amazing sound quality, they are built extremely well, they look very nice, and the 3 included cables are awesome. However, they were not comfortable for me at all. After wearing them for about 20 minutes, they were so tight from being so sturdy that I actually started to get a headache! These would get 5 stars otherwise and i'm disappointed that I could not keep them due to this reason. Most people probably won't have an issue though! Try them!",
            "title": "Great sound quality, but..",
            "userName": "Chris"
        },
        {
            "date": "March 3, 2014",
            "rating": "5.0",
            "text": "Very musical and accurate headphones. No, I'm not an expert audiophile, but I can tell differences in what sounds good, or bad, without having to quote specs. If you like music, you will love these headphones ... if you do one thing.\n\nYou MUST break these in first. When I first tried them they were a bit boomy in the low end. So, based on advice from an audiophile friend, I hooked them up to a spare receiver and let them run for 2.5 days with just static. Yes, that is a recommended way of breaking them in so you don't have to put the 50 to 60 hours of wearing them before break in, let the receiver do the work for you. After that, the bass smoothed out and what can I say, I love these headphones. I wonder if some past less-than-stellar reviews were by people who didn't give them the proper break in.",
            "title": "After break in, fabulous headphones",
            "userName": "Ken Stewart"
        },
        {
            "date": "March 1, 2014",
            "rating": "5.0",
            "text": "The ATH-M50x headphones are a great improvement over the M50. Although the upgrade might not be for everyone, the removable cable is a very nice added feature. The ear cups are also a lot softer than the M50's. These headphones keep the great sound quality, build, and comfort of their predecessor. A great buy!",
            "title": "Great Headphones",
            "userName": "Max Schumacher"
        },
        {
            "date": "February 25, 2014",
            "rating": "5.0",
            "text": "Ordered the black one this past Friday, it came on Tuesday (today). I came home to find them in the Amazon box, so I quickly unboxed the headphones and have been using them ever since (about 3 hours now). They are as perfect as everyone has said the M50 is. These are the first pair of headphones I have ever owned (I was stuck with Beats clones till now), and I must say that are the best purchase I have made in a while. I am able to hear things in my music that I never noticed before, and the tones are amazing. No one type of sound in over or underwhelming. Everything is perfect. I hear that the only difference between the M50 and the M50x is the detachable cord, so it isn't much of an upgrade from the old ones. Audio Technica quite wisely went with the IF IT AIN'T BROKE DON'T FIX IT approach for the sound, while making the structure more aesthetically pleasing an more comfortable. However, if you don't own a pair of M50s at all (regular or X) you NEED to get these.\n\nEasily the best headphones on the market.",
            "title": "Amazing.",
            "userName": "Swapnav Deka"
        },
        {
            "date": "February 25, 2014",
            "rating": "5.0",
            "text": "The clarity is so crisp and I know because I also have Bose and there pretty close in how they sound!! it's truly worth the money I really recommend.",
            "title": "These headphones are so amazing!",
            "userName": "Jose Bahena"
        },
        {
            "date": "February 24, 2014",
            "rating": "5.0",
            "text": "Trust me -you won't be disappointed with these for the price. Consider these as STUDIO headphones- not something you wear while doing anything active as they are large but the sound ? For the price (under $400), they are some of the best I've heard. Ive owned quite a few headphones over the years and I'm really impressed with these. These realy shine at higher volume levels- No distortion cranked up to the point of being just TOO loud. Awesome bass down to like 10k- dive rumble dub step kind of deep it can handle nicely. I like these for metal. Great over-all ballance leaning to the low end. Lacking slightly in spacial highs and upper sparkle where pricier cans excel -like V- Moda M100 Crossfades (@$300). Comfortable. Different removable cables. Well built. I dont think you could find a better set for twice the price for home/ mixing/ & especialy if you listen to heavy stuff loud , dub or progressive metal.",
            "title": "Wow!",
            "userName": "A. Design \"tech art\""
        },
        {
            "date": "February 21, 2014",
            "rating": "5.0",
            "text": "I studied many head sets for a few days before purchasing these. Arrived in the agreed time from the seller, packaged well enough in the shipping container. The design of the head set is a perfect fit even for the large coconut I have. Very comfortable, closed system for great sound reproduction and isolated from ambient sounds. Three detachable cords, various lengths that lock to the headset, perfect. The compact configuration of collapsing for storage is great (if the headset ear cups had a flat spot on the bottom they could be stood up for room decoration). I couldn't be more pleased with this model and brand. I'll even go so far to compliment the headset packaging from the manufacture, even that is well designed. The only unknown is the ability to replace the ear pads when needed and that day will come.",
            "title": "Audio-Technica ATH-M50x Professional Headphones",
            "userName": "Buzz3"
        },
        {
            "date": "February 20, 2014",
            "rating": "5.0",
            "text": "I've generally been an earbud kind of guy and though Bose were a high end headset for most of my life. I was incredibly mistaken. Active noise cancelling degrades the sound of any audio source which became abundantly clear when testing the M50x against my parent's Bose headphones.\n\nThe M50x is incredibly clear, which a rich sound. It has a deep, full bass register as well which some people find unappealing. I love it. I listen to a lot of music but mostly rock, metal, and dance music. These all sound fantastic coming through these cans.\n\nAnd the passive noise cancelling that occurs due to their over-the-ear nature is outstanding. It doesn't block out everything so don't expect a concert hall experience if you are one of those tools who wears their full size cans on the bus or walking around the city. They will still give you a great audio experience though. I use these mainly in my home and at work. I've never had sound impedance due to outside noise in these environments.\n\nThey come standard with pleather ear cups, but you can buy the Shure HPAEC940 Replacement Velour Ear Pads if you want a softer pad. They aren't as tight as the standard pads, but they won't just fall off either. I can't stand pleather resting against my face for long periods of time and the Shure pads feel amazing without degrading the sound these cans put out.\n\nI chose the M50x after purchasing the M50 because it comes with a detachable cable. I love coiled cables but they are much too heavy when using these headphones with a portable player or my phone. The only advantage I see in the plain M50s is the coilspring on the cable near the plug. This will prevent wear and tear on a delicate section of the cable. The M50x does not have this :(\n\nIt comes with three cables: 1 - 1 meter (3 foot) to 3 meter (10 foot) coiled cable, 1 - 3 meter straight cable, and 1 - 1.2 meter (3.9 foot) straight cable. It also has a 1/8 to 1/4 plug adapter that screws on to the cables. These detachable cables also lock into the cans, which is a plus. But, this makes them proprietary so you can't buy 3rd party cables, only cables made by Audio-Technica.\n\nI bought these with a Schiit Magni amp but have yet to test them with amplification because my computer doesn't have RCA inputs. I have an RCA to 1/8 cable coming Friday so I'll update my review once I test them on the amp.\n\nHowever, even without an amp test, I don't hesitate to recommend these to anyone looking for a set of entry level studio quality cans.",
            "title": "These Cans Rock",
            "userName": "Josh Baddley \"DeGrey\""
        },
        {
            "date": "March 5, 2014",
            "rating": "5.0",
            "text": "Years ago CR reviewed headphones and wrote that their highest rated, over-the-ear headphones were \"the most accurate\" they had ever reviewed. Those phones were the Sony MDR-V6. The ATH-M50x is excellent, but in a side by side comparison with the V6, it falls slightly short.\n\nThe V6 has a better high end and, to my ears, a livelier presence. The low end is awesome. Music sounds more dynamic on the Sony. The down side to the V6, if you call it a down side, is that you hear everything...chairs creaking, microphone distortion, traffic, wind players breathing, careless recording levels, birds chirping, poor editing...\n\nOver the years, the Sony MDR-V6 has been my \"go to\" headphones. I've been looking for better all along. I haven't found them. To my ears, the MDR-V6 is still the best. They reproduce everything clearly, cleanly and accurately, the highs and lows are better than any other pair I've listened to, and the music simply sounds more alive.\n\nThe Audio-Technica ATH-M50x is an excellent alternative. I will not be sending my pair back. Most times I find myself plugging them in when I'm not doing highly critical listening. They are comfortable, and easy to listen to. They have a warm, musical way of reproducing sound. They are the second most accurate phones I have found. High accuracy can become tiring. I can listen to the M-50x for extended periods without significant fatigue. The differences with the Sonys are subtle. They are there, but you will not be able hear them unless you are able to get a pair of MDR-V6s to compare with the M50x.\n\nIf you want pleasant, accurate, smooth, musical sounding reproduction full of depth without highly detailed background noise (you will still get it with the M50x, just not as much as with the MDR-V6), I can seriously recommend the Audio-Technica ATH-50x headphones. I really doubt you will be disappointed.",
            "title": "Excellent, high quality phones, but they aren't the Sony MDR-V6.",
            "userName": "G. Ronnback"
        },
        {
            "date": "February 11, 2014",
            "rating": "5.0",
            "text": "Before ordering M50x, I bought M50s. The sound quality is same but with detached cables, I think M50x is what you want to buy. enjoying now.",
            "title": "Feel good",
            "userName": "SOos"
        },
        {
            "date": "February 26, 2014",
            "rating": "4.0",
            "text": "Bought this product for a gift and they are very happy with these headphones.\nI would recommend this product.\nQuick shipping.",
            "title": "Purchased as a gift",
            "userName": "leala kurtzke"
        },
        {
            "date": "February 19, 2014",
            "rating": "4.0",
            "text": "This is my very first pair of studio/professional headphones. They fit very comfortably and they seem to be high quality. I plan on keeping them... however, they're just as loud as my $15 skullcandy in the ear headphones. I was expecting some marvelous sound experience, but they delivered like my cheap headphones. What I'm looking to enhance my purchase is perhaps an amplifier designed for headphones.",
            "title": "Great Headphones, but don't buy just for an MP3 player",
            "userName": "P DA P"
        },
        {
            "date": "February 24, 2014",
            "rating": "4.0",
            "text": "This product disappointed me. I was reluctant to purchase because of the locking cable design. Sure enough, the short cable will not engage and just falls out. The other cables work, but I bought the M50x entirely for the possibility of using it with a short cable. Before I return it I listened to an assortment of tracks -- all really excellently reproduced by these headphones. But I never buy a defective product twice. I'll be getting my money back and try to find some headphones that sound this good but have acceptable build quality. The locking design is cheap and prone to defect. Very disappointing.\n\n[UPDATE 1] I decided to give it another chance, and I'm returning it today for replacement instead of refund. I'll redo this review. It'll get either one star (if the replacement is also defective) or 3 (if it's perfect -- I REALLY hate having to schlep defective stuff to UPS and it'll lose two stars no matter what).\n\n[UPDATE 2] First, my experience with the replacement. It arrived about 18 hours after I filled in the replacement request. Yes, the next day, early in the morning. Astounding. It was delivered by Amazon, not a carrier. (I didn't accept the delivery myself, so I don't know if it was on an Amazon Fresh truck.) It was shipped from San Leandro, across San Francisco Bay. I wish all my Prime orders could be shipped from San Leandro on an Amazon truck! I'm not complaining, really, just fantasizing. Amazon was terrific!\n\nBack to the M50x. All the cables engage and lock. What's more, it seems they might stay in place from friction alone, without locking. This is great! Why? I had thought that the only way to connect the cables was to lock them in place. I considered this a fault, not a positive feature. I prefer ordinary cable plugs, because once or twice a year I will do something goofy and catch the cable on something. I have been spared (with the ordinary plugs on my old ATH-ANC7B headphones) by the plug disengaging rather than tearing the phones off my head or, worse, my phone out of my hand or pocket. Screw up with ordinary plug: no damage, zero cost. With locking plug: who knows? Likely something much worse. So I'm pleased that it may be possible to use these headphones with the cable engaged but not locked. I will gladly trade an occasional disengagement for a locked cable and a busted phone on the sidewalk. So, I still do not like the locking cable plug design. I'd prefer an ordinary snap-in plug. This molded plastic locking gizmo will, I believe, over time, be prone to failure.\n\nAudio quality is just as good as the returned unit. That is, very good. The mid bass is where I hear the biggest improvement over the ANC7B. Very clean, defined, even airy. The high end is also good, but that is no surprise when comparing this unit to an active noise cancelling one. The mids are clean and defined, though a little cool for me, but this is entirely subjective and the kind of slight niggle that is forgotten after a few weeks with new headphones.\n\nThe headphones seem a little tight, but I'm used to my five-year-old ANC7B, which had become very comfortable. We'll see if the comfort of the M50x gets better or worse over time.\n\nAppearance is about as nice as nearly entirely plastic headphones can be.\n\nIn summary, four stars for very good audio quality and adequate comfort and appearance. I might have given five without the initial disappointment with the cable plug defect, and I definitely would have given three had Amazon not come through so well.",
            "title": "Disappointing. At first...",
            "userName": "Richard Reich"
        },
        {
            "date": "March 2, 2014",
            "rating": "3.0",
            "text": "the sound is very clear and it looks attractive but it has low volume and bass. you use fios E6 to increase the volume it sounds very cool with it",
            "title": "not really what i expected",
            "userName": "INK"
        },
        {
            "date": "February 27, 2014",
            "rating": "3.0",
            "text": "The detachable cable made me think that stress relief would not be an issue - but it locks in instead of releasing if you step on the cord and stand up - not sure how well this will work.\n\nI broke it in 2 days. The right side flipped upside down & I (stupidly) tried to force it into proper position w/o realizing it was disoriented. Thought I had put something heavy on it,\n\nThe phones are a bit tight for my medium size head, jams my glasses between ears & head to the point where using them for more than an hour is uncomfortable.\n\nThe sound is good, although there's something about the mids that I would adjust if I could.",
            "title": "I got this primarily for reliability",
            "userName": "RNVLD3"
        }
    ]
}