{
    "Count": "11",
<<<<<<< HEAD
    "Last Update": "2014-04-23 19:34:02.955657",
=======
    "Last Update": "2014-04-23 19:10:18.508106",
>>>>>>> FETCH_HEAD
    "Product Name": "Plantronics DA45 USB Audio Processor",
    "Reviews": [
        {
            "date": "September 6, 2010",
            "rating": "5.0",
            "text": "I just plugged this baby into my computer and it installed itself and worked great. I have done many GoToMeetings with this and it works flawlessly every time. It was a great addition to my Plantronics headset.",
            "title": "Plug and play",
            "userName": "Robert A. Stein \"superbroker1997\""
        },
        {
            "date": "May 9, 2013",
            "rating": "5.0",
            "text": "This device cannot be avoided. Teleworks get a mike-off switch, volume control, quick-cord-separation device, and very sturdy electrical cord. Expensive but made for reliable use.",
            "title": "Essential for teleworkers",
            "userName": "acwitko"
        },
        {
            "date": "February 10, 2014",
            "rating": "5.0",
            "text": "I purchased this for the H51 Supra Monaural Tube Headset. This is fantastic. It works with both the system software, but also with other software I was not sure of. Purchased because of some specific software my company uses, this works for all audio conferencing software I have to use, even with different clients' systems.",
            "title": "Great Audio Tool",
            "userName": "Scott Barnes \"tech junkie\""
        },
        {
            "date": "April 21, 2014",
            "rating": "5.0",
            "text": "Have used Plantronics headsets for many years. Needed a microphone on a workstation. This adapter works as described with my headset.",
            "title": "Works",
            "userName": "Neal Kazmi"
        },
        {
            "date": "July 8, 2013",
            "rating": "5.0",
            "text": "PC (Win7) detected and picked it right up, I use it daily for work along with a Platronics HW251N and it works flawlessly, what more to say",
            "title": "Simple and functional",
            "userName": "JDNKC"
        },
        {
            "date": "June 28, 2013",
            "rating": "5.0",
            "text": "Easy to install with vendor headset and it works. Even music sounds better - although I use it mainly for phone calls.",
            "title": "Works!",
            "userName": "vvs49686"
        },
        {
            "date": "December 24, 2012",
            "rating": "5.0",
            "text": "Bought this to use with my Plantronics headset for my work from home system. Installed fine with the built in Windows 7 drivers on a company computer without requiring admin rights. No documentation in the box; there was a CD but I didn't mess with it. One button to mute (lights up and chirps when muted), rocker to change volume, another button that I couldn't figure out the purpose of, but doesn't affect how it works (but see update below).\n\nCould have gotten a gaming headset, probably should have, but if I'm going to wear this for ten hours while working, would rather have the one I'm used to.\n\nUpdate: The extra button, that looks like a one-eared headset, is to allow you to answer a call on a softphone without having to click on anything on the computer. It requires the software to be installed, though, which I haven't bothered with.",
            "title": "Works fine for what it is.",
            "userName": "StarChaser"
        },
        {
            "date": "April 6, 2012",
            "rating": "5.0",
            "text": "Works fine and I guess I would have to say I cheated in that my company had bought me one for business use so when\nneeded one for home use I went with what I know works. Also the service I got from Amazon Marketplace's DataVision\nwas way better than I had expected.",
            "title": "DA45 USB audio processor",
            "userName": "Robert E. Osborne"
        },
        {
            "date": "November 28, 2012",
            "rating": "4.0",
            "text": "This thing is really nice for the professional use: My telephone, BB and laptop is compatible, and I can have phone meetings for hours.\n\nOnnly drawback: Listening to music is horrible with it! The sound is tinny. Must be a SW issue, I keep digging in to solve this.",
            "title": "awesome device, horrible to listen to music",
            "userName": "Julius"
        },
        {
            "date": "February 17, 2013",
            "rating": "1.0",
            "text": "The mute button stopped working shortly after it was received. Customer may not have original box to return product. Can product still be returned for replacement?",
            "title": "Mute button on audio processor",
            "userName": "Kathy Sanders"
        },
        {
            "date": "August 28, 2011",
            "rating": "5.0",
            "text": "This item is what I needed and wanted and does just what I need it to do. The item got to me in a reasonable amount of time and in good condition.",
            "title": "Quality item",
            "userName": "Pat"
        }
    ]
}