{
    "Count": "14",
    "Last Update": "2014-05-06 19:57:32.809921",
    "Product Name": "eForCity Laptop Sleeve compatible with Apple MacBook Pro 13-inch, Pink",
    "Reviews": [
        {
            "date": "January 9, 2014",
            "rating": "5.0",
            "text": "for the price, its not bad BUT,\nthe color is NOT bright. its like stained with almost like a grease, it just seems dirty.\nthe smell is horendous as well!\n\ni would not recommend, spend the extra money on a nice one!",
            "title": "yuck!",
            "userName": "Brianna Seiberlich"
        },
        {
            "date": "March 24, 2014",
            "rating": "1.0",
            "text": "Smells nasty, stained, looks dirty and used. I should have listened to the other reviews but thought Id give it a whirl.",
            "title": "Do not purchase.",
            "userName": "Jenifer Kowalczyk"
        },
        {
            "date": "March 17, 2014",
            "rating": "3.0",
            "text": "This product works well for basic covering. Sliding your macbook in here will stop it from scratching any other items in your carry along bag/ backpack. However, the covering is not very thick and therefore I would not recommend for anybody that might toss their bag around carelessly or be put in situation that may cause your bag to be slammed around. This case will stop scratching but will not protect the laptop from any hard, fast, or heavy movements/ drops.",
            "title": "Thin and Flexible",
            "userName": "Rebecca Thompson"
        },
        {
            "date": "February 20, 2014",
            "rating": "1.0",
            "text": "Don't like the smell and the material for the expensive product. It's polyester and and should be made of spandex.",
            "title": "Not suitable material for the product",
            "userName": "Shelly"
        },
        {
            "date": "January 28, 2014",
            "rating": "2.0",
            "text": "I just received my laptop sleeve and I'm not satisfied. The color is not as bright as it looks in the picture.It looks used, dirty and a little faded. I don't recommend it.",
            "title": "Don't like it",
            "userName": "Jessica"
        },
        {
            "date": "January 22, 2014",
            "rating": "2.0",
            "text": "I dont know why, but the item i received it's just a little too big. I'm not returning it just because i really do need it for my everyday use. Though for the price of it, it's a good product.",
            "title": "It does not fit my Macbook Pro 13-inch",
            "userName": "daniela"
        },
        {
            "date": "January 21, 2014",
            "rating": "3.0",
            "text": "I thought this was for 15 inch MacBooks, clearly not. Wasn't highlighted well in the description of product, other wise I wouldn't have bought it.",
            "title": "Not the right size",
            "userName": "Ssavory"
        },
        {
            "date": "April 22, 2014",
            "rating": "4.0",
            "text": "the pink kinds of look dirty and it was loose for my 13'' air but it was fine after putting it into the dryer!",
            "title": "light and thin= what i was looking for",
            "userName": "Emily Chang"
        },
        {
            "date": "April 17, 2014",
            "rating": "3.0",
            "text": "I wouldn't recommend this sleeve because its flimsy and doesn't really protect the macbook from drops. I do like how quick I received this product. Im not saying that Im not going to use it because I am but it's just going too be my temporary case for now.",
            "title": "Not What I Expected...",
            "userName": "Ronnece"
        },
        {
            "date": "April 13, 2014",
            "rating": "3.0",
            "text": "i liked it. it was nice. it was just what i was exceeding to get. not that bad. it was a good rice so i was happy as well. thanks !",
            "title": "nice.",
            "userName": "Barbara Godoy"
        },
        {
            "date": "March 24, 2014",
            "rating": "5.0",
            "text": "I will recommend this product, it has a funny smell but for an everyday use that's fine. Shipment is very fast I got it within 3 working business days.",
            "title": "I like it",
            "userName": "Jessica Campos"
        },
        {
            "date": "February 28, 2014",
            "rating": "4.0",
            "text": "a good cover for basic protection for your laptop and the colour is as per the picture. Its better to use another laptop bag for safety as it is not very padded",
            "title": "sleek cover in the right colour",
            "userName": "Laura Wrede"
        },
        {
            "date": "January 16, 2014",
            "rating": "5.0",
            "text": "Small and smile and fits perfectly . I definitely would recommend purchasing this item. Cute, light weight and sleak too.",
            "title": "Love it.",
            "userName": "Eleanor Ross"
        },
        {
            "date": "January 15, 2014",
            "rating": "5.0",
            "text": "it is a great buy for the price, it keeps my Mac protected from any scratches when i put in my backpack.",
            "title": "great",
            "userName": "hlopez"
        }
    ]
}