{
    "Count": "49",
    "Last Update": "2014-05-06 19:52:37.601228",
    "Product Name": "Butterfly Umbrella Purple/Blue",
    "Reviews": [
        {
            "date": "August 16, 2012",
            "rating": "5.0",
            "text": "I bought umbrellas for three grandkids under the age of four. Now they love it when it rains and ask to go outside with their umbrellas. They played it with for hours in the rain yesterday.\n\nThis one was for the girly girl and she loves to prance while holding it. It's perfectly sized for a child and easy for her to hold but big enough for me to use. Opens and closes like a dream.\n\nUpdate: Had this umbrella for 19 months now with no damage and it gets used every time it rains.",
            "title": "A Lot of Fun For A Little Money",
            "userName": "Conspicuous Consumer"
        },
        {
            "date": "November 4, 2013",
            "rating": "5.0",
            "text": "Absolutely enchanting and adorable! I wish they made an adult size!! My step daughter absolutely loves it! I do recommend this product.",
            "title": "Enchanting!",
            "userName": "Marty T."
        },
        {
            "date": "September 1, 2013",
            "rating": "5.0",
            "text": "I got this for my 6 year old granddaughter who was visiting for part of the summer. We had plans for some day trips and rain was predicted so I ordered it on line. Purple is her favorite color and she loves butterflys so it soun perfect.\n\nIt is easy for to open and close and she is delighted with this",
            "title": "Butterfly Umbella perfect fo a little one",
            "userName": "migcin"
        },
        {
            "date": "December 28, 2012",
            "rating": "4.0",
            "text": "I bought this for my 3 year old granddaughter. Very pretty and unique. She loved it! It is kid friendly with round plastic knobs on the end of the spokes. Easy to operate up and down. I did have to return the first one I got as it was defective with a bent up rod, but I received a new one very quickly that was perfect.",
            "title": "Butterfly Unbrella review",
            "userName": "Claire Woosley"
        },
        {
            "date": "March 7, 2014",
            "rating": "5.0",
            "text": "My 3.5 year old has wanted an umbrella for quite a while, and I wanted something made for children that wouldn't have any sharp metal pieces that might poke out. This one fits the bill and is really adorable at the same time. Very easy for her to open and close it as well. She likes to sit in it with her stuffed animals and so far it's held up.",
            "title": "So so cute",
            "userName": "H"
        },
        {
            "date": "February 14, 2014",
            "rating": "5.0",
            "text": "So far, has not broken...it has lasted a few beatings. Classmates want to know where this was bought. Very cute thing...",
            "title": "Kid Loved it!",
            "userName": "Iris &amp; Cruz"
        },
        {
            "date": "January 21, 2014",
            "rating": "1.0",
            "text": "I pulled the umbrella out of the box and it was broken. I didn't even open it. Adorable looking, but very cheaply made.",
            "title": "Cheap",
            "userName": "Hramama"
        },
        {
            "date": "August 18, 2013",
            "rating": "5.0",
            "text": "This umbrella is pretty well made, it's absolutely my daughter's favorite, super cute, I definitely recommend this product, especially at this price point.",
            "title": "Awesome",
            "userName": "M. Martin"
        },
        {
            "date": "August 4, 2013",
            "rating": "5.0",
            "text": "Our five year granddaughter loved this birthday present. She lives where it rain a lot and needs a quality kid's umbrella. Functional, easy to use, cute, and durable!",
            "title": "Really cute!",
            "userName": "bjohnson \"bjohnson\""
        },
        {
            "date": "January 21, 2013",
            "rating": "5.0",
            "text": "Cute umbrella, it's been used quite a bit and still holding up. Good quality and I expect it to hold up for quite a while",
            "title": "Fine quality umbrella, still holding up a month later",
            "userName": "Roye"
        },
        {
            "date": "May 6, 2014",
            "rating": "5.0",
            "text": "It is just as advertised and looks. And more important as my Grandaughter says it is just what she ordered",
            "title": "Very good product",
            "userName": "Judith Grant"
        },
        {
            "date": "May 1, 2014",
            "rating": "5.0",
            "text": "This umbrella is great: colorful, serves it purpose well, and seems to be well made.\nThe butterfly wings sticking out are just adorable.",
            "title": "Butterfly Umbrella - great lovely umbrella",
            "userName": "SibBear"
        },
        {
            "date": "April 24, 2014",
            "rating": "5.0",
            "text": "This umbrella was such a hit at the zoo. It was sprinkling and our little girl couldn't wait to pull it out and run around like a little butterfly. Great buy!",
            "title": "Too Cool",
            "userName": "Sarah Koperski"
        },
        {
            "date": "April 15, 2014",
            "rating": "5.0",
            "text": "She's an advanced three-year old. She carried it around the house and out in the yard. She looked up at the butterfly and insisted that Grandma walk under it with her and she laughed and smiled with such pleasure. She hoped it would rain so that she could try it in the rain on the sidewalk. It was a BIG Hit.",
            "title": "Scottie LOVED this umbrella",
            "userName": "Rose"
        },
        {
            "date": "April 14, 2014",
            "rating": "5.0",
            "text": "I like that it is curved downward and the points are covered with protective balls. great colors and my girl loves it. it's easy for her to open, too.",
            "title": "adorable!",
            "userName": "Traci Guidry \"T is for Texas\""
        },
        {
            "date": "March 25, 2014",
            "rating": "4.0",
            "text": "a good umbrella for my five year old. not exceptionally durable but very cute and does the job of keeping her dry.",
            "title": "good umbrella for kids",
            "userName": "Matthew Robbins"
        },
        {
            "date": "February 28, 2014",
            "rating": "5.0",
            "text": "My 6yr old daughter loves this umbrella.\nIt is much prettier in person. The colors are much brighter than the picture. This umbrella is easy for my 6yr old to open and close while being sturdy enough not to break.",
            "title": "Perfect for my 6yr old",
            "userName": "erica8123"
        },
        {
            "date": "February 16, 2014",
            "rating": "5.0",
            "text": "So far seems to be good quality. Not bad for the price. The interior is a slightly flexible plastic, which is good for toddlers...They are rought. We'll see how well it holds up.",
            "title": "My neice loves it",
            "userName": "Cyndi W."
        },
        {
            "date": "February 10, 2014",
            "rating": "5.0",
            "text": "This is a very sweet umbrella and seems to be good quality--the material is a nice weight and the construction feels good. The pink is a little more fuschia in real life. It's a good size, too--possibly a little big for my 3-year-old to handle easily, but I'm glad she won't be growing out of it in a year or two.",
            "title": "Nice umbrella",
            "userName": "Reader Writer \"Mary\""
        },
        {
            "date": "February 7, 2014",
            "rating": "4.0",
            "text": "Nice umbrella for my granddaughter. She loves the colors & the wings. It is more of a toy for her, as we live in an area where we don't get much rain.",
            "title": "Granddaughter loved it!",
            "userName": "Tawnia Moody \"grandmaT\""
        },
        {
            "date": "January 23, 2014",
            "rating": "5.0",
            "text": "I bought this for my granddaughter to match her rain coat and boots. She especially loved the butterfly and the wings that stick up a little from the umbrella.",
            "title": "Sooo cute!",
            "userName": "Nana in Seattle"
        },
        {
            "date": "January 6, 2014",
            "rating": "5.0",
            "text": "I bought this for my 7yr.old Grandchild, who is wild about! It's a very happy umbrella and you can't help bought laugh.",
            "title": "Yes!",
            "userName": "Nancy"
        },
        {
            "date": "January 5, 2014",
            "rating": "5.0",
            "text": "Our granddaughter really liked this when she received it for Christmas. The colors are vibrant and it is a really nice umbrella.",
            "title": "Cute as can be!",
            "userName": "Sylvia \"Sylvia\""
        },
        {
            "date": "January 3, 2014",
            "rating": "5.0",
            "text": "My 3 year old granddaughter loved this. She wears it often, rain or not. It runs smaller than the kiddo brand which I have purchased in the past.",
            "title": ":-)",
            "userName": "Paula Minsky"
        },
        {
            "date": "January 1, 2014",
            "rating": "5.0",
            "text": "My girls love these umbrellas. Quick shipment and excellent for the price. Cute, fabulous and easy enough for my girls to use. (Ages, 5, 3 & 3)",
            "title": "Super cute!",
            "userName": "R. Armijo \"kandy4kraze\""
        },
        {
            "date": "December 30, 2013",
            "rating": "1.0",
            "text": "Just as the title reads, this product arrived bent and broken. I wish I had listened to the other reviewers and not ordered this item. The box was also messed up so maybe that played a part in what happened.",
            "title": "It arrived bent and broken",
            "userName": "anonamous"
        },
        {
            "date": "December 5, 2013",
            "rating": "5.0",
            "text": "My three young grand daughters LOVED these umbrellas! I was pleased they were well made and didn't pinch little fingers. A very nice product.",
            "title": "Highly recommended!",
            "userName": "Ballad"
        },
        {
            "date": "December 1, 2013",
            "rating": "5.0",
            "text": "Very cute! My grand-daughter loves this and has to take it walking with her like a little lady. Practical and fun in the rain or shine!",
            "title": "Great little gift!",
            "userName": "Kim"
        },
        {
            "date": "November 30, 2013",
            "rating": "5.0",
            "text": "My little girl loves it! (She's 5 and a half). Easy open and close and super cute!! She can't wait til it rains so she can use it!",
            "title": "My little girl loves it!",
            "userName": "Michelle"
        },
        {
            "date": "November 22, 2013",
            "rating": "4.0",
            "text": "My five year old loves this umbrella and she gets a lot of compliments on it. It's cute and girly without being princess-y It also opens and closes very easily; she hasn't had any issues with operating it. The two issues that I have are as follows: 1. I think the wings that stick out look like cat ears. I know that's a personal opinion but really, it's all I see. 2. The material on it is a bit flimsy. We've used it about a dozen times and there are already a few small tears on the top, most likely from the pressure of opening it. Water isn't coming through the top yet but I don't see it lasting more than a year. It's not a very expensive umbrella though, and it's easy for her to use, so I'm still giving it a high rating.",
            "title": "A little flimsy but still worth the price you pay.",
            "userName": "Amy C."
        },
        {
            "date": "November 20, 2013",
            "rating": "5.0",
            "text": "Very cute and just right for my grand niece. They can walk in the rain with their mommy and daddy.",
            "title": "very cut",
            "userName": "Debra Grey"
        },
        {
            "date": "November 14, 2013",
            "rating": "5.0",
            "text": "my 5 year old recieved this for her birthday and it was her favorite present. She carries it everywhere whether it's raining or not! She gets lots of nice compliments on it which just makes her face beam :) It is good quality and has withstood some abuse. I really appreciate that the design is easy for her to put up and down without pinching her fingers.",
            "title": "good quality and very cute",
            "userName": "Bugs Mom"
        },
        {
            "date": "October 31, 2013",
            "rating": "4.0",
            "text": "The pink in this umbrella is a lot more like a deep purplish-pink. Not quite as pictured. The umbrella is a fine quality and it opens and closes rather easily.",
            "title": "Cute. Colors are darker than they appear",
            "userName": "am"
        },
        {
            "date": "October 26, 2013",
            "rating": "5.0",
            "text": "I bought this for my four year old and she won't put it down ...open ,close,open,close...lol. She loves it! It really is a super cute and safe umbrella. Good quality, no sharp metal ends, no sharp metal top...the top is flat and the metal is covered in plastic so it's safe from getting an eye poked out. The wings look really cute from the front and from the back. Great purchase!!!!!",
            "title": "super cool umbrella ..",
            "userName": "Rachel Wright"
        },
        {
            "date": "October 22, 2013",
            "rating": "5.0",
            "text": "Bought this umbrella for my daughter and she fell in love immediately with it! It's made from very durable material, no pointy ends to worry about and she looks so cute under it!",
            "title": "Great umbrella for kids!",
            "userName": "Alialy Garcia \"Super Mama\""
        },
        {
            "date": "October 17, 2013",
            "rating": "5.0",
            "text": "My granddaughter, age 2 1/2, loves this umbrella. We go outside when it is raining and even when it is not. I think it is a good product for a good price. Highly recommend!",
            "title": "Great little umbrella!",
            "userName": "Kay Evans"
        },
        {
            "date": "October 13, 2013",
            "rating": "3.0",
            "text": "My grand-daughter really wanted this item. The first one broke upon first use. The second one came damaged. Hoping for the best with third.",
            "title": "Flimsey",
            "userName": "marilyn a interlandi"
        },
        {
            "date": "July 29, 2013",
            "rating": "5.0",
            "text": "Bought three umbrellas for my neices and nephews. They loved them and it was a big hit for school age.",
            "title": "Umbrella",
            "userName": "quinnka"
        },
        {
            "date": "June 19, 2013",
            "rating": "5.0",
            "text": "I ordered 2 of these for my granddaughters' Easter gifts (ages 3 and 6). They loved them and have used them often, roughly at times. The umbrella is well-made and sturdy - a worthwhile investment.",
            "title": "Quality kids' umbrella!",
            "userName": "G. Clark"
        },
        {
            "date": "May 20, 2013",
            "rating": "5.0",
            "text": "The fact that I bought this in December and it is now almost June and it is still working is a plus.\nMost of the children umbrellas that we have purchased have been of poor quality. This one has been great. My 5 year old loves it and she even plays around with it and it still works.",
            "title": "Nice umbrella",
            "userName": "Pinkpeeps"
        },
        {
            "date": "April 25, 2013",
            "rating": "5.0",
            "text": "This umbrella is perfect for toddlers. My three and two year old love it, and it is big enough to last them through the next few years.",
            "title": "Perfect for toddlers",
            "userName": "Sabrina"
        },
        {
            "date": "April 24, 2013",
            "rating": "5.0",
            "text": "My daughter loves this umbrella! Its very easy for her to open and close for a toddler. I love the color and the 3D effect on it. Great buy!",
            "title": "Purple Butterfly!",
            "userName": "April Mangum"
        },
        {
            "date": "April 23, 2013",
            "rating": "5.0",
            "text": "Bought this little umbrella for my three-year-old niece because she wanted her own bubrella. Neither of us were disappointed. The umbrella is solidly built with a clever 3-d butterfly design. Hopefully it will cheer up many a rainy day.",
            "title": "Clever design",
            "userName": "Karen Hertzberg"
        },
        {
            "date": "April 14, 2013",
            "rating": "5.0",
            "text": "I got this one along with the ladybug one. They both are great! Sturdy, kid friendly, and cute but, not too babyish!!",
            "title": "Perfect!!",
            "userName": "Tiny Dancer"
        },
        {
            "date": "January 10, 2013",
            "rating": "5.0",
            "text": "This is the first kids umbrella I bought for my 4-year old twins and they love it. I especially like the big plastic balls at the end of the spokes so that they can't poke each other or other people! Its also well rounded and seems to provide enough protection on rainy days. So far so good, absolutely no complaints.",
            "title": "super cute and well constructed",
            "userName": "Taradevi"
        },
        {
            "date": "January 2, 2013",
            "rating": "4.0",
            "text": "my 3 year old loves pink, purple and butterflys. i really couldnt go wrong with this umbrella! it could be better quality.",
            "title": "very cute",
            "userName": "smokeydae"
        },
        {
            "date": "December 25, 2012",
            "rating": "5.0",
            "text": "My 3 year old niece loves this umbrella. It is the perfect size for her and it is very unique",
            "title": "Cute kids umbrella!",
            "userName": "Cai"
        },
        {
            "date": "November 9, 2012",
            "rating": "5.0",
            "text": "I am pleasantly surprised to find that this umbrella is Not flimsy at all -- especially for the price, it's a steal at 9 bucks!",
            "title": "Sturdy and well made",
            "userName": "2010NewMom"
        },
        {
            "date": "October 29, 2012",
            "rating": "4.0",
            "text": "Bought this a month ago for my 5 year old. She loves the colors and has played with it a lot inside so far. I've had to replace a rivet that attaches the metal that holds up the wing at the top, which wasn't a big deal, but then we decided no more playing in the house and we'll only use it during the rain! Haven't had too much chance to try it out in the rain yet, but it has kept her dry through one so far. Seems pretty durable and very easy for a 5 year old to operate. The safety covers on the metal ends are great, and have stayed on through everything so far! I like the curved handle. This is a great umbrella for kids, seems very safe and so far pretty durable! Colors are beautiful too.",
            "title": "Great for 5 year old",
            "userName": "C.S. \"mamato2\""
        }
    ]
}