{
    "Count": "21",
    "Last Update": "2014-05-06 20:16:01.315302",
    "Product Name": "All-Weather Solid Black Mini Umbrella",
    "Reviews": [
        {
            "date": "September 14, 2011",
            "rating": "4.0",
            "text": "i wish i would leave this product star-less. all it took was opening the umbrella out of the box for the supporting metal pieces to snap. threw it in the trash with the box. save yourself the time burn the $9 you would have spent.",
            "title": "horrible.",
            "userName": "Aaron"
        },
        {
            "date": "July 20, 2012",
            "rating": "1.0",
            "text": "I live in SWFL where our afternoon thunderstorms are like mini hurricanes. The first time I used this umbrella, the torrential rain and wind broke it. It's just to flimsy for our weather. You are better off buying a nice, sturdy umbrella at Wal-Mart for $12!",
            "title": "Broke the first time I used it!",
            "userName": "Meagan A Rubio"
        },
        {
            "date": "February 26, 2013",
            "rating": "1.0",
            "text": "This is, hands down, the flimsiest umbrella that I've ever seen. It turns inside out at the slightest wind and fell apart after a few uses. Not recommended.",
            "title": "You get what you pay for",
            "userName": "Marc"
        },
        {
            "date": "July 8, 2011",
            "rating": "4.0",
            "text": "perfect for my bag i carry around everyday - it's lightest & smallest i could find - adequate for unexpected rain. Price also great so no worries if I lose it as tends to happen.",
            "title": "light weight is key",
            "userName": "Curt R. Clausen"
        },
        {
            "date": "October 4, 2013",
            "rating": "2.0",
            "text": "It did that cartoon thing where it turns inside out! It was just bad! It scratched my face in the process too! I don't recommend!",
            "title": "Broke second use",
            "userName": "Quentina Dunbar"
        },
        {
            "date": "September 9, 2013",
            "rating": "5.0",
            "text": "What can i say it kept me dry and it didn't break which was great it rains like crazy in the Philippines",
            "title": "umbrella",
            "userName": "monique wayne"
        },
        {
            "date": "June 14, 2013",
            "rating": "1.0",
            "text": "Don't waste your money here. I bought it in the hopes of staying dry while raining, because its an umbrella, but it broke during its first use. Lame!!",
            "title": "What a Joke",
            "userName": "brandon Hiranaka"
        },
        {
            "date": "June 1, 2013",
            "rating": "5.0",
            "text": "For the price, these can't be beat. We threw them in our back-packs for a few weeks in Italy, used them quite a bit and never had the slightest problem with them. Also very small and lightweight. Perfect for when you need to travel light.",
            "title": "Perfect",
            "userName": "Elliot Wortman"
        },
        {
            "date": "April 26, 2013",
            "rating": "2.0",
            "text": "poor quality not at all what I was expecting, very disappointed it broke the first time I used it. Not sure what it would be good for.",
            "title": "Skip this",
            "userName": "Ms. Shawn Smith"
        },
        {
            "date": "December 17, 2012",
            "rating": "5.0",
            "text": "My husband and I were golfing and it started pooring. The umbrella was very useful for keeping me dry. LOL",
            "title": "very useful",
            "userName": "Alana"
        },
        {
            "date": "October 2, 2012",
            "rating": "4.0",
            "text": "This umbrella opened \"inside out\" the second time I used it. There was some wind, but this was the only umbrella that failed in a group of 35 people.",
            "title": "Lousy",
            "userName": "Joseph A. Mancini"
        },
        {
            "date": "January 23, 2012",
            "rating": "2.0",
            "text": "The bottom fell off the second the wind started. It still technically works, but the fact that the bottom can come off is a terrible feature.",
            "title": "It broke on use one.",
            "userName": "Grace"
        },
        {
            "date": "April 28, 2014",
            "rating": "1.0",
            "text": "I just bought this for my boyfriend for when he walks to work and immediately upon opening the umbrella it broke. I am very disappointed in this product. I guess you get what you paid for.",
            "title": "Worst product bought off Amazon",
            "userName": "Lisa"
        },
        {
            "date": "April 17, 2014",
            "rating": "1.0",
            "text": "Price = quality\nIt's one of the cheapest umbrellas on the market. Unfortunately, it's cheap in terms of price and quality. It broke on the 4th use.",
            "title": "You're better off paying a little more for quality",
            "userName": "Andrew Screen"
        },
        {
            "date": "November 25, 2013",
            "rating": "5.0",
            "text": "Bought these for my kids to keep in their backpacks. Good value for the price. I would buy these again.",
            "title": "Good deal",
            "userName": "tmorgan0630"
        },
        {
            "date": "October 7, 2013",
            "rating": "2.0",
            "text": "This item is of poor quality and construction and is not fit for use. It is not worth the amount paid.",
            "title": "Por Quality--Don't Waste your Time",
            "userName": "Petra D. Seawell"
        },
        {
            "date": "July 25, 2013",
            "rating": "1.0",
            "text": "This umbrella was ruined within one week. It's a good price - but you would be better off paying a little more to get longer use out of an umbrella",
            "title": "Fell apart so quickly",
            "userName": "Emily McGrane"
        },
        {
            "date": "December 1, 2012",
            "rating": "4.0",
            "text": "I selected this item on the basis of price. It was an okay product and works fine. But it is not the highest quality but it was not priced as a top qualitty item.",
            "title": "Fair price",
            "userName": "W. L. Offutt \"thumbs up\""
        },
        {
            "date": "June 20, 2012",
            "rating": "1.0",
            "text": "This product broke before its second use. I was my emergency umbrella that I left in my car in case I forgot my real umbrella. I tried to return it citing the product's defective nature and they charged me a restocking fee. Ridiculous.",
            "title": "Piece of Crap",
            "userName": "Mid -20s \"HC\""
        },
        {
            "date": "September 20, 2011",
            "rating": "5.0",
            "text": "I saw people standing in the rain waiting for a bus. I ordered umbrellas to give to a person that I saw walking in the rain. After I got them, I have yet to hand one of them out. I carry them in my truck but have yet to see someone in the rain without an umbrella.",
            "title": "Magic umbrellas",
            "userName": "K. Tutor \"techno geek\""
        },
        {
            "date": "July 22, 2011",
            "rating": "4.0",
            "text": "I like the umbrella. It is a gift for graduation. But I am concerned that it was made overseas and I am looking for products that are US made.",
            "title": "I like it",
            "userName": "Michael A. Hanson"
        }
    ]
}