{
    "Count": "20",
    "Last Update": "2014-05-07 00:58:37.105853",
    "Product Name": "ShedRain Umbrellas Luggage Manual Compact, Navy, One size",
    "Reviews": [
        {
            "date": "April 21, 2013",
            "rating": "4.0",
            "text": "I needed a small, compact umbrella that didn't take up lots of space in my bag. This fit the bill. I had heard of Shedrain brand for years and was happy to find they were still in production. I don't think it would hold up in a tornado but for the daily showers we get in Seattle, this fits the bill...:))",
            "title": "Perfect size for a mini umbrella..",
            "userName": "B. S. Demuth \"Shirley\""
        },
        {
            "date": "November 19, 2013",
            "rating": "5.0",
            "text": "Loving it so far, gifted this to my Dad in India - where we have a monsoon season where rain and wind are almost a daily affair. My dad is very happy with this and used this on a daily basis, it never flips open, easy to close and open",
            "title": "Loving it so far, never seen it flipping it open",
            "userName": "XNOR"
        },
        {
            "date": "January 29, 2014",
            "rating": "1.0",
            "text": "The reviews below cannot be from real customers. This umbrella broke within ONE light use--the pin on the metal support fell out. You get what you pay for guys, super flimsy and should not leave a child's play room. Luckily Amazon's return policy is excellent.\n\nStaying away from ShedRain, no matter what the price.",
            "title": "For the love of... just don't buy this",
            "userName": "Mike"
        },
        {
            "date": "February 7, 2014",
            "rating": "5.0",
            "text": "fits in backpack well and does not get in the way. easy to open and close and dries very quickly.",
            "title": "compact",
            "userName": "Todd F. Fogleman"
        },
        {
            "date": "January 10, 2014",
            "rating": "1.0",
            "text": "It flips inside out. Very weak. I ordered it because of price + color, and I like that it's light weight. However, last week when it rained a lot... the umbrella flips continuously and I got frustrated. You souldn't have a problem if it's a mild raining day with no wind. It will also be fine if you can always walk in the opposite direction from blowing wind. I'm just keeping it because I already used it.",
            "title": "It flips....",
            "userName": "Jeanne"
        },
        {
            "date": "April 29, 2014",
            "rating": "3.0",
            "text": "I wanted a cheap, small umbrella that could fit in my purse and this one does the job ok, but it's almost a bit too small. Things to note are that the umbrella doesn't expand too much. It can only fit one person so if you ever need to share umbrellas or you are carrying a big backpack this will only keep your head dry. Size is not a big issue. The one thing that bothered me was that the handle was super small. I am a pretty tiny lady with small hands but the handle was too small even for me. It's about 2 long so I could only wrap about 3 fingers around it. When I use this I mainly just hold onto the stalk because the handle is just so uncomfortable.\n\nI couldn't recommend this umbrella unless you are super cheap like me and almost any small umbrella would do.",
            "title": "Does its job, but not ergonomic.",
            "userName": "Cheerytomato"
        },
        {
            "date": "April 24, 2014",
            "rating": "3.0",
            "text": "I thought this would be sturdier but it bent the first time I used it in a fairly light rain fall. The size is good, but I've definitely seen sturdier.",
            "title": "Kind of Flimsy",
            "userName": "Ricki Moodie"
        },
        {
            "date": "April 19, 2014",
            "rating": "5.0",
            "text": "This is a sturdy little umbrella, compared to many which fold up to the small ( 9 ) size. I bought mine in navy, and I'm very pleased with it. Good quality at a fair price.",
            "title": "Nice quality at a reasonable price.  .",
            "userName": "Marian Cunningham"
        },
        {
            "date": "April 7, 2014",
            "rating": "5.0",
            "text": "It's hard to find a manual umbrella and this one works well. I've used it several times and it stood up to a very windy day.",
            "title": "Great umbrella",
            "userName": "Kathleen M."
        },
        {
            "date": "March 31, 2014",
            "rating": "3.0",
            "text": "This umbrella was a terrific price, the reviews were okay and I was planning to use it for a simple trip. It just arrived in the mail and it looks fine so I happily opened it up BUT now I had a problem. It was very difficult to close. I did not see any other review that said this, but honestly I would not want to try closing this umbrella with wet hands or while I was opening a door or in any situation other than in my living room with lots of time and space. It closes in a strange way with very small release buttons. I am returning it and will now happily pay a few more dollars for a different umbrella.",
            "title": "Difficult to close",
            "userName": "Sharon Younger"
        },
        {
            "date": "March 16, 2014",
            "rating": "4.0",
            "text": "Exactly like the pictures I LOVE IT , so beautiful, perfect ( lo recomiendo exactamente como las fotos, me encanta)",
            "title": "Perfect",
            "userName": "Ana K."
        },
        {
            "date": "March 16, 2014",
            "rating": "4.0",
            "text": "Very compact, fits right into a briefcase or raincoat pocket. It probably isn't of superlative quality, but it is quite decent.",
            "title": "Good Travel Umbrella",
            "userName": "E. Smith"
        },
        {
            "date": "February 23, 2014",
            "rating": "5.0",
            "text": "used these for decorating a baby shower & then gave them out as gifts.\nVery nice quality at a great price",
            "title": "very nice",
            "userName": "Mary Moon"
        },
        {
            "date": "February 10, 2014",
            "rating": "5.0",
            "text": "Purchased for my wife for a quick grab umbrella for her new van and she said it was absolutely perfect!",
            "title": "Perfect \"map pocket\" umbrella",
            "userName": "Kenneth D. Seal"
        },
        {
            "date": "January 25, 2014",
            "rating": "4.0",
            "text": "The umbrella itself is pretty flimsy as some reviewers have noted. For the price you can't complain. It's reasonably compact, and I'm somehow hoping that if it breaks the lifetime warranty will come in handy, as other reviewers have noted. Let's see.",
            "title": "Counting on the lifetime warranty",
            "userName": "Greyman"
        },
        {
            "date": "January 19, 2014",
            "rating": "5.0",
            "text": "I ordered a different color for each of my staff for Christmas. They loved them. I needed a gift that would be the same for evrryone, was not too personal and was reasonably priced. The Shedrain was perfect because they all have quite a walk from the parking garage to our office and they have all complained that regular umbrellas cannot take wind on that walk. Choosing a color for each employee made the gift more special",
            "title": "Perfect gift for my staff!",
            "userName": "MargueriteC. Genesio"
        },
        {
            "date": "January 11, 2014",
            "rating": "4.0",
            "text": "I haven't used this yet, but it is as described - compact. Fits in the bottom compartment of my backpack, and matches the trim color. An added bonus!",
            "title": "Just the right size",
            "userName": "N. Stephan"
        },
        {
            "date": "January 9, 2014",
            "rating": "5.0",
            "text": "so far so good, nice quality , easy to use, perfect size (fits in purse) haven't had a problem with it",
            "title": "quality",
            "userName": "Joanna Diego"
        },
        {
            "date": "January 5, 2014",
            "rating": "5.0",
            "text": "wasn't so sure when I ordered it cuz it's made in China but once I received it and opened it up, really nice made",
            "title": "solid quality",
            "userName": "L. Chen"
        },
        {
            "date": "December 25, 2013",
            "rating": "1.0",
            "text": "This umbrella has all sharp metal hardwear and it broke my skin just opening it. Especially dont get for your kids.",
            "title": "Never",
            "userName": "S. Kass"
        }
    ]
}