{
    "Count": "65",
    "Last Update": "2014-03-10 20:10:44.788430",
    "Product Name": "Photive BTH3 Bluetooth 4.0 Headphones with Built-in Mic and 12 Hour Battery. Includes Hard Travel Case. 2014 New Release",
    "Reviews": [
        {
            "date": "January 17, 2014",
            "rating": "5.0",
            "text": "This is an impressive combination of features. I've get the same results, with better noise cancellation, with my Bose QuietComfort 3 headphones. However, they cost five times as much and are not quite as comfortable. My Yamaha PRO 300 headphones have perhaps slightly better sound but are a lot heavier and cost three times as much. On top of all that, neither offers the convenience of Bluetooth. For the price, these headphones are remarkable performers.\n\nThe base response is rich, resonate, and clear. This as opposed to indistinguishable \"thumps\" you hear on many headphones selling for less than $100. The rest of the range is both airy and articulate. Instrument sounds are clear and open; voices are easily understood and accurate. I can, for example, make out a surprising number of individual audience \"contributions\" in the background in a live performance recording of Hotel California (one of my (mission) bell weather tracks).\n\nPairing was quick and easy. The microphone works very well for making phone calls or over video chat. When connected to an iDevice you get an on-screen battery level indicator. The headset also works well with Siri although you need to use a button on the device to activate her.\n\nI like the supplied audio cable, since not every audio source has Bluetooth. Missing was a 1/4\" converter and if you need one then you probably have several already. To round out the \"extras\" is a USB charging cable (who doesn't need even more of those?), a hard sided case that will do a nice job of protecting the \"cans\" when you're not using them, and a small instruction manual that refreshingly well written and clearly illustrated. All of that comes in a nicely printed and constructed box which, combined with all the other great features, means you can give this as a gift and feel real good about it.\n\nThe manufacturer provided the headphones so I could provide you with an honest review.",
            "title": "A nice set of Bluetooth headphones that are comfortable, have great sound and nice accessories!",
            "userName": "jjceo (jjceo@comcast . net)"
        },
        {
            "date": "February 7, 2014",
            "rating": "5.0",
            "text": "If you're looking for a highly decent set of BT cans, you may find these pleasantly surprising. Here's my review in a few important points:\n\nPros:\n-Very loud\n-Pretty decent sound balance. Lows come off a little muddy, but highs are nice and clear. Obviously you're not getting $300 wired headphones quality here, but chances are, if you're considering bluetooth headphones, you're not a super picky audiophile.\n-INCREDIBLE range. I took these guys maybe 40 feet away through 3 rooms, several sets of doors, and they didn't skip a beat.\n-Battery life so far is very strong. Haven't tested long enough to know for sure.\n-Included carrying case, micro-USB cable, male-male headphone jack for wired connection\n-Pretty impressive build quality. Not a ton of metal, but it's all constructed out of a very nice rubbery matte black plastic. Doesn't squeeze too tight, nor too loose. Nice fit.\n-On earphone controls for play/pause, skip forward/backward, volume\n\nCons:\n-Not isolated very well. Lots of leaking sound. Not ideal if you're trying to blast some music in the office, people will likely hear you.\n-In the summer months they might make your ears hot. But.. so will any other pair of over-the-ear headphones. For the winter, consider them great earmuffs.\n\nI picked these up on a sale for 50 bucks, and I don't regret that purchase at all. Most headphones in this price range are crappy plastic chinese made, poor sound quality. Not these guys. Long term durability is still to be determined, but as of now, I'd definitely consider these. I was choosing between these and the MEElectronics Air Fi headphones, which are very highly rated. But those were more expensive and looked more poorly made. But I don't think you can go wrong with either.\n\nThumbs up if this helped!",
            "title": "Wow! So worth it!",
            "userName": "C. Goetz"
        },
        {
            "date": "February 8, 2014",
            "rating": "5.0",
            "text": "Ok I'm not the technical type. Yep , it's true. I'm just a normal person with a hearing problem. I have found that wireless headsets on the TV to be a huge help for me to be able to hear all the worlds in a show where most people mumble then the music comes crashing down. Several people in the family have bought wireless headsets for their music and phone but all have been in ear types ... which just don't work for me. When I saw these on a deal with all the great reviews, I had to jump on them. They arrived in one day..at 8am on a Saturday. I got them charged up and pair to my Iphone. The first thing I noticed is the sound. As people have mentioned before, the sound is clear and crisp. I spent most of the day listening to music. I so appreciate that I can hear well.. with better sound than I've had with earphones costing 3 times as much. They fit better than one set of Bose I have. Best of all I have an over the ear headset that is cordless AND sounds fabulous. No heavy bass tones to thump me out. A perfect sound and I found myself able to turn DOWN the volume for once because I could hear so well. The only drawback I have found is when talking on the phone , the other party hears an echo. One explanation is the mic is so sensitive, it picks it up from the inner speaker but I have no idea how to fix that . I didn't buy them to talk on the phone so not giving them up because of it.. they are my new 'favorite thing. They do fit snug.. and as a person with a pretty small head that is a surprise. For once, I don't have them slipping off my head because they are too big. I wouldn't hesitate to buy them as a gift for anyone.",
            "title": "Non engineer review",
            "userName": "Nev R Dun"
        },
        {
            "date": "February 8, 2014",
            "rating": "5.0",
            "text": "I brought these headphones after extensive research on Bluetooth headphones, already had three other sets that were okay but not great. Look at Bose and beats but both were too expensive found photive on amazon web site reviewed both reviews and video and ordered felt to be a good price at 69.95,received headphones on 2/4 charged them ,paired easily and they work as advertised the sound is crisp, bass is not overly embellished .I like vocals ,jazz and classical music and these headphones are awesome. Would purchase again in a heartbeat, shoulda also add that volume control is discreet from forward and back track control which I really was looking for",
            "title": "bluetooth headphones",
            "userName": "lu"
        },
        {
            "date": "February 6, 2014",
            "rating": "5.0",
            "text": "The first thing you will note about these headphones is the great sound, no doubt. High notes, low notes and everything in between is clear and crisp with pro sound.\n\nBut for me, what stands out is what is not there...the wires. Hit your bluetooth button on your phone or mp3 settings and it will automatically sync to these earphones so that you get your tunes, without being tethered to any device. They are wireless. I left my iPod in a locker in the gym and still got my tunes! That means you can sync in and then put on these headphones and wirelessly do yard work, cooking, working out, dance around the house while you clean to burn some extra calories, you can even go biking with your mp3 player in a backpack and not have to worry about the wires...I love it personally because when I run on the treadmill I don't need to be tethered to the iPod that sits on the treadmill then falls off or has to be attached to an armband.\n\nBut it gets better--I can wear it while working and with this one, if a call comes in, I just push a button and take the call. It also acts as my phone.\n\nIt blocks out background noise and makes my music clear.\n\nAND it has 15 hours of playtime. Rock the tunes,\n\nWirelessly.\n\nThese make a great gift--It's only recently that I discovered wireless headphones and just love them. It seems old school to go back to being connected after trying it out going free, and getting sound just as clear as if you were wired up.\n\nHeadphones provided by Photive. Review is my honest and unbiased opinion.",
            "title": "Ultimate headphones...no wires to tether you. Great for the gym or home treadmill or yard work",
            "userName": "Chandler"
        },
        {
            "date": "February 15, 2014",
            "rating": "2.0",
            "text": "I can only assume that the previous reviews, most of which appear to have been provided a unit for review, were performed without anyone else around. First, the good. Nice case, solid design, and they look very professional. They pair quickly and I was up and running with them in no time at all. In fact, everything was great until I decided to use them in bed to watch a movie. My wife nudged me in the ribs and asked why I bothered having the headphones on at all. The sound leakage is unbelievable and by far worse than any other headphones I've ever tried. Seriously, it's like having two small speakers strapped to your head. She was watching the Olympics on her iPad so we paired the second pair we'd purchased for her, and similar to the first set, I could actually hear everything the commentator was saying. It's such a shame, these are really well produced, but they're let down by this very fundamental engineering issue. Both are packed up and ready to go back to Amazon.",
            "title": "Almost ... but some fundamental flaws",
            "userName": "Andrew J. Cowell"
        },
        {
            "date": "February 10, 2014",
            "rating": "5.0",
            "text": "I have never heard about Photive and BTH3 is a new product. There was 20 reviews - all positive, so decided to try.\nSturdy, expensive look, well finished, great fit, considerably light, well balanced weight, internal usb rechargeable battery much better than AAA. Bluetooh easy to connect, easy to use controllers. Mic works great. Sound quality comparable to 2x 3x more expensive Bose, Sony or Beats.\nHandy hard case and two cables (jack and micro usb) just a cherry on the top of the pie. Seriously nothing to complain about.\nCase is fairly large but thin (good for backpack, or briefcase). I saw there was bit more expensive more compact version which folds (X-Bass PH-BTX6), but this one was good enough for me.\n2 days after Ive got it, Ive received a call from Photive employee to check what I do/dont like as this is their new product. First thing I did I checked what else I could buy from them :)",
            "title": "I was blown out by the quality for the price",
            "userName": "Michal M"
        },
        {
            "date": "March 3, 2014",
            "rating": "5.0",
            "text": "(review is being written by the person who received the headphones as a gift from me)\n\nI had been wanting some bluetooth headphones for quite some time and I had looked at everything from the horrendously overpriced wireless beats to the expensive bose ae2w, and pretty much everything down to the $30 mark. Being dissatisfied with pretty much everything except for the ae2w's but I still couldnt take the price of those being the poor college student that I am.\n\nLo and behold on Valentines Day my girlfriend gives me a box and inside it are these Photive brand headphones. I was a bit skeptical since they were from a brand I had never heard of as well as the fact they were so cheap, but nonetheless I put them on and connected my phone to them (Motorola Moto X) right away. Pairing was a breeze, there were no troubles there. and what came through those speakers next literally blew my mind. I started listening to some of my favorite electronic music and WHAM the bass would kick in and these headphones sounded almost as good as the ae2w's except without the massive price tag. I continued to listen to all the types of music that I do like to listen to and these headphones perform well in everything, never was I disappointed in the sound quality that they delivered.\n\nOn the comfort side these headphones are a heck of a lot more comfortable than my Sony MDR-V55's which were way too tight on my head and they were on the ear rather than over the ear like these are. I'm a programmer so I tend to wear my headphones for hours on end from time to time, and the V55's always had to be taken off about every hour due to the fact that my ears were starting to hurt from wearing them. I have yet to have such a problem with these headphones, I can just wear them for as long as I please and never have any problems with them. The battery on these headphones is pretty much as advertised, I didn't have to recharge them after my first full charging of them for about 2 weeks, which is pretty crazy considering how much I use them.\n\nAll in all, I can't speak highly enough of these headphones, as they have completely blown me away for the price that they are being offered at. They have great sound, a great battery life as well as a comfortable headset. Highly recommended!",
            "title": "Great Headphones for an even Greater Price!",
            "userName": "Erin"
        },
        {
            "date": "March 4, 2014",
            "rating": "5.0",
            "text": "These are my first pair of bluetooth headphones, so I don't have a lot of experience in this area but I have owned my share of normal headphones. The packaging this product came in is really nice, definitely has a higher end feel from the moment you open them up. They come with a nice carrying case, charger, and an aux cable to use with the headphones when not using bluetooth or if the battery dies. Figuring out how to set them up (pairing with your phone, etc.) was extremely easy. I will admit, I didn't read through the instructions even until I had paired them and was listening to them using my android phone. I have a moto x android phone and all of the functions work perfectly with these headphones.\n\nMoving on to the sound and comfort of these headphones. These headphones fit completely over my ears, and in my opinion are very comfortable for this reason. I have had other over the ear headphones which still rested on your ear and after a while they really feel uncomfortable no matter how comfortable they may start out. These are very easy to leave on for hours at a time for me since they fit completely over my ears. As for the sound, I honestly think they sound great. I have listened to music ranging from rap, dub step, rock, and even country on them all of which sound great. I honestly don't have a single complaint for this product. Unfortunately I haven't allowed the battery to run all of the way down from a charge so I am not sure about the battery life but I have used them for roughly five or six hours without charging them with zero issue.",
            "title": "I love these headphones...",
            "userName": "Nate"
        },
        {
            "date": "February 20, 2014",
            "rating": "5.0",
            "text": "I am not an audiophile so I cannot say I'm an expert in sounds, but I do own an audio technica ATH M50 and a SOUL by Ludacris SL300 so I do have different sounds to compare with.\n\nFirst of all, these are not $200-$300 so do not expect a DJ headphone because that's not what you are paying for. I was very skeptical at first to get these because these are not some famous brand headphones like audio technica or bose, etc. plus they are basically new (2014 release) so I expected them to be flawed like most items that come out when they start, but I was very surprised with these.\n\nPros:\n\nVery nice sound:\nI was specially worried about this at first because I didn't know what I was getting into. I started trying everything without bluetooth, just the wires, while the bluetooth charged. I first tried with some rock to see if they delivered and they weren't too bassy and I was pleased to hear the sound they produced. The bass was not loud enough to disturb you and not low enough not to appreciate it. The voice was clear and pleasant and I could hear all the instruments with clarity. Then I started to get worried that they wouldn't sound good with more bass demanding genres so I switched later to trance and I was surprise to feel the bass of the song actually pleasantly vibrating in my ears. Basically every song I threw to it delivered so these are easily becoming my favourite headphones so far (I did watch movies and series with it too and they still deliver).\n\nIntegrated microphone:\nSpecially useful when you're listening to music with your cellphone. Just a click away to answer a call.\n\nEase of connection:\nMy mac, my ipad, my note 3 and other gadgets from my friends, all had no issues with connectivity. They pair fast and easily. Haven't had any interference so far with other devices.\n\nBattery life:\nLife is good as promised. Although I usually use wires when I'm using it with my gadgets, I do use bluetooth when I don't want to have the gadget close to me.\n\nCase:\nIt comes with a neat case where you can store your cables and the headphones. Very easy to carry around in my backpack.\n\nCons:\n\nConstruction:\nThey are plastic and seems durable but I do not dare to twist them much. They do take some time if in but you get use to it real quick. I have a big head and they fits well so make no mistake, this works well for big heads. The color is neutral black so do not expect a wow design either but the inside led is nice to check the battery + pairing and all that and they look nice enough.\n\nIn overall an excellent pair to get for a very good price. You won't get better sound for this price range (or even a bit higher) plus all the features that comes with this.",
            "title": "Excellent sound quality (with and without wires) for a low price",
            "userName": "Felix Elias \"- Felix Elias\""
        },
        {
            "date": "February 17, 2014",
            "rating": "4.0",
            "text": "I've been using these headphones a week and they're really great. I've been using them for my iPhone 4 and it pairs with these headphones no problem. As everyone says, you get to see the battery notification on your iPhone when paired. The sound quality is extremely good especially when I purchased these during Amazon Deals. Got them for $44.95.\n\nYes the box does smell when you get it. It'll go away through time but as of right now I'll deal with it.\n\nThey're extremely comfortable and I have no problem wearing them for countless amount of hours. They do isolate sound pretty well.. but when they get extremely loud .. then the sounds will obviously leak. The headphone sounds is different from the device's sound. I can still hear my phone's music when I my phone volume to 0% and headphones volume to 90% which is great for sound boosting. However on Windows and Mac it's tied to the operating system's sound using bluetooth.\n\nMy issue with these headphones is that I want to contact people wirelessly on my laptop on Skype and such.. there's an issue. When I paired these headphones to my Lenovo Y500 which has Bluetooth 4.0 support.. there's 2 options for listening to audio. One of them is called Hands Free Headphones which gives off a monotone like sound and or on YouTube terms 144P/240P audio sound quality. The other option is Stereo which is quite obvious to give the true quality.\n\nWhen you pick the Hands Free option, and try to use the microphone on your computer, they will perfectly fine but the sound quality for the listener is really awful.\n\nWhen you pick Stereo option and try to use the microphone, the microphone volume will screech or will not work at all, including when you set the microphone volume to 0%. It will still screech. I tried this with my friend's laptop and mine. Same result. Using the 3.5mm audio jacks with my headphones and laptop works perfectly fine.. but wireless.. nope.\n\nI listen to classical, heavy rock, and techno and get the sound quality is superb overall on mobile devices and wired on a desktop or laptop. My laptop has Windows 8 x64.\n\nIf these headphones have better Windows / Mac support then I will bump my grade to a 5star.\n\nI highly recommend these headphones to anyone. Give these headphones a solid 4.",
            "title": "Great headphones but lack computer support.",
            "userName": "Anthony"
        },
        {
            "date": "February 14, 2014",
            "rating": "5.0",
            "text": "At first i just wanted these so I could listen to the music apps on my phone without taking the waterproof case off. Then I realized there are a bunch of ways these would come in handy. I just got them, but so far I've listened to music on my phone, worked out with them on, and plugged them into my 3ds. The sound quality is good for the price. They are very comfortable, but I do have a smaller head so they might not fit some people as well. They block a good amount of noise. I haven't had any problems connecting them to my phone. For the price I think they are fantastic. They do smell like sneakers when you first open them but after about three days its gone. I would pay the sixty for them if I had not already bought them for fifty.",
            "title": "Paid 49.95",
            "userName": "M.Bobavich"
        },
        {
            "date": "February 14, 2014",
            "rating": "5.0",
            "text": "I was one of the first to get these and I think they are great for the price. Strong, long distant blue tooth power and very clear sounding I would recommend to a friend.",
            "title": "Go Wireless",
            "userName": "Dabbler2.o"
        },
        {
            "date": "February 11, 2014",
            "rating": "4.0",
            "text": "My head is fairly big, so the band just barely expands enough, but it's still a little tighter than I'd like. The earcups also don't surround my ears as well as I'd like.\n\nThe sound quality is excellent when paired with my Nexus 5 over Bluetooth or using the 3.5mm audio cable with my 3DS.",
            "title": "Great, high-quality headphones, but a little tight on large heads and ears",
            "userName": "Jonathan E. Dierksen"
        },
        {
            "date": "February 11, 2014",
            "rating": "5.0",
            "text": "Great bluetooth headset with mic.\nPairs easily & quickly with iPhone.\nShows the battery status on iPhone.\nLong battery life.\nExcellent audio quality.\nIncludes auxiliary cable (for non bluetooth devices), USB charging cable & travel case.\nConvenient buttons (Play/Pause, Next, Previous, Vol up/down)\nReasonably priced.",
            "title": "Great bluetooth headset with mic.",
            "userName": "Anonymous"
        },
        {
            "date": "March 10, 2014",
            "rating": "2.0",
            "text": "Pro:\n- Good connection to my phone.\n- Headphones feel really snug on your head\n- Sound quality is pretty average but more than I need / your average listener needs.\n\nCon:\n- Company has no website - [...] - Try it, there's nothing there. I've sent their support two emails with no response. All I wanted to know is what driver should be used to access them with Windows. If you try to search for their office on Google, it doesn't exist (At least on Maps).\n- Doesn't not connect to my Windows 7 Enterprise laptop - I'm assuming the driver is the issue but without a support page, download, or some information from the company it won't work.\n\nTLDR: If you want to sync these headphones with your phone, they're good quality and seem to work. But be aware, if there's a problem, don't expect support or anything from Photive. Thankfully Amazon is helpful as they're fulfilling the orders.",
            "title": "Does this company even exist?  Can someone find a website?  Their domain is listed for sale....",
            "userName": "Greg B."
        },
        {
            "date": "March 10, 2014",
            "rating": "5.0",
            "text": "Great set of headphones for the price. Will do everything you need them for. Very satisfied, I would recommend them to anyone looking for wireless headphones",
            "title": "Great value",
            "userName": "Aaron marmon"
        },
        {
            "date": "March 10, 2014",
            "rating": "5.0",
            "text": "I chose this device for the convenience of it. NO WIRES! The battery life was very attractive also. My hearing is pretty poor. The sound quality as far as I can tell is excellent. Its an amazing device. It was very easy to set up and very easy to use. The instructions were pretty good but they could use a bit more info. The phones have been a delight to use! Haven't had any issues at all with the device. It works very well with other Bluetooth enabled devices! Great product!",
            "title": "Bluetooth head phones open up new avenues of convenience!  Powerful sound and excellent volume range!",
            "userName": "david kuhn"
        },
        {
            "date": "March 10, 2014",
            "rating": "4.0",
            "text": "They are good headphone, there are not very noise canceling however my wife uses hem on the tread mill and she likes them.",
            "title": "Nice",
            "userName": "Keith Lee \"Keith\""
        },
        {
            "date": "March 9, 2014",
            "rating": "5.0",
            "text": "Very comfortable and sound terrific to me . Really noticeable stereo sound. Got mine early for $40 told my dad to get a set and noticed they are $60 now think there worth it.",
            "title": "Love them",
            "userName": "Eric Gipson"
        },
        {
            "date": "March 8, 2014",
            "rating": "5.0",
            "text": "For $50 bucks, this headphone is a bargain! Loved it! If you don't wanna invest much but looking for a good sounding and well built wireless phones, this is it!",
            "title": "What a bargain!",
            "userName": "Junevreyes \"Jun\""
        },
        {
            "date": "March 8, 2014",
            "rating": "4.0",
            "text": "I like the audio quality on the product and its battery life is superb! I had issues with the first item that I got (details below), and got a replacement, so make sure to check for lemons!\n\nBuild quality:\n\nOn the first pair that I got, I had problems charging it after trying it out for a couple of days. One side of its USB connector is pushed quite a bit further inside the device that the USB cable couldn't be plugged in properly to charge it. Also, the USB connector felt loose that it wiggles as I plug in the cable. My theory is that the pads weren't soldered properly or came loose when the circuit board is assembled into the headphone.\n\nI got the replacement within a week and checked its USB port, and like the previous one, one side of the USB port is pushed a bit further inside, but it charges and the port doesn't feel loose. So, I think there are some issues with the assembly that needs to be addressed.\n\nThe rest of the headphone is built quite well. Majority of it is plastic, but I think the inner core of the headband is made of metal which is great. You will see the metal when you extend the earpads.\n\nAudio quality:\n\nThe overall audio quality is good, although this may depend on what your listening preference is. Bass is acceptable, but not great. The headphones shine in mid to high tones, so it's a delight to listen to instrumental or classical music.\n\nBattery life:\n\nBattery life is excellent. I charged the device overnight the first time, and it took FIVE days of normal usage before it was drained empty. THAT IS GREAT! By normal usage, I'm using it at work for ~5 hours everyday, and an hour or two at home for a couple of days. I kept the volume at low to medium, just at a comfortable level for listening.\n\nOverall Value:\n\nIn terms of overall value, this product is great. For it's price, you get excellent battery life (which is an important thing for wireless headphones), good quality audio, and a carrying bag with cables.\n\nWhen you receive the item, make sure you check the USB port to make sure it's properly assembled/not loose and that you can charge it properly..",
            "title": "Great product for the price. Make sure to check the usb port for issues!",
            "userName": "Ed"
        },
        {
            "date": "March 6, 2014",
            "rating": "4.0",
            "text": "This is my first pair of bluetooth headphones, great price. I have traveled with them and they are super comfortable, soft pads. I still use the wired connection as the sound quality is better over bluetooth. Mic works but if volume is up, the other line reports echo. Range is good. I am happy with my purchase.\n\nAlso the customer service was great.",
            "title": "great deal - all dayy",
            "userName": "Ryan Abboud"
        },
        {
            "date": "March 6, 2014",
            "rating": "5.0",
            "text": "These headphones work great. I have a iphone 4s and had them paired in about 30 seconds. Good battery life and clear sound. Now I can download my programs and listen to them while working in the yard or mowing the grass. Music sounds good also. Nice case for storage. Headphones are comfortable and will adjust to fit any head. Worth the money. The only bad part is waiting on them to arrive.",
            "title": "Great Headphones",
            "userName": "Rick"
        },
        {
            "date": "March 6, 2014",
            "rating": "5.0",
            "text": "Amazing sound. Not too much bass as some have reported but it reproduces sound with clarity. Very comfortable as well! The company had oversold the product so I chose to wait.. So glad I did, as it was well worth it! In addition they send a complimentary Photive 3000 charger. Would highly recommend!",
            "title": "Great sound at incredible price",
            "userName": "Rex Dell"
        },
        {
            "date": "March 5, 2014",
            "rating": "5.0",
            "text": "Paired up to my PC No problem with my bluetooth dongle that I bought seperately. These headphones are great! I'd say the range can go even farther than advertised. Sound quality is excellent as long as you have the bluetooth dongle plugged into the back of your PC directly, or your monitor hub. Do not use your keyboard USB hub as it distorted my sound quality quite a bit. The headphone seem like they are made with quality parts and feel very solid. I love how light they feel on my head, and they charge from nothing to full very quickly. I'm super happy with this purchase and would highly recommend!",
            "title": "Exactly as expected",
            "userName": "sickleficker"
        },
        {
            "date": "March 5, 2014",
            "rating": "5.0",
            "text": "Hard to believe that these are $60. They fit different sized heads very well and look like they are well-made. Also, I've never had bluetooth headphones that connected to my devices as quickly as these. As for sound quality, I'm not really one to judge.",
            "title": "very nice!",
            "userName": "William"
        },
        {
            "date": "March 5, 2014",
            "rating": "5.0",
            "text": "I love these headphones! They are very comfortable, connect very easy and fast! The hard case is great for storage! I was surprised how easy they are to setup and start listening with! They are very loud, nice surprise with the sound! I highly recommend these headphones!",
            "title": "Best headphones I've ever owned!",
            "userName": "Shannon Houseman"
        },
        {
            "date": "March 5, 2014",
            "rating": "4.0",
            "text": "First I should say, I bought these myself, Photive didn't give me the headphones for a review. I've bought Photive products before and been incredibly satisfied with them. First of all, I want to address the smell. The day after I got these and hung them up on my headphone stand, I woke up panicked because I though someone was burning something in the microwave. It took me about 5 mins to figure out that the smell was coming from the headphones and case. It smelled like burning plastic. After testing, I put the headphones back in the case and stuffed a few odor absorbing scent sachets then put it in a drawer. Hopefully in a day or so the scent will be minimized.\n\nAs for the headphones, I've tried bass heavy hip-hop, choral music like Anuna and Karl Jenkins, orchestral music, and different types of pop. The sound is incredibly clear. The bass has just enough thump, the mids are clean and dynamic, and the treble is clear and just high enough without being tiny. Very good performance for such a budget price. Very impressed when compared to higher-end headphones I own. Try listening to a vocal song like \"Wolf and I\" by Oh Land or something by Tina Dickow or Audra Mae. The vocals are so clear and you hear all the ranges in their voice. I was able to hear and isolate every instrument in the ABBA tribute cd by The London Philharmonic Symphony and the range of instruments in that cd is fantastic. I almost always use it as a measuring stick.\n\nHaving said all that, I'll explain why 4 stars and not 5. The aesthetics and comfort of these headphones is lacking. They were design with a very odd squat shape in order to make the unfoldable headphones more compact but instead that makes the headphones protrude unsightly when worn. Also the weird shape makes adjusting the headphones, once they're on, almost impossible one handed. The adjustable portion of the band is near the outer most part of the band and so is curved inwards. The cups are nicely cushion but aren't really plush enough to create a deep cup. Part of the problem is that they are not deep enough for your ear to fit comfortably without coming into contact with the foam covering the speakers. I'm forced to squish my ear to fit it comfortably into the cup and be completely surround by the cushion. I can imagine that the small space would mean more heat and make the headphones sweaty or uncomfortable for really long trips. Oddly, the weird shape also contributes to the band sitting very tight on your head but the cups not tight enough because they are tilted slight outward when brought together. Because of this you get a lot of sound leakage. I wouldn't plan on using these outside. I'm sure they'll loosen up over time but I had a headache after listening to music for about 2 hrs.\n\nOver all I would recommend these for the price, because they do provide a nice listening experience but if you don't need the extras, like the carrying case, and care more about comfort and aesthetic I would recommend the August EP650 Bluetooth Wireless Stereo Headphones - Comfortable Leather Cushioned Headset with built-in Microphone, 3.5mm Audio In Socket and Rechargeable Battery - Compatible with Cell Phones, iPhone, iPad, Laptops, Tablets, Smartphones etc. (Red). In competing price brackets, I think I would give the August the win for quality and comfort (and they sound just as nice) but with Photive, I know the company have great customer support and a rock solid 1 year warranty.",
            "title": "The smell is unbelieveable",
            "userName": "Dee"
        },
        {
            "date": "March 5, 2014",
            "rating": "5.0",
            "text": "Very comfortable set of headphones that I use at work everyday (machine shop). Here are some pros and con's outside of the specs labeled on the box.\n\nPros:\n178ft range (that's as far as I could go)\nGood placement of controls\nLong battery life\nGood quality sound with both lows and highs\nVery comfortable fit (my 9 year old and my 350 dad can wear them)\n\nCons:\nNo button for Google now or to voice command a phone call\nThey do get a bit sweaty on the ears if your in a warm area\nThe noise the headphones make when you hit the max volume is deafening\nIf you wear glasses it puts pressure against them.\n\nI personally purchased these headphones as a \"throw away\" type because I found them on sale for $60.00...figured they would be a cheap build that would fall apart in due time. Surprisingly they are a well built and great sounding set that surpasses my expectations.",
            "title": "Great set of headphones for the price.",
            "userName": "The machinist"
        },
        {
            "date": "March 4, 2014",
            "rating": "5.0",
            "text": "All positive reviews are true. And i am one of them.. Very nice sound quality, lightweight and comfortable. I wear this everyday without tangle cord.. I love this headphone except for the strong smell but not a big deal.. Fast shipping and cheap price.. I recommend this headphone...",
            "title": "Photive BTH3",
            "userName": "Citizens Bank \"jun rosales\""
        },
        {
            "date": "March 4, 2014",
            "rating": "3.0",
            "text": "Sorry to buck the trend, but these are great headphones if you like flat sounds i.e. soft rock, classical, or other sounds w/out bass effects. I'm not one of these folk, though I do listen to this music genre. I'm a jazz, house, disco, r & b, and other musical sounds w/bass.\n\nI own a set of Klipsch Bluetooth Headphones and I enjoy the sound a lot. I wanted a second pair of headphones, more over-ear, and decided to give these a shot. I wore them for 15 minutes and couldn't take it anymore; they were not my style of sound. Nice headset with a comfortable feel. They did have a slight odor as noted by a prior reviewer, but this likely will fade quickly. Overall, these are nice, but....just not my style.\n\nAgain, if bass is not your thing, then these are AWESOME; however, if you like any bass sound in your phones, then I suggest considering something else.",
            "title": "Great for those who like flat sound",
            "userName": "Charcoalgrey"
        },
        {
            "date": "March 4, 2014",
            "rating": "5.0",
            "text": "I recently got these headphones and i am very pleased. I am a professional sound and video guy so I have high standards for sound quality. I would not use them in a studio setting but these are fantastic for personal use. I love the freedom of no wires and the controls built into the sides. They are great quality and well worth getting.",
            "title": "AWESOME",
            "userName": "stuart slates"
        },
        {
            "date": "March 3, 2014",
            "rating": "5.0",
            "text": "Great sound! Infact they are a little too loud for me. I have to play in the noisy gym down two licks from maximum output.\n\nGreat battery life! Had over 2 weeks before needed a recharge. Used 10 hours possibly.\n\nGreat case too for the gym bag...keeps them clean and safe.\n\nFit great on my head, adjustable, the buttons are decent. Foam pads are fine. Bluetooth works about 20 feet from my iphone in the gym.",
            "title": "Super buy!",
            "userName": "Kris K"
        },
        {
            "date": "March 2, 2014",
            "rating": "4.0",
            "text": "These are AWESOME Bluetooth headset. I feel like it's just me and my music. The speakers are freaking AWESOME~!\n\nThe only reason why I didn't give these 5 stars is because the shape of headset. They don't fit your head like other headsets. They look weird when they are on your head. But for the price, it was a steal.",
            "title": "I like it",
            "userName": "HUNGSTA"
        },
        {
            "date": "March 2, 2014",
            "rating": "4.0",
            "text": "These are great sounding for the price and very well made. The case is solid as well. However for me they were hot and uncomfortable. The earpieces are not big enough to cover the ear, and too big to fit nicely on the ear, so they tend to squeeze pretty firmly on the top and bottom of the ears which becomes uncomfortable quickly. But that is going to be a personal preference for each user. If they fit you well you will love them.",
            "title": "Very nice, but hot",
            "userName": "Jimbo \"Jim\""
        },
        {
            "date": "February 28, 2014",
            "rating": "5.0",
            "text": "These are excellent headphones and are really well priced. They paired easily with my i Pad and also with my LG cell phone. The sound quality seems good. My hearing isn't so great anymore so I can't really say how the fidelity is at the high and low ends, but they are certainly loud enough. The built-in mike works especially well with my cell phone. The controls on the bottom of the phones work well and are very handy.\nThey adjust nicely and are comfortable to wear.\nThe 12 hour battery life is great and the ability to use the analog cable if the battery dies or with a non-Bluetooth device is also a plus.\nThe case is nice and very sturdy. Overall a nice set of phones.",
            "title": "Great headphones",
            "userName": "MrDogDad"
        },
        {
            "date": "February 28, 2014",
            "rating": "5.0",
            "text": "I wanted to purchase a Bluetooth headphone for the longest time. What kept me from buying one sooner was the loss in sound due to the Bluetooth transfer. After looking thru EBay and Amazon and going through the reviews again and again I decided what the heck if I don't buy one now I might never will. So with that I took the plunge and bought a Photive BTH3. The time it took for the product to ship ( two days ) I kept telling myself to keep my expectations low so I will not be as bummed out if it was not as good as I expected. The moment the headphones arrived I took them out and charged them over night while the whole time fighting my urge to listen to them before a proper charge. Once they had a good night's charge I unplugged the headphones and Bluetooth connected it to my iPhone. I listen to old 80's new wave and the moment the song came on I was taken back, the sound was very good, better than what I was expecting. After that one song I put my iPhone on shuffle and repeat album and for the next hour or so I was on the headphones while doing house chores. Every song that came on was clear ( bass needs a boost ) but the mid and highs were very pleasing not muffled or overly clear where that sometimes could hurt my ears. The battery on this guy will last a while if listened on mid to low volume. I have been using these headphones for about two weeks now and the battery is sill charging strong. For someone in search of a decently priced Bluetooth headphones give these a try you will not regret the decision. For someone looking for a little more bass, search for their higher bass Bluetooth headset ( Photive X-Bass PH-BTX6 ) those will be my next purchase. I am very happy with my purchase and I will be trying other Photive products in the future.\n\nPros:\n\nvery clean sound, not muffled or overly high\ncomfortable to wear for long periods of time\nlight weight on the head\nvery professional looking\ngood battery life on low to mid volume\n\nCons:\n\nwished for just a little more bass",
            "title": "Very happy and satisfied with the purchase",
            "userName": "Danny P Chu"
        },
        {
            "date": "February 25, 2014",
            "rating": "5.0",
            "text": "At this price, these over-the-ear bluetooth headphones can't be beat!\n\nGreat sound quality, very comfortable, quickly charged (battery lasts a long time), love not having a cord!\n\nOne thing I will point out that it took me a minute to figure out how to connect them via bluetooth to my MacBook Pro (I primarily use them at work to block out noise / jam out). I figured it out pretty quickly with a Google Search (put them in connect mode - *unplugged* via USB - and use the BlueTooth Settings to connect).\n\nI would recommend!",
            "title": "Great Product",
            "userName": "Phillip"
        },
        {
            "date": "February 24, 2014",
            "rating": "5.0",
            "text": "I am a musician and I am very picky about sound quality. These headphones are awesome for the price. I listen to them hanging out at the gym and recently recorded an EP album with them. High recommend them to anyone. Oh and I use them all the time and it's been a week and I have not charged them yet.",
            "title": "Great headphones",
            "userName": "David Maginn"
        },
        {
            "date": "February 20, 2014",
            "rating": "5.0",
            "text": "Typically you don't get good quality sound at long distances, but with these headphones you will get just that. They are great for looking cool at the gym without actually doing anything, as well as for avoiding awkward conversations because you simply can't hear the crossfit junkies trying to correct your inadequate walking form, thank God.",
            "title": "Good Sound, no compromise",
            "userName": "Kevin Wilkison"
        },
        {
            "date": "February 19, 2014",
            "rating": "5.0",
            "text": "I don't ever review products, but here I go. I purchased the headphones, they came in quick because I have prime. They were fully charged, so I turned them on. They work up to 12 hours. I actually think they last around 14 hour, but I wasn't counting each and every second. They are extremely comfy, but I have never owned a pair of headphones that cost more than $20, so I am no specialist. They are big, but aren't heavy. Also, the carrying case is nice. Buy them, they are good. Now for the love of all that is out there, please stop emailing me, Amazon, about reviewing this frakking product. I am going back to sleep!",
            "title": "Comfy, wireless, and has great sound!",
            "userName": "Tyler Mcphail \"tyler\""
        },
        {
            "date": "February 18, 2014",
            "rating": "5.0",
            "text": "For the money, it is hard to beat this blue tooth headset. It paired easily and the battery life seems good, thus far. Quick shipping and a very nice storage case is included.",
            "title": "Nice Headset",
            "userName": "M L"
        },
        {
            "date": "February 18, 2014",
            "rating": "5.0",
            "text": "Disclaimer: I am not an audiophile so audio quality is not necessarily the most important thing. I can't really tell the difference really well. That said, when I got the Bose Bluetooth headphones I had to return them because for some strange reason they played music in slow-motion. So my Bose Bluetooth headphones were actually WORSE than these headphones.\n\nAside from all of that, these headphones are very comfortable, I've had a few issues with the connection to my devices but I think that's more my devices than the headphones. Pairing was very easy, I've been really impressed and pleased with the battery life as well. I'd definitely recommend these to anyone looking for a cheap, but great quality set of Bluetooth headphones, and not just earphones.",
            "title": "Really great new product, on par with Bose!",
            "userName": "Sam Dowd"
        },
        {
            "date": "February 18, 2014",
            "rating": "5.0",
            "text": "I got my first pair of these in the mail super excited. Unfortunately for me, they wouldn't turn go into pairing mode...\nI contacted Photive over the weekend and shortly after that I got a call directly from someone in the Photive office asking me about the problem. He was very up front and honest and told me they hadn't seen my particular problem before. He quickly took care of me and got a new set of headphones in the mail to replace my busted ones. So the customer service for me was unbelievable.\n\nNow the second pair however are fabulous.\nMost of the people who are writing negative reviews on this product are pretty annoying. Its a 60 dollar pair of headphones. These are not Bose, or any other crazy fancy pair of headphones. No one should be expecting perfect quality.You get what you pay for in this world. But I have to say these are much better than what I expected them to be at this price. This is the most I've ever spent on a pair of headphones and, likely I will never spend more. I am not crazy obsessed about quality, but I do appreciate good sound.\n\nFor the most part I listen to audio books and talk radio on these, but I do listen to some music, mostly country, and they are more than adequate. I'll say it again, you get what you pay for. Do not buy these expecting to hear a pair of 400 Bose sets, if you want those, buy those. But I have better stuff to buy with my money.\n\nI am a very large man with a pretty big head, and when I expand the sides they fit pretty darn well. Nice and snug like i like them. If I am listening with them all day I do however need to take a break every two hours or so to let my ears cool down.\n\nBurn smell burn smell burn smell. Yes they have a burnt plastic smell. The smell goes down every day. It doesn't bother me any more. Unless your super picky don't worry about it.\n\nThey connect to my iPhone 5 and my Macbook Pro Mid 2010 very easily. No sweat there.\n\nDo yourself a favor and ignore the people who are saying how terrible these things are. If your a sound snob don't buy them, I'm sure you can find 300 pairs on here somewhere. If you like solid stuff at a great price they are good pick.",
            "title": "Two very different experiences.",
            "userName": "Aaron J. Miller"
        },
        {
            "date": "February 17, 2014",
            "rating": "5.0",
            "text": "Let me preface this by saying that I am not at all an audiophile. This is the most I've paid for a pair of headphone in my life since I usually spend ~30 dollars, but these were on sale for 45 and I figured why not? Luckily, the investment paid off.\n\nThe first time I put them on and played my favorite song, I was surprised to hear things I'd never noticed before. The audio quality seems very good to my amateur ears. They feel very sturdy, are fairly light and fit snugly on my head (average-sized) without being too tight. I forgot that I was wearing them a couple of times while doing chores. They paired easily with all of my Bluetooth compatible devices, and it's pretty awesome that I can monitor the headphones' battery on my phone. The 3.5mm cord is also a neat feature, though I haven't used it at all yet. Can't say how they affect anything.\n\nThe cons are that they do leak sound (though I hadn't noticed until I read another review). Noise cancelling they are not, so if that's an important factor, you'll want to keep looking. The smell when they first arrive is also pretty bad, though I've had them for about a week now and it's almost completely gone. I have to put them up to my nose and take a huge whiff to get anything.\n\nI bought them with the intention of using them solely as workout headphones, but they've now been upgraded to my computer/work/household headphones. It's nice being able to walk around my apartment and listen to music without having to carry my phone with me. The sound doesn't get worse the further away I get, either. I haven't tested them on Skype/with phone calls yet, but I'll update my review whenever I get the chance to try the microphone. I grabbed another pair of cheapie bluetooth headphones for the gym and when I'm out to hopefully make these last a bit longer.",
            "title": "Exceeded my expectations",
            "userName": "J. Samuel \"Digital Artist\""
        },
        {
            "date": "February 17, 2014",
            "rating": "5.0",
            "text": "I was looking for something like this for a while , I needed something to deliver high quality sounds and same time I can talk with Bluetooth connection to my phone , so far I did not had any problem with this headphones , the battery life is great on stand by it can stays up to 2 days . great product in good price",
            "title": "Great Bluetooth Headphones",
            "userName": "danial"
        },
        {
            "date": "February 17, 2014",
            "rating": "5.0",
            "text": "I love these headphones. I bought them in hopes that I could pair them with a new tv. I don't think the tv is bluetooth capable. But they sound great with the cell phone. I love the big comfy cushioned ear muffs. The sound is great.",
            "title": "Beautiful, sleek",
            "userName": "R. Nealy \"suebaby\""
        },
        {
            "date": "February 17, 2014",
            "rating": "5.0",
            "text": "All around these phones are a great product solution for someone looking for the flexibility and freedom that bluetooth provides. They easily pair and work well with apple devices, and have a long lasting battery.",
            "title": "Great Bluetooth Headphones",
            "userName": "Keith Gutierrez"
        },
        {
            "date": "February 15, 2014",
            "rating": "5.0",
            "text": "this headphone is great for the price. actually its worth way more. the battery last so for days and I use it every day. I love the cable and I can use it with my laptop that don't have bluetooth capability. sound is great too. over all this is a great headphone and I'm not sure why they don't run ads.",
            "title": "I was surprised",
            "userName": "Dude"
        },
        {
            "date": "February 15, 2014",
            "rating": "5.0",
            "text": "The only complaint I would have is the initial smell from the pair I received. It was very off-putting and even gave me a headache the first day I used them. After three days of using them, though, the smell has greatly diminished, so I'm sure it'll be gone completely soon.\n\nSound quality on these are superb. Range is excellent. I left my iPhone on my dining room table and walked upstairs and into my bedroom and the song didn't stutter once. So glad I purchased these!",
            "title": "Greatness abounds!",
            "userName": "Sage"
        },
        {
            "date": "February 14, 2014",
            "rating": "5.0",
            "text": "This is my first pair of Bluetooth headphones. I got them to replace a corded pair of Sennheisers (HD202's I think) that were on their last legs. So far, things are going great. It took a bit of learning with the controls, and the first time pairing the device took a bit longer than normal, but now they pair right up to my iPhone. I've had a little trouble getting Siri to work through the headphone's mic, but the one phone call I've had so far has been crystal clear.\n\nOne note: a few other reviews said these were noise canceling, but they are just standard over-the-ear headphones with good cushioning for keeping out other soundsbut you can still hear things through them (as opposed to the headphones that produce negative sound to cancel out the outside noises). They are just as good as the corded Sennheisers mentioned above re: keeping out outside noise. They're just not noise-canceling-level, if that's what you're looking for.",
            "title": "First Pair of BT headphones &#8212; impressive",
            "userName": "Charlie B. \"Charlie\""
        },
        {
            "date": "February 14, 2014",
            "rating": "4.0",
            "text": "I've been using these headphones for about a week. I have pretty much been using them non stop for music and for gaming on my PS Vita.\n\nFirst off, the quality is great. Haven't had any issues whatsoever. I'm not an audiophile but these do the job more than adequately. I have used Bose QC 15 for around 3 years, and the quality from these hold up really well in comparison. These don't have built in active noise cancelling like my Bose however the passive noise cancelling due to them being over the ear is pretty fair. With my music turned up I can block most sounds for studying or whatever it is I want to do. These won't do well on an airplane, at least compared to Bose QC 15's, but they're not made to be built specifically to clear out noise on an airplane.\n\nBluetooth is bluetooth. It's great not having any wires. There seems to be no degradation in quality when compared to using the wire that comes packaged with them. In fact sometimes I feel that the quality is actually superior through bluetooth. No problems connecting to my cellphone, vita, or tablet. Fairly easy to switch between them.\n\nBattery life is pretty good, and seems about right for the said 12 hour lifespan. What's nice about these is the ability to use a cord for when the battery runs out. That's a big positive.\n\nQuality is good. They are fairly light headphones, but I can see it being a little too heavy for some users. Haven't run into any major structural problems yet, but if I do I'll post an update should I find the need to.\n\nMicrophone is pretty good, or that's what I've been told. I haven't had a chance to use these on my computer as my built in bluetooth has malfunctioned, but I'm sure they would be adequate for use with skype or any other VOIP service. They won't compare to headsets specifically for communication purposes, but again they aren't advertised or built to be as such.\n\nI'd give these five stars if it weren't for the fact that the ear cushions are of pretty low quality. I hate to do a comparison, but my Bose QC 15's had amazing ear pads, very comfortable, and they let air in. These earpads are probably the one aspect of the headphones that didn't get as much attention. They're pretty hard and after heavy continuous use (4+ hours) they start hurting. It might also be because I wear glasses but I didn't have problems with the QC 15's. I think this is the only major complaint I have about the headphones.\n\nThe other reason for not getting a 5 is the plastic, new shoe like smell. Hopefully it will go away after a while, but for now it doesn't seem like it's going away any time soon. Minor annoyance, as I don't plan on sniffing my headphones 24/7.\n\nGood headphones, minor annoyances, definitely worth your consideration.",
            "title": "Great Headphones with minor problems",
            "userName": "Orra"
        },
        {
            "date": "February 13, 2014",
            "rating": "5.0",
            "text": "I too was pretty skeptical when purchasing this item when I saw it pop up as a lightening deal. Let me just say I am glad I took the leap. For something in this price range and the fact that it communicates with your source through Bluetooth I must say that the sound presented by these headphones is great.\n\nPlease note that you are not going to get mind blowing, awesomness out of these cans. They definately do not compare to some of the costlier headphones that I own. They also don't have the warm sound that the parrot zics have ($300+). I must say though, for a sub $100 set of cans, they are pretty good.\n\nTo me, the biggest reason to buy these cans is the wireless factor. I am able to sit at my desk, slam on my keyboard, and not be hindered by the long cable connecting my headphones to my amp. And I must say, the cans are able to mainain a very good bluetooth connection to my iPad. So far I haven't had any issues with it dropping.\n\nBattery life seems really good too. So far I've been running them for serveral hours (10+) with no deteriation in performance on a single charge (I forgot to plug them in and charge them last night).\n\nSpeaking about running them for several hours, it seems like buring them in, does help. Vocals sound much clearer now. Definately sounds less muddy than straight out of the box. Of course I could just be imagining it.\n\nThe one bad thing is it did have a pretty awful smell out of the box (like some other reviewers pointed out). It's not too bad now after 3 days of sitting out of the case.\n\nMy recommendation would be if you got the disposable income for this. Buy it! You'll be very happy.",
            "title": "Quite impressed",
            "userName": "Pukahead"
        },
        {
            "date": "February 13, 2014",
            "rating": "5.0",
            "text": "I was sceptical of this new listing as the early posters were all pre-release advance raves who were paid for their reviews. However, I can honestly say I have been impressed so far. Very nice build, just feels and looks quality, not the usual cheap plastic Chinese crap found in this price range. I am no audiophile, but the range/response seems very good, pairing was easy peasy with both iPhone and Taotronics transmitter. BT range seems good, maybe further than advertised. The charge/pairing light is cool, discreetly shows thru the brushed aluminum looking side panel. Nicely boxed with a magnetic latch and includes a usable travel case. I have not tried the music/call or mic yet. Unless the battery life turns out to be disappointing, this was one of the better buys I've made in a while. Well done Photive.",
            "title": "I paid $50 for these, worth at least twice as much.",
            "userName": "Mark Twain"
        },
        {
            "date": "February 13, 2014",
            "rating": "5.0",
            "text": "Great audio quality, bluetooth connection is strong and stable in a very large radius from the transmitting device. It has a slight delay when playing video, but it's almost unnoticeable. All in all, great value for money and fantastic audio quality.",
            "title": "Absolut best value for money",
            "userName": "Roie Cohen"
        },
        {
            "date": "February 12, 2014",
            "rating": "5.0",
            "text": "I am quite pleased with my set. I listen to music from my android phone extensively. This isn't an 'audiophile review' but I really like them. I also learned that they work great in 10 degree weather! my one-ear bt headset from a long standing vendor tended to go from 4 hours of talk time to recharge battery in a few minutes time when outside in the cold. this set keeps up with me regardless, the long battery life is a definite plus!\n\nfor phone calls, it is surprisingly nice to hear in both ears and have some noise blocked out. people on the other end seem to hear me ok, I have not tried to test that in noisy surroundings yet so don't know if there is any resistance to outside noises.\n\nevery product has something that could be better. for me, I would like a mute button on the headset, but that is a personal preference.\n\nhave not heard of this company before but I am glad I took a chance!",
            "title": "works great for me even in the cold",
            "userName": "neal fildes"
        },
        {
            "date": "February 12, 2014",
            "rating": "5.0",
            "text": "I got these when they were on sale for 49.95 so really nothing to complain here for that price! Sound quality is great, they fit nicely and are comfortable to wear.\n\nThe first thing that sort of startled me a little was that the micro USB port was not well aligned with the casing, it feels like it's slightly out of place. Works as advertised so far, so as long as it keeps working - not problem. Also, the instruction manual said to charge the headphones for 12 hours the first time but they actually stopped charging (red LED coming on) after like 2. I guess that's a good thing. Just a bit confusing for the customer if you say such things that are not actually necessary with modern lithium-ion batteries.\n\nMoving on - connects like a charm to my iPhone, really nice. However, it does not connect to my MacBook because it doesn't have Bluetooth 4.0 yet. This should be written somewhere - it was not clear to me that they don't work with non BT 4.0 hardware at all. Slight minus but I was going to use it with my phone mostly anyway.\n\nLast but not least - the smell (which seems to come from the travel case) is not that nice. As I read the reviews before I purchased, I know that this might be the case, so no biggy. Unfortunately, the headphones themselves smell as well but I'm confident that it will pass.\n\nOverall, good deal for the price and I am happy with them as long as that USB port doesn't break. Bonus points for making the battery accessible (slide the right ear cover up to remove it), are these available as for purchase somewhere in case the battery dies at some point?",
            "title": "Very nice headphones, but...",
            "userName": "Colin"
        },
        {
            "date": "February 17, 2014",
            "rating": "5.0",
            "text": "Easy to connefast.amy Note 3 and PC. Very good sound quality for such a reasonable price. The name is on the inside so you're not wearing an ad on your head. Battery lasts all day and charges fast. Highly recommended.",
            "title": "Very good headset",
            "userName": "Charles R. Gross"
        },
        {
            "date": "February 12, 2014",
            "rating": "5.0",
            "text": "I was not paid for my review, and I had to buy my headphones, ulike some others here. With that being said these are teriffic headphones. The sound almost as good as $300 cans! They use very very little power via bluetooth 4.0. Connection is a breeze, strong signal, no cutting out, pops, buzzes, or other nonsense. Just good clear pure audio. Paired with an LG G2, and an HTC One, all the functions work as they should.\n\nThe microphone can have some echo issues for users on the other end of a call however I really didnt but them for this purpose so I dont care much. Its functional tho.\n\nI was looking at other bluetooth headsets like ones from meelectronics but Im glad I took a chance on these.",
            "title": "Absolutely Fantastic Bluetooth Headphones!!!",
            "userName": "Jdee"
        },
        {
            "date": "February 21, 2014",
            "rating": "4.0",
            "text": "The Photive BTH3 Bluetooth 4.0 Headphones are extremely cool. Very futuristic looking design on the outside with a very intelligent design on the inside. The twelve hour battery life on these headphones is a beautiful advancement to bluetooth headphones of all kinds. I could happily go a full week before charging them back up just because I do not normally spend more then two or three hours a day wearing them and I definitely don't use them everyday.\n\nThe convenience of just being able to hold down the power button hear the friendly jingle that plays letting you know the headphones are on and mousing over to the bluetooth button on my device and clicking pair is absolutely wonderful. I no longer have to continue on with the constant routine of every time I want to get out of my desk chair to grab a snack I can still keep my headphones on and continue to play whatever I was listening to.\n\nThe only category these headphones fall down in are their level of comfort. This of course makes sense considering the headphones are packing a beastly 4.0 bluetooth connection and 12 hour battery inside the headphones themselves. Before these headphones I owned a pair of Bose AE2i Audio Headphones which offered extreme comfort and sound quality with a major setback of having a not so long audio jack. However, I cannot say that the difference between the bose and photive heaphones quality of sound is very different I think both of them are far superior to any other headphones Iv'e owned.",
            "title": "Next-Gen of headphones.",
            "userName": "Noah Donadio"
        },
        {
            "date": "February 14, 2014",
            "rating": "5.0",
            "text": "I work in a lab of loud equipment and needed something to drown out the machinery. I have had them for about a week. These work great. They connect to my phone (Samsung S3) quickly and easily. The battery lasts all day. I leave them running whenI take breaks and lunch so they run for a little over 9 hours strait.\nAfter wearing them for a couple of hours my ears get a little hot but a 5 minute break fixes that.\nThey sound good and for 60 bucks you can't go wrong.\nI have not tried the microphone on a call yet but I don't think that will be any problem.",
            "title": "Great sounding headphones",
            "userName": "Dave"
        },
        {
            "date": "March 5, 2014",
            "rating": "3.0",
            "text": "First , people comparing these headphones to BOSE are delusional, suffer from hearing loss or simply lying.\n\nI own , the Bose Q15, Sennheiser HD 280 PRO, Klipsch S4i (II) In-Ear Headphones and just received MEElectronics Air Fi Runaway.\n\nLet me save you time and headache .\nBuy a pair of MEElectronics Air Fi Runaway, especially if under $55.\n\nNow the review:\nWhen you put these head phones in your head you will question yourself at least once if the R on the phone is indeed the right side.\nAfter confirming , you will still remove them and flip them just to make sure that it is not a mistake.\nAny way you put these headphones on they are awkward and you will be expecting them to fall of your head any second.\nI take the subway to work for about an hour one way and after 40 min , these head phones were uncomfortable and I had to remove them.\n\nSound quality :\nThe only thing I found these headphones could do OK , was electronic music.\nI played rave, trance and techno and found them acceptable.\n\nTerrible on anything acoustic , classical or opera.\nAudible was even worse . Reader sound like he/she is sitting in a corner of a room and reading to you.\n\nNoise isolation not good at all, and the sound leak not in acceptable to watch tv at night next to anyone.",
            "title": "A true owner of Bose QuietComfort 15 reviewing these",
            "userName": "Gjergj Elez Alia \"Alban\""
        },
        {
            "date": "March 4, 2014",
            "rating": "1.0",
            "text": "Too tight, very uncomfortable to wear. Bad bass. Overpowering chemical smell that gave me a headache, clogged my sinuses, and caused me to vomit. Could not be more dissatisfied. I've returned the item.",
            "title": "Avoid these!",
            "userName": "Erik S. Johnson"
        },
        {
            "date": "February 11, 2014",
            "rating": "4.0",
            "text": "Update:\nI have received a call from Photive and they have sent me a new set and it doesn't have the strong plastic smell. Bumping the review to 4 stars.\n\nOld review:\nThis set has a burning plastic smell. Works fine connecting to my iOS and android devices. I'm hoping the smell will go away eventually.",
            "title": "Funny smell & Good customer service",
            "userName": "Yong"
        }
    ]
}