{
    "Count": "438",
    "Last Update": "2014-04-16 23:15:40.813375",
    "Product Name": "Plantronics Audio 478 Stereo USB Headset (Audio 478)",
    "Reviews": [
        {
            "date": "December 31, 2011",
            "rating": "4.0",
            "text": "This Plantronics Audio 478 Stereo USB Headset came to me via the Amazon Vine Reviewers Program. It was a timely for me because I had just ordered a new computer and was planning on setting up Skype. I am an avid Facebook user and recently learned that I will be having shoulder surgery, so I will be using voice activated software to keep up with Facebook and other computer tasks - needing a solid headset with microphone to do so.\n\nThe Headset:\nSolidly made, folds for storage with a small, but accurate microphone, this headset is comfortable to wear for long periods of time. It fits completely over your ears - but it's not noise cancelling - noise still gets through - which frankly I like if I'm working so I can hear others come and go in the room.\n\nThe cord is about 6' long from the USB port connection to the headset. The control for on/off for Skype hits at about waist level when the headset it on me (I'm 5'6\" with an average length torso). The boom for the microphone comes out from one of the earpieces. Because it rotates like the hands on a clock - you can have it coming from the left or right - whatever is comfortable for you. The headset is big enough to fit on larger noggins, and some with smaller heads may actually find it lose fitting.\n\nMusic and Gaming VS. Skype:\nTo use this headset with Skype you have to first go to Plantronics' website and download specific drivers that work with Skype. It's quick and easy to do so, and once I logged into Skype the software had no problem recognizing the headset immediately. Voice transfer was clear with only a slight echo occasionally. The microphone is noise-cancelling (giving a clear reproduction of your voice without noise in the room coming through too). Overall I'd rate it a 5 out of 5 for internet calls or video chat, using Skype, iChat or Windows Live Messenger. It works with both PC's and MAC too.\n\nAs for music playback - I thought the sound to be lacking. I tried several genres of music, adjusted my PC's output to Bass Boost, etc..., but I really wasn't impressed with these headphones for true music enjoyment. I think it's adequate, but not much more in this area.\n\nI also used this headset for playing the game L.A. Noire: The Complete Edition. I liked it, but hardcore gamers would find it lacking enough 'umph' I'm sure, and without the noise cancelling earphones, you have to turn up the volume quite a bit on your PC as sound is lost through the earpieces of the headset.\n\nConclusion:\nThese headphones are a good choice for those who frequently use Skype or similar chat software for work or pleasure. Also a good choice for software programs like: Dragon NaturallySpeaking Home, Version 11. However, they are not the best choice for music reproduction - lacking depth of sound and noise cancelling earphones - or for gaming, but do work for both. The headset is compatible via USB with both PC's and MAC. For my needs for Skype and voice recognition software, this headset will work great.\n\nIf you're more into music or gaming and want noise cancelling as a feature, consider these options: Plantronics GameCom 367 Closed-Ear Gaming Headset or Plantronics .Audio 655 USB Multimedia Headset which actually cost less and are geared towards those specific listening needs.\n\n1/4/2012:\nUsed this headset for several hours while talking via Google Talk (free long distance calls through the end of the year 2012, but you need a Gmail account to do so...) on both local and long distance calls. All the calls were clear to both me as the user of the headset and to my call recipients. Actually the call recipients said that other than the number that came over caller ID, they noticed no difference in sound quality (me using this headset over the Internet) than if I was using a land line directly from my house. They said it was better than my cell phone for clarity (I have an LG Optimus with Virgin Mobile service).\n\n1/16/2012:\nFinding the headset to be uncomfortable on my ears after about 30 minutes. Call quality is still good, but not the most comfortable of wear.\n\n10/19/13:\nStill using this headset and enjoying the call/voice recording capabilities. I use it to do screencast recordings, and used it while working for a company's customer service department. Its durability has been excellent, but I must admit I do treat it gently; folding it up and putting it in its bag when not in use. The extra-long cord has been great, and I enjoy the way I can look down and see if the mute button is engaged (red light on) or not.",
            "title": "Good for Skype, Google Talk  and Facebook integration, audiophiles will find it lacking",
            "userName": "Andrea Polk"
        },
        {
            "date": "January 12, 2012",
            "rating": "5.0",
            "text": "I worked in customer service for awhile, and most that I've known use plantronics headsets. There is a reason for this.\n\nWhen you first open the package you see the headset all folded up. It comes with a cloth bag as well that wouldn't protect it much, but might keep some dust off of it.\n\nWhat I like about this headset.\n - Very lightweight, it may seem a bit fragile, but being lightweight is great for feeling good on the head.\n - Sound quality reception/mic is very good.\n - Very adjustable, the ear pads swivel which allow for a very comfortable fit.\n\nWhat I don't like\n - The volume up/down/mute switch seems to be up to high. Instead of being able to hold it in my hand on my lap, I end up always having to reach for it, or grab it and spin it around to see if I'm muted.\n - The pickup/hangup button doesn't seem to work, I am on OS X and haven't installed any software, so this may be why, don't really need it.\n - Cords on both ears instead of just one\n\nBottom line, this is the best usb headset I've used, most comfortable, sound/mic isn't an issue, and it works great every time. I just wish there were a few small changes.",
            "title": "I love this headset (albeit one minor flaw)",
            "userName": "E. Byers"
        },
        {
            "date": "February 8, 2013",
            "rating": "5.0",
            "text": "this is really an amazing headset.\n\nLikes\n1. cheap ($30 inclusive of S) yet very high quality (*see below)\n2. the voice quality, both receiving and outgoing is \"pro\" standard. i verified by calling my land line and left voice mail. also had friends called me from their cell phones and land line. the feedback was unanimously \"pro like\". or \"pro\". no echo, no background noises, comfortable to listen to.\n3. easy to operate. pluck and use from USB port. no need to download any driver or software. (*you must download a driver from Platronics if you want the remote on/off call button to activate. i do not need this function thus no need to download any driver)\n4. no conflict with other USB devices. i have a Logitech webcam device attached. both devices work seamlessly, no need for any adjustment on my part.\n5. easy on the eyes. nice aesthetic.\n\nDislikes\n1. carrying bag is cheesy. should consider providing a hard carrying case for traveler.\n2. USB cable too short. a longer cable would offer a little more flexibility for users. bear in mind in today's PC world, laptop performs the function of a desk top. even better option is to introduce a wireless headset.\n\nfor $30-, this headset \"Exceeds Expectation\".",
            "title": "Amazing Quality @ Amazing Price",
            "userName": "Spike Spiegel"
        },
        {
            "date": "February 7, 2012",
            "rating": "3.0",
            "text": "These affordable corded headphones are OK, but not to fall in love with.\n\nIf you Skype from your laptop or desktop computer, and listen to music between calls, OK.\n\nIf you wear headphones a lot, you'll want better comfort and sound.\n\nFor \"on-the-go,\" you could want something more compact.\n\nUSB connection -- not for phones.\n\nPROs:\n\n - Affordable\n - Plug and play\n - Handy control stick - Mute, volume, and call answer/terminate\n - Noise canceling mic (earphones are not noise canceling)\n\nOKs:\n\n - Music fidelity is OK, not great\n - Comfort is OK, not great. Not for wearing hours on end\n - Open-air foam earpieces allow you to hear your surroundings (good or bad)\n - Secure enough fit, just barely\n - Fold-able, but not super compact\n - 1 year warranty\n\n- - - Alternatives - - -\n\nI have not tried them, but I would consider:\n\n- Sennheiser PC 36 USB Headset\n- Logitech USB Headset H530\n- Logitech Laptop Headset H555\n- Creative Labs Sound Blaster Tactic 3D Alpha USB Gaming Headset",
            "title": "Lots of OK",
            "userName": "C. MacPhail"
        },
        {
            "date": "May 18, 2012",
            "rating": "5.0",
            "text": "I use this set on a Mac PowerPC 2.0Ghz system. The Plantronics Audio 478 worked perfectly out of the box after plugging it into a powered USB hub. It's an excellent buy for $29.97. When using with Skype, access the Preferences/Audio. Select Plantronics .Audio 478 USB for audio output and input. The headset is comfortable, has excellent sound quality, and works as intended. My first call was on Skype for 1Hr +. I barely noticed the headset during the call. I played with the inline functions - worked fine.",
            "title": "Excellent Plug & Play Mac Headset.  A winner for the price!",
            "userName": "Dxthomas"
        },
        {
            "date": "January 22, 2012",
            "rating": "4.0",
            "text": "The Plantronics .Audio 478 USB Stereo Headset is good quality for a compact headset. It easily folds to fit in the included 9\" x 5\" pouch.\n\nThe headset is very lightweight and is and comfortable to wear but stays in place without putting too much pressure on the ears.\n\nSound quality is excellent: voices seem natural with no crackling and no echo as with some headsets. The microphone is on the left earpiece but it swivels 270 degrees so the headset can be reversed to use the mouthpiece on the right side. The cord is rubbery and about 6 feet long. It has a USB plug.\n\nThe 478 works both with Windows and Mac. In addition to volume up, volume down, and mute functions as on the control set on the cord of most headsets, there is a call answer button that will work with Skype if software is downloaded from Plantronics.\n\nTwo suggestions for improvement: the metal finish on the plastic looks cheap and the foam earpiece cushions do not seem to be removable for washing or replacement. I tried to call Plantronics about the foam but their customer support hours are 8AM to 5PM PST Monday to Friday. I suggest getting some disposable foam covers to protect them unless you plan to discard this headset when they become soiled.",
            "title": "Good quality headphones for making calls from your computer",
            "userName": "Margaret Picky"
        },
        {
            "date": "January 9, 2013",
            "rating": "5.0",
            "text": "I bought this headset to use for my work as a work-at-home customer service agent.\n\nI don't like the big heavy headsets nor do I like the big heavily padded ear muffs as they make my ears sweat, e[...]\n\nThis set was the perfect solution and offers very comfortable and lightweight quality. The volume and mute control is placed at the perfect location on the wire as well. This set allows my ears to breathe as well unlike so many other headsets out there.\n\nThe plug-n-play convenience of the USB connection top it off and make this headset a quality, long lasting device that I am VERY happy with!\n\nEasy 5 out of 5 score!",
            "title": "Heavy, every day use for six months, still working wonderfully!  Very comfortable and lightweight!  Awesome sound & mic quality!",
            "userName": "Zaxx \"Zaxtor99\""
        },
        {
            "date": "January 9, 2012",
            "rating": "5.0",
            "text": "QUICK SUMMARY: This headset works well with my laptop computer. While using Skype, the sound I heard was very clear, like the person was sitting next to me. The other person reporting excellent sound, too -- much, much better than when I used my laptop's built-in microphone. The fact that this set is foldable and more easily transported makes this a great headset to own. Highly recommended!\n\nWHAT I LIKE:\n\n- Comfortable fit. I didn't feel pressure on my head or ears after wearing them for a while.\n- The sound I heard was excellent for voice (I don't use headsets for music)\n- The sound captured by the microphone was excellent (as reported to the one who heard me speak)\n- Foldable design makes them easy to stow or transport\n- The microphone boom kept away from my mouth (other headsets I've owned tend to bump into my mouth)\n- Plug-n-play performance. Windows 7 recognized it right away for me. No drivers to install.\n\nUsually I can make a comment or two about what could be done to improve a product I review, even if there was nothing I particularly disliked about that product. With this headset, nothing really comes to mind about what could be done to improve it. A headset should be comfortable to wear, provide good sound through the earpieces, capture and deliver sound well through the boom microphone. This headset does all of that. As long as there isn't an issue with reliability, I have no qualms about recommending this Plantronics headset.",
            "title": "Wonderfully compact, great sound and performance",
            "userName": "William W. Davis \"famousdavis\""
        },
        {
            "date": "May 22, 2012",
            "rating": "3.0",
            "text": "Very good audio quality, but poor build quality. Mike portion broke almost immediately. Not apparently repairable. Not clear how/whether this can be returned.",
            "title": "Plantronics headset",
            "userName": "N. Pearson"
        },
        {
            "date": "March 16, 2014",
            "rating": "3.0",
            "text": "This headset has a great sound quality when used for calling (listening and speaking). But, as it is not supported on Linux (I mean, you can plug it and use it normally, but you can't use the buttons to control the volume and mic), I had to write my own application.",
            "title": "Greate sound quality, but I use Linux and had to write my own program to make it work.",
            "userName": "Rafael"
        },
        {
            "date": "December 31, 2012",
            "rating": "4.0",
            "text": "This is a great headset, I'm using it for training for a vitual agent and its great noise canceling is about 70% I would say but great quality. Mute and volume buttons are close by. I would recommend this product.",
            "title": "Great buy",
            "userName": "Kim"
        },
        {
            "date": "November 4, 2013",
            "rating": "5.0",
            "text": "This headset has the best noise canceling mic that I've used. We are long time work from home people that give it about 7-10 hours of continuous use, daily. The cleaner has been vacuuming on the other side of a swinging french door to our office - with a vacuum that sounds like a high pitched jet engine, and the caller didn't even hear it. It does pretty well with background voices, but if there is someone sitting at the table with us talking loudly, it will pick up that sound. You can play a low to medium level music and have it not be heard.\n\nI have 2 of these. They work better (noise canceling) than any cordless ones I've tried including Logitech H600, and some Skype ones from InStore shop.",
            "title": "Best Noise canceling mic",
            "userName": "IBoughtAThing"
        },
        {
            "date": "August 30, 2013",
            "rating": "5.0",
            "text": "I bought these headphones for making tutorial videos for my computer science students. I had no trouble with them on my Windows 7 computer, but they seemed to be \"dead\" when I first tried them on a Mac. However, a quick call to tech support informed me that some Macs need adjustments in the System Preferences to change the input and output settings to use the headphones. I'm a satisfied customer.",
            "title": "Suitable for both PC and Mac",
            "userName": "Linda W."
        },
        {
            "date": "October 22, 2012",
            "rating": "3.0",
            "text": "I use this for recording videos to upload to the web.\n\nPros:\nLike the fold up design as that makes the headset a bit easier to take on the road; does not fold up to a compact size, just so you don't break it in transport.\n\nLight enough.\n\nPretty comfortable. I would not want to wear it for hours.\n\nCons:\nMicrophone is a bit too sensitive and needs a foam wind cover included. I use it in my office and when the A/C is on it literally picks up the breeze coming out of the register as if I was outside.\n\nMute/volume buttons are large (not that big of a deal) and heavy (big deal) without any clip to hold them steady. Thus if you move your head rapidly while recording they can bang into objects and the microphone picks that up.\n\nRattle in the right earphone when it came.",
            "title": "Not bad but some issues in design",
            "userName": "JSquare"
        },
        {
            "date": "November 16, 2013",
            "rating": "5.0",
            "text": "I just purchased this headset. I use Windows 7, and Dragon NaturallySpeaking premium edition. Unfortunately Windows did not recognize this headset. I was able to get it to be recognized eventually, but Dragon does not recognize this now. It does fine with the Logitech. I may try one other fix, otherwise I will just sent these back. Just wanted to let others know who might be using Windows 7 and Dragon that this may not be something that will be usable.\n\nI wanted to update this. I'm not sure what happened but I re-plugged the headset in, and it went ahead and uploaded the Windows updates, and indicated that it was current. I then went into Dragon, and change the microphone setting, and went ahead and tuned the mic, and it works perfectly. It is very accurate compared to the Logitech headset I used before. It is slightly less comfortable, but easily worn for several hours. I'm not sure what happened the first time around, but I wanted to make sure to update my review to indicate that these do work with Windows 7 and Dragon 12.5, and they are highly accurate.",
            "title": "Does not work with Windows 7 and Dragon--UPDATED",
            "userName": "drsteve"
        },
        {
            "date": "November 26, 2012",
            "rating": "2.0",
            "text": "This review has been edited to let people know this product crapped out before I'd even owned it for six months. It was working perfectly before, but now when I plug it in, the computer doesn't even recognize that a device is plugged in. It's like it's just dead. I tried all USB ports on four different computers to verify that the problem was the device and not a driver or computer issue.\n\nI will update this to let you guys know if Plantronics honors their warranty.\n\nPros:\n\nSkype-compatible inline controls\nGood sound quality\n\nCons:\n\nSlightly uncomfortable\n\nAfter three months, I was pleased with it. I used it for Skype and for online gaming, and the sound quality and microphone were both better than I expected; the noise cancellation worked really well to cancel out background noise. The inline controls for Skype worked perfectly, and the software was so easy to download and install that even my elderly mother could do it when she used the same headset!\n\nThe only problem I had initially was some discomfort from the pressure of the ear pads on my ears. I have really sensitive ears, and the pressure on my ears began to hurt a bit after talking on Skype for a long time. That being said, most people are not that sensitive, and I was talking for hours. It's worth considering if that's a problem for you, but it's not fair to take a star off for something that's not a defect or oversight. It's still much more comfortable than any other headset I've found.",
            "title": "Crapped out after less than 6 months",
            "userName": "amusedintp"
        },
        {
            "date": "April 2, 2014",
            "rating": "1.0",
            "text": "This headset is not designed to be worn by humans! Very, Very uncomfortable. The overall design is ridiculous. The headband is not adjustable and is flat across the top and is way too tight. The ear pads do not swivel enough be able to self adjust to the pinching of the headband. There is no clip for the very heavy volume controller, so the weight of the controller constantly pulls down on headset. Very bad design. I can wear these for about 30 seconds before they begin to hurt my ears. Highly disappointing.",
            "title": "Plantronics plainly painful headset",
            "userName": "Robert M. Freeman"
        },
        {
            "date": "January 16, 2014",
            "rating": "5.0",
            "text": "My wife and I have a consulting business we operate out of our home office and do quite a bit of training for clients via webinars. We've gone through several headsets in the past six or seven years. This one is by far the best we've used. Computer (we use Mac Minis) recognized the headset instantly. It's comfortable to wear even after 60 or 90 minutes. Sound quality -- both sending and receiving -- is amazing given the price.",
            "title": "Best headset we've ever used for doing webinars",
            "userName": "Mike \"Mike\""
        },
        {
            "date": "November 29, 2013",
            "rating": "5.0",
            "text": "I use this with Dragon Naturally Speaking and it works flawlessly. For the price I think this might be the best on the market and USB microphones are absolutely the way to go.",
            "title": "Works wonderfully with Dragon Naturally Speaking",
            "userName": "Amazon Customer"
        },
        {
            "date": "October 25, 2013",
            "rating": "3.0",
            "text": "Bought this headset and it works fine. I really like the integrated controls for skype. Unfortunately as of Dec 2013 Skype will no longer suppor these controls. I do hope a fix becomes available otherwise I feel a bit let down by Plantronics.",
            "title": "Skype support ends per December 2013",
            "userName": "AJDN Dekker \"Sander\""
        },
        {
            "date": "September 6, 2013",
            "rating": "4.0",
            "text": "I bought this unit to replace a damaged headset for my Rosetta Stone application. This was a perfect replacement with controls to mute, etc. It works really well and I highly recommend it.",
            "title": "Perfect for my use (Rosetta Stone)",
            "userName": "V. Rao \"loves a good deal\""
        },
        {
            "date": "September 3, 2013",
            "rating": "5.0",
            "text": "It's so great I bought two. Planning to buy another for the hell of it.\nI have several headsets and microphones. From a Gamecom 780 to standalone desktop table microphones along with Audio Technica headphones. But nothing beats the voice clarity, and the comfort of this headset. It literally IS noise-canceling. I had my family playing karaoke and movies in the background and the background sound of that was lowered to my friend, whom I was playing games with online, making my voice clear and hearable.\n\nThe sound is enough for casual music listening. I'm no audiophile but owning several audio technicas and jvcs and kosses, this seems to be pretty damn good. As for how it feels like on your head? If you've ever owned koss portapros, just imagine that, but more lighter and not-so tight hugging.\n\nOverall the best con for me is the mic and price on this thing. it's like plantronic's best product right now.\n\nPROS:\n- Mic sounds amazing *\n- Lightweight, comfortable as hell\n- Plug and play, none of that bs driver unless you want to be able to end/answer calls with the button on the headset cord\n- Sounds great\n- Skype certified ( I believe this is when Plantronics hires skype to do testing on their product, and if it works well and is clear, it gets a skype certification )\n- It's so great that according to reviews some electronic stores are using this among employees to communicate\n\nCONS:\n- Seems very flimsy. I have been using it for a year though, and dropped it about 4x a week. Nothing has broke it. So it's pretty durable.\n- This is not related to this product, but this goes for 50 dollars at local stores for some reason, while its 25 online. Weird.\n- That's it. This is great.\n\nHell i'm going to pick up another one later for back-ups.",
            "title": "This is literally the best headset for the price on Amazon right now.",
            "userName": "Tony"
        },
        {
            "date": "July 13, 2013",
            "rating": "5.0",
            "text": "I just started using Google Voice and looked for a decent heaadphone mic.\n\nI purchased the Sennheiser PC-151- thought the quality would be great -WRONG!!\n\nI went to my local Fry's store and asked for suggestions.\n\nThey said the Plantronics 478 is what they use ( and also said a USB connection is better than the plug in mic that I had.\n\nI tried them and WOW.\n\nCrystal clear.\n\nI would have purchased these from Amazon, but Fry's ( which was charging $50.00) matched the price-$24.59\n\nSorry. Amazon - next order is for you.\n\nIf you need a headphone mic, get these, you won't be sorry.",
            "title": "Headphone mic",
            "userName": "PSCO2007"
        },
        {
            "date": "January 12, 2012",
            "rating": "5.0",
            "text": "I chose these headphone because I needed a good set of headphones for my games like Battlefield 3 and Skyrim. If you were previously using standard usb external speakers, these headphones will greatly improve your gaming experience. You can literally hear the enemies footsteps and the direction they're coming from! The sound quality is 10/10.\n\n Another thing I love about these headphones are how comfortable they are. Once I put them on, I almost forgot that I'm wearing them. They don't dig into your head like bigger, bulkier headphones that I've used in the past. The microphone on this also works very well 10/10. The only thing I don't like about this headphone is the fact that the cords length is kind of long for me. The cord sometimes gets caught under the wheels of my chair. But then again, I would rather have the cord too long rather than too short. Overall, I would recommend this to anyone that's looking for new headphones.",
            "title": "FANTASTIC GAMING HEADPHONES!",
            "userName": "Momma Mary \"Expert Mom!\""
        },
        {
            "date": "January 3, 2012",
            "rating": "5.0",
            "text": "For 50 dollars, you could do a heck of a lot worse when it comes to a computer headset. With an easy setup, decent audio quality, and sleek design, it's a no-brainer when it comes to recommending the Plantronics Audio 478 Headset.\n\nComfort is always a top priority when it comes to a headset, and this pair is fine in the category. They're very lightweight and after wearing these for well over an hour I felt no discomfort. They fold nicely when not in use, so when you need to put these away they won't take up a ton of space around your computer. These aren't noise canceling, but you'll notice that the earphones are pretty small (unlike ear cups), but I didn't find this to be distracting. The cord is 6 feet long, so you won't have any problem reaching for the volume if you need to push away from your desk.\n\nThe sound quality is decent, but not great. However, for a 50 dollar pair of headphones you can't expect much more. I used this with Skype (which is one of the things this headset is promoting the most) and voice clarity was crystal clear. When I turned up the volume there was noticeable feedback, but unless you're deaf this won't be an issue. I also used it with iChat on my Mac Mini, and the voice clarity was very good. Overall, I'd recommend this headset with flying colors if you only intend to use these for online chatting.\n\nI used these as a standard pair of headphones for music and video games, and while they are acceptable in this capacity, they're definitely not going to impress you. There is no bass or equalizer to utilize, and there is always noticeable distortion when the volume is turned up high. Again, these aren't really made for gaming or music use, but they will get you by until you buy headphones specifically made for that type of thing.\n\nFor what this headset claims to accomplish, they are a success.",
            "title": "Solid headset",
            "userName": "M. Fulkerson"
        },
        {
            "date": "June 26, 2012",
            "rating": "2.0",
            "text": "I use headsets a LOT during the day, so I need one that's at least moderately comfortable over extended periods of time. This is the third model of Plantronics headset I've tried in as many years - while the first two were of flimsier build, they were much easier on the ears (my head, by the way, is normal size!). This one has a tighter fit that starts hurting the ears pretty quick and can bring on a tension headache after prolonged use. Time hasn't 'broken it in' either...",
            "title": "Uncomfortable",
            "userName": "anabantid"
        },
        {
            "date": "March 23, 2014",
            "rating": "5.0",
            "text": "Purchased this teleconferencing when working from home. The sound is perfect for that situation, the price is right and the set is comfortable --- I have no complaints! It's worth the price for my purposes.",
            "title": "Use it for teleconferencing when I'm working from home",
            "userName": "H. Black"
        },
        {
            "date": "March 20, 2014",
            "rating": "5.0",
            "text": "I have about 5 headsets including wireless. I have a conference call at least once per day. If its in the morning, the wireless isn't charged enough. If the conference is over an hour, the wireless loses its juice. I got this USB to resolve the aforementioned issues and it works as intended. Sound quality is great, comfortable wear, plug and play.",
            "title": "I work from home",
            "userName": "Mona"
        },
        {
            "date": "December 22, 2013",
            "rating": "4.0",
            "text": "I purchased this headset specifically, because I am now taking a weekly online class that is 4 hours long and requires a headset with a mic to reduce feedback when doing group work. The problem is that I easily get headaches from headbands or other bulky headsets. Something about the pressure is way too much. I also easily get tension headaches, so I definitely have a muscle thing going on. I have to be just as picky when buying sunglasses ... :P This headset had good reviews, had a USB plug, downloads drivers automatically and looked like it might more comfortable because it is listed as wide, adjustable and less bulky. Yay! I was right on that account. This one is more comfortable and I am less likely to get a headache. I have another Plantronic headset that may be nicer by others' account (lots of padding, better coverage over the ears etc.), but I just cannot wear it for any amount of time whatsoever as the things that make other people love it create too much pressure for me.\n\nIn addition, the ease of use and built in controls are a bonus. It is truly plug and play. The only reason I am not giving it all 5 stars is that I am now all of a sudden, after weeks of not issues, having trouble with it on one of my computers. The headphones don't work, but the mic does. The sound will come out of my speakers. However, I can plug and play it on my laptop and it works just fine. So I am pretty sure it has something to do with a recent update and I just haven't figured it out yet (It could be a MS update but more likely a recent Adobe classroom software update that just happened as I am using this in that environment for my online class). I doubt it is actually the headphones themselves as they work perfectly fine on the other computer. I just figured I should mention it in full disclosure.\n\nIf you are easily prone to headaches from other headsets or sunglasses then I suggest giving these a try!",
            "title": "Great for someone who easily gets headaches from other headphones",
            "userName": "Amazon Customer \"Health & Laughter Coach & La..."
        },
        {
            "date": "December 14, 2013",
            "rating": "5.0",
            "text": "Clear voice, plug and play. I like the idea of foldable headphones. Build quality is durable. Does not work with IMac.",
            "title": "Very good foldable headphones",
            "userName": "Shailender Rachamalla"
        },
        {
            "date": "December 11, 2013",
            "rating": "4.0",
            "text": "Very nice and portable, too! If you wear glasses or reading glasses, anything over the ear or behind the neck just doesn't work. This one is easy on the head (no headaches from the band being too tight) and provides clear sound, speaking and listening.",
            "title": "Great product and good price!",
            "userName": "K. Arnold \"bodogs1\""
        },
        {
            "date": "December 6, 2013",
            "rating": "5.0",
            "text": "Pleased with the audio quality and recorded sound for the money. I've used this for a few audio voice control apps, as well as recording a voice over in a pinch when I couldn't get to the studio. No one had any issues with the quality of the recording, once we punched the bass a little.",
            "title": "Good quality for the money.",
            "userName": "J. Sacher \"Joe Sacher\""
        },
        {
            "date": "December 6, 2013",
            "rating": "4.0",
            "text": "Love these headphones. They sound great, they integrate easily with my PC. I use them for gaming and can either wear the full headphone or hang them around my neck and just talk thru the mic. The only thing I didn't like, which is supposed to be a feature and most would probably like it, is that the headphones bend in two places to make them easy to store and pack. It's a cool design, but when they bend on my neck they pull the hair. I also wish they made these in bluetooth because i get sick of the cord always being in my way.",
            "title": "Great headphones!",
            "userName": "jenn"
        },
        {
            "date": "December 4, 2013",
            "rating": "2.0",
            "text": "not even a year and it's stop working already. Too bad they don't even have a warranty plan. Now I have to buy another set.",
            "title": "this will not last longer than 1 year.",
            "userName": "DarthKristie"
        },
        {
            "date": "November 26, 2013",
            "rating": "5.0",
            "text": "I've enjoyed this headset so much, I've ordered another, just in case. I use it for Dictate Dragon NaturallySpeaking on my Mac. It's perfect. It's not heavy and does not get in the way. It's also comfortable. Personally, I recommend it if you do any speech to text or have a need for a microphone that will always be the same distance from your mouth every time you use it.\n\nAs a student, I write a gratuitous amount of papers. Utilizing speech to text software speeds up my productivity in completing my papers. This microphone is perfect!",
            "title": "Excellent product! Great for speech to text..",
            "userName": "Unicast"
        },
        {
            "date": "November 19, 2013",
            "rating": "5.0",
            "text": "QUICK REVIEW:\nPros: Comfortable, great sound quality (listening to music, has a surprising amount of bass feedback), automatically syncs up with Skype (no software to download/install, no settings to change).\nCons: Looks a bit silly, fits my large head very well, might be a looser fit on small heads, controls hanging from the headset are at a weird length, right around the lower chest.\nOverall: Love it; quality to price ratio is excellent.",
            "title": "QUICK REVIEW: Love it; quality to price ratio is excellent.",
            "userName": "uberchemist"
        },
        {
            "date": "November 14, 2013",
            "rating": "3.0",
            "text": "I like the $18 Microsoft LC-3000 better for voice/Skype because they are more comfortable, and costing less is a bonus. Here is my full review:\n\nI bought the following headsets and compared them. I didn't intend to buy so many, but was just disappointed with the performance of my earlier purchases and I was not satisfied until I got these. Here is what I think of the ones that I tried:\n\nSound reference: On scale of 1 to 10:\n\nWorst free airline headphones I have heard being a 1.\n$6 Panasonic RPHJE120K being a 6.\nSennheiser HD580 Jubilee being a 10 (even though there are better headphones out there, like the Sennheiser electrostatics).\nUpgraded version of these: Sennheiser HD 580 Professional Headphone\n\nRazer Kraken PRO:\n\nI really expected these to be good because they got good reviews. They look nice and high quality. They are very comfortable. The sound is dreadful. Sound quality on that scale - 3. Not usable for music. Very muddy and sloppy bass that drawfs the mids and highs. Vastly worse sounding than the $6 Panasonic ear buds. You may find them a bit much in size if you just want to do Skype or voice dictation and will never listen to music or play games.\n\nTurtle Beach Z11:\n\nAs comfortable as the Razer. Decent looking but not quiet as nice looking as the Razer, but costs less than half the price and the sound quality is light-years better. Not even in the same universe. Sound quality - 8. Excellent for listing to music for enjoyment.\n\nBonus points - has a 4-pole plug so you can plug it into an iPhone or I assume probably a Macbook and the mic works. Good enough to listen to music on for enjoyment.If I had these on for music and the Sennheisers were 20 feet away, I would not be motivated to get up grab the Sennheisers as they are close enough that I have to A/B them to remember the differences.\n\nPlantonics 478:\n\nNot comfortable - too much pressure into ears (I don't even have a large head).\nGood if you want portable as they fold.\nSound - 4. Not good enough for music for pleasure.\nI would say they would be good for voice-only use, except they were not comfortable enough, so I cannot even recommend them really at all.\n\nMicrosoft LX-3000:\n\nMuch more comfortable than the Plantonics.\nSound - 3. Not good enough for music.\nGood for voice use. I would say buy these if you will not use them for music but need something just for voice dictation and want something more compact than the Turtle Beach.\nSubjective \"look\" of quality - marginal but acceptable at the price point. If they were even $10 more I would say they were too cheap looking.",
            "title": "Can't say I like them.",
            "userName": "Robert Silvers"
        },
        {
            "date": "October 8, 2013",
            "rating": "5.0",
            "text": "I love this set, only got it a few weeks ago. The extra Skype functions on the wired controller buttons to pick up and hang up a call are cool and partly why I got this. BUT a few days ago going on Skype I got an alert that this would fail to work soon. Clicking the Why? button took my browser to a Skype page explaining they will cease supporting the \"Desktop API\" in favor of some broader API that will still (only) allow talk but do better with mobile pads and phones. BAH HUMBUG!",
            "title": "Skype says extra Skype functions will fail soon",
            "userName": "R. P. Henerey"
        },
        {
            "date": "October 3, 2013",
            "rating": "5.0",
            "text": "First of all - for Skype or any other audio calling software this is EXCELLENT. The noise reduction is amazing!\n\nVoice Clarity - 5/5 - When I stop speaking sometimes the person on the other side thinks the call dropped. With both Google Hangouts and Skype and many times I've been told my voice is crystal clear.\n\nSound - 4/5 For this price I say this is amazing! I listen music on these headphones and I am not disappointed. These are not $300 headphones so please do not compare them with those. In this price and maybe even higher these are amazing. They are primarily made for audio conference but they do fair pretty well on music.\n\nComfort - 5/5\nMy ears are really sensitive, I can't use closed ear headsets I get red ears pretty fast and since I have a broader face and wear glasses they do not press my glasses on the sides of my face (which most of the headsets with closed ear design do) I can wear them for extended periods and do not even feel uncomfortable.\n\nI do not write a lot of reviews but I had to write this. I got this product about 1 year ago. I earlier used Plantronics gaming headset it was horrible, but I gave them one more chance and I am pleased!\n\n:)",
            "title": "Excellent for Calls and Music",
            "userName": "WPItech"
        },
        {
            "date": "September 23, 2013",
            "rating": "4.0",
            "text": "The sound quality on these headphones is better than expected. While I did not get these for listening to music, I would have no problem using them for that, if only they were more comfortable for extended wear (more than an hour). For my Mac (10.8.5 Mountain Lion) these headphones were indeed plug-and-play with all the buttons on the headphone cord (mic mute, output volume up/down) working as expected. As reported by others, only the telephone pick-up/hang-up button does not function on the Mac for lack of software.\n\nSome folks apparently have had trouble using these on their Mac. Try this test on your Mac right now -- find the little speaker icon in the menu bar at the top of the screen. Normally when you click on this you get a volume control slider. But if you hold down the 'option' key and then click on the speaker icon, you should get a drop-down menu that allows you to pick your input and output devices. (If you are using a non-Apple keyboard on your Mac, try the ALT or 'windows' key instead.) If you see that menu, then when you plug these headphones in, you should see two new choices in this menu, both labeled Plantronics .Audio 478. One is for input (the mic) and one for output (the headphones). If you do not get a drop down menu, this is probably because you have an old version of Mac OS X, so you'll need to use the system preferences instead. But the idea is the same, when plugged into the USB port, Plantronics should become a recognized device.",
            "title": "Tip for Mac Users",
            "userName": "W. Costa \"a.k.a. 'BC'\""
        },
        {
            "date": "September 18, 2013",
            "rating": "4.0",
            "text": "I can't say enough nice things about this headset. I'm currently using it for online training for a new job, which we use Adobe Meeting for. I wear this headset about 9 to 12 hours a day, and it never bothers me. It never gives me a headache, the sound is great, the mic works perfectly. I have used it for a few Skype calls with my husband, and it was great for that, too. I have not tested the call answer button for Skype. I am using a MacBook Pro and everything is compatible.",
            "title": "First-time USB Headset User",
            "userName": "Amanda Cari"
        },
        {
            "date": "August 9, 2013",
            "rating": "5.0",
            "text": "They were ordered on Aug 6th in the afternoon and arrived on Aug 9th, so shipping was great, price was great, and they work really well. I got a Toshiba laptop and got rid of Win 8,, which I hate. I put Mint Linux on it. The built in sound is bad on this laptop, but going into Preferences/Sound and changing everything to the Plantronics hardware and output made the sound wonderful. The phones fit my big head and they are light. I'm glad I got these.",
            "title": "I really like these. They work well with Mint Linux.",
            "userName": "warbirdsdreamer"
        },
        {
            "date": "July 29, 2013",
            "rating": "5.0",
            "text": "I wasn't sure this would be what I wanted. I have purchased this same product that did not fold up for 3 times the cost. I thought for sure it would be poorly constructed. I was pleasantly surprised when it was exactly what I had purchased previously but now it is portable by folding into itself and it came with a handy dandy carrying bag.",
            "title": "Awesome Price Awesome product",
            "userName": "katjo"
        },
        {
            "date": "July 13, 2013",
            "rating": "2.0",
            "text": "I don't have any complaints on the fit of the headset, or the microphone. Microphone actually seems pretty good at providing a clear call. Background noise is minimal. However after about a month the mute button broke.",
            "title": "Build quality is rough, call quality is good",
            "userName": "Matthew Darragh"
        },
        {
            "date": "June 20, 2013",
            "rating": "2.0",
            "text": "These sound great and everyone hears me well. Plug and play. Pefect. Bought for a business trip to Australia and New Zealand and used Skype to stay in touch back home with family, clients prospects, several times a day. So why am I giving them a \"2\"? These are foldable, portable ... not a static desk unit. As such they are designed knowing people will use them while travelling ... why else would they be foldable? But from day 1, I had to keep searching back my brief case for the ear muffs and mic muff which came off constantly. Very low quality. I am leaving again for 3 weeks in NZ, and just had to spend $10 ordering more muffs. That is very, very aggravating. I hope the replacements have a better, tighter, fit.\n\nPLANTRONICS! Fix this! You would have a great product otherwise, but these are important parts.",
            "title": "Would be a 5 except for ...",
            "userName": "Occasional Critic \"skypilot\""
        },
        {
            "date": "April 15, 2013",
            "rating": "5.0",
            "text": "This has been a great headset to use. The sound is clear and the mic quality is also great. One thing I will note, that wasn't clear when I initially bought the headset, is you have to go to Plantronics website ([...]) to download the software to make it work with Skype, or over applications. The headset itself does NOT come with a disc to install the software. You have to do that online. That wasn't a big deal for me, since I had an internet connection, but I know that may be an issue for others. I would definitely recommend this headset to friends.",
            "title": "A great headset!",
            "userName": "bluetidepro"
        },
        {
            "date": "February 22, 2013",
            "rating": "5.0",
            "text": "We use this thing for Google Voice chats and it sounds good on both ends. Comfortable. I like the controls on the cord which seem to work well.",
            "title": "works just fine",
            "userName": "wetlandguy"
        },
        {
            "date": "September 4, 2012",
            "rating": "4.0",
            "text": "A great device. It folds up relatively small for easy transport in a Laptop Bag. And the voice/mic quality is fantastic! Just a note to keep in mind is that the buttons on the headset cord are only for Skype, but the mute button does work.",
            "title": "Plantronics478",
            "userName": "ScottLicht"
        },
        {
            "date": "January 19, 2012",
            "rating": "5.0",
            "text": "This is how easy it is to use the Plantronics .Audio 478 ... wait for it ... you plug it in.\n\nIt was a little tricky taking it out of its box because there are a few twists and turns (be careful), but in the end, it's a snap. I plugged it in to two different computers, my Vista desktop and my Windows 7 laptop. Both of them immediately recognized the headset and was talking and listening in minutes.\n\nIt is billed as being the best at working with Skype. Well, they aren't kidding. In yet another plug-and-play process, Skype registered the type of headset I was using and the buttons for picking up a Skype call when it came in worked like a charm. But none of this is worth much. I've not had too many problems getting USB headsets to work. The real clincher here is with the sound quality for the speakers and microphone: it is truly superb, of the first water!\n\nThe bass is rich and resonant while the higher tones are sparkling. The microphone is incredibly sensitive but not overly so. My callers say my voice comes through clear as a bell. I've also used the headset controlling on VATSIM, which is a virtual air traffic control environment. It worked steadily and without fail for over four hours. Truly an excellent headset.\n\nThe only possible problem is with the folding/collapsibility of the headset. You have got to be very careful folding it away and opening it. Once it is open, it fits snugly without cramping anywhere, on the top of the head or on the ears themselves. The microphone swivels in and out of the way very well. Good design, but it just looks fragile. Not saying it is, but it looks that way folded up.\n\nThe carrying sac is a nice touch.\n\n5 stars with some reservations for its possible fragility.",
            "title": "The Sound is Superb",
            "userName": "Frederic Woodbridge \"Fred\""
        },
        {
            "date": "December 30, 2011",
            "rating": "4.0",
            "text": "First of all let me state the caveat that I'm not an audiophile and I don't know how this $50 headset compares to expensive high-end headphones for sound quality but I actually used them to listen to music and thought the quality was very good; better than an expensive pair of Shure earphones I have. Listening to music is not the targeted use for this headset. It appears to be targeted to VOIP applications like Skype. For that it works well and I thought the sound quality was also very good. The inline controls work perfect. The plug and play installation is a snap. I wore them for many hours and they are very comfortable. After a short-period of time you can hardly tell you have them on. The 6-foot USB cable is adequate.\n\nOverall I have no problem recommending this headset and at $50 it is a very good value.",
            "title": "Very Good Value",
            "userName": "Book Fanatic"
        },
        {
            "date": "March 30, 2014",
            "rating": "4.0",
            "text": "bought for online courses using adobe meeting. Mic for talking stopped working after a week, sound still works but cannot talk",
            "title": "cheap for a reason",
            "userName": "Michael Lichman"
        },
        {
            "date": "March 26, 2014",
            "rating": "4.0",
            "text": "My primary use is for phone calls when working from home. The quality on my end and, I am told, on the other end is great. My only minor complaint is that after somewhere between two and three hours they start to feel a bit uncomfortable (too tight).",
            "title": "Excellent quality for phone calls",
            "userName": "DennisF6"
        },
        {
            "date": "March 24, 2014",
            "rating": "4.0",
            "text": "Cheap headsets can have tin like or distorted crackling audio. not this headset. People I talk to have no issues understanding me and I never have issues hearing others unless they have a poor quality headset.",
            "title": "Good quality & price",
            "userName": "Loadnabox"
        },
        {
            "date": "March 23, 2014",
            "rating": "5.0",
            "text": "This set works great. I had a set but the wire on one side of the headset broke and made one side of the set not play. I like the stereo effect and this set is light and fits well.My firsr one folded but it was awkward and this one also folds but doesn't come apart like the first one.\n\nI like the ability to changed the volume because the range is good and when on high it is very loud! I can even listen to the TV in a prone position because the ear pieces are flat and soft.\n\nI am very careful with it because I don't want a separation of the wires like my first one. I realize the wires are very fine and no doubt fragile. I have only used this one for a couple of months.",
            "title": "Plantronics Sudio 478 Stereo UST Headset (Audio-478)",
            "userName": "R. Thompson"
        },
        {
            "date": "March 15, 2014",
            "rating": "4.0",
            "text": "I use these once a week for my online class and it has a good microphone as well as headphones. I usually don't like headphones and prefer earphones, but these are comfortable and easy to wear without issues. Worth the buy.",
            "title": "Great for my online class",
            "userName": "quincy hence"
        },
        {
            "date": "February 22, 2014",
            "rating": "4.0",
            "text": "The most remarkable is the sound quality and clarity when using mic. The control buttons works fine with skype and others apps.",
            "title": "Remarkable Mic",
            "userName": "Victor Jose Cala"
        },
        {
            "date": "February 19, 2014",
            "rating": "5.0",
            "text": "So far this headset works well:\n- Has good voice quality\n- Has reasonable sound quality\n- Buttons on headset wire work (Volume up/down, mic mute and Skype phone call answer)\n- Is recognized and works with Skype\n\nCurrently Using:\n- Windows 7\n- Skype 5.0",
            "title": "Works as Expected",
            "userName": "Bookaholic"
        },
        {
            "date": "February 17, 2014",
            "rating": "4.0",
            "text": "Very clear sound & mic, can't easily switch to Computer speaker while it is plugged.\n\nI would have gave it 5 out of 5 if it was possible to use it with the PC Speaker",
            "title": "Very clear sound & mic",
            "userName": "amrsd"
        },
        {
            "date": "February 15, 2014",
            "rating": "5.0",
            "text": "The sound quality is very good. I haven't tested it personally, but everyone I speak with says it's clear as a bell. The headpiece is very comfortable.",
            "title": "Nice headset",
            "userName": "whozeshoes"
        },
        {
            "date": "February 14, 2014",
            "rating": "5.0",
            "text": "I only rarely use headsets but wanted one to be able to compactly fit in a bag when I'm traveling. I've used it with VoIP applications including Skype and the Avaya Softphone. Lightweight, compact and clear sounding. This is a winner.",
            "title": "Rarely use a headset, but when I do, it's this one",
            "userName": "BP"
        },
        {
            "date": "February 13, 2014",
            "rating": "4.0",
            "text": "I bought these for making phone calls with Google Voice. I use them also when watching videos on my laptop, they seem to work great so far.",
            "title": "These work great",
            "userName": "peterhz"
        },
        {
            "date": "February 10, 2014",
            "rating": "5.0",
            "text": "I bought this for my 11 year old, who plays Minecraft online and is on skype with his friends while doing it. He is happy with it. Good quality for the money.",
            "title": "Minecraft Player Loves it!",
            "userName": "Reka"
        },
        {
            "date": "February 9, 2014",
            "rating": "5.0",
            "text": "I genuinely like these headphones. I use them mostly for online courses I'm taking. They are four ounces lighter than my Logitech headphones and have a clearer sound, with no feedback that I can detect, so I don't have to turn the volume as high to understand what the professor is saying. I wore them for a two-hour lecture the other night and they didn't leave me with a headache, like the heavier Logitech did. There are separate volume increase and decrease buttons with raised signs that can easily be seen or felt with your finger tips, a mic on and off button, and a Skype call answering button, all within easy reach. The price is so reasonable that if they last only a year (no reason to expect they wouldn't last longer), I won't feel like I overspent.",
            "title": "A good value",
            "userName": "Pam Garden"
        },
        {
            "date": "February 8, 2014",
            "rating": "1.0",
            "text": "This is the most uncomfortable headset i have ever owned. Why? the top of the headset is FLAT - not curved.\nWhat a terrible design, do not buy this!",
            "title": "my head hurts",
            "userName": "Nano"
        },
        {
            "date": "February 7, 2014",
            "rating": "5.0",
            "text": "Product just as described. Arrived fast. Easy transaction. This headset offers clear quality sound. It is comfortable and light. In addition, it folds up in case you need to travel, plus comes with its own travel bag.",
            "title": "Great headset, good value",
            "userName": "abitbol, saralinda"
        },
        {
            "date": "February 7, 2014",
            "rating": "5.0",
            "text": "Sound is clear. Don't have to speak loudly for the mouthpiece to work well. Please with performance for the price",
            "title": "Works as advertised",
            "userName": "Ed in Texas"
        },
        {
            "date": "February 5, 2014",
            "rating": "5.0",
            "text": "I only had the headset for a couple of weeks. However, the price was great and the sound has been excellent.",
            "title": "Can not beat the price",
            "userName": "keith beasley"
        },
        {
            "date": "February 4, 2014",
            "rating": "5.0",
            "text": "Installed with no problems, and worked flawlessly. Took less than 15 minutes to install and test. would buy another if needed.",
            "title": "Love the headset",
            "userName": "paleface2222"
        },
        {
            "date": "February 3, 2014",
            "rating": "5.0",
            "text": "I bought one of these as an experiment and immediately sent it to my long distance GF. I bought another for myself. Talking to another person with a Skype certified headset is pretty much like being in the same room with them.\n\nYou need to download a driver for the Skype controls to work, but it's worth it. The volume control has big buttons and seems to work throughout Windows. I wish the phone button would initiate calls as well as end them and be a little programmable. I really felt like full ear headphones would be necessary, but enough background noise is muffled and the noise cancelling works seamlessly.\n\nOverall this is a light and suprisingly rugged headset with excellent headphone and mic performance.",
            "title": "Lightweight, high quality audio, clean modern look, good Skype control",
            "userName": "Ted Hancock"
        },
        {
            "date": "February 2, 2014",
            "rating": "1.0",
            "text": "They arrived, I plugged them in for the grad school meeting I needed to present during, and the headphone portion would not function at all. I bought a more expensive model, thinking it would have good quality, not no quality. So disappointed. This is the first mic w/headphones I've purchased, so I guess it was a bad first guess.",
            "title": "NOt working",
            "userName": "La Fa"
        },
        {
            "date": "February 1, 2014",
            "rating": "4.0",
            "text": "It did a great job and at a reasonable price. Price does not always determine quality and I was happy with the purchase.",
            "title": "Worked great!",
            "userName": "Jack C."
        },
        {
            "date": "January 31, 2014",
            "rating": "1.0",
            "text": "Have had it for 3 weeks. Today the Microphone stopped working. Not sure if I can return this to Amazon.",
            "title": "Mic Stopped working in 3 week",
            "userName": "SamShopper"
        },
        {
            "date": "January 29, 2014",
            "rating": "5.0",
            "text": "This headset improved the program's ability to convert speaking to text. The headset which came with Dragon and a set of Altecs I had both made using the program painful.\n\nThis headset is better for audio conference calls and dictation programs. Music quality is flat in my opinion.",
            "title": "Perfect for Dragon Naturally Speaking",
            "userName": "Christopher Watson"
        },
        {
            "date": "January 28, 2014",
            "rating": "5.0",
            "text": "Simple, perfect, works on PC, Mac, USB tablets. Good sound, Mic is solid, controls are handy. Absolutely works like you'd expect.",
            "title": "Simple, Perfect",
            "userName": "Amazon Customer \"LABMONKEY\""
        },
        {
            "date": "January 25, 2014",
            "rating": "1.0",
            "text": "Mine might just be defective, but I'm sending it back for several reasons. I can't imagine why this has such great reviews - and I like Plantronics. I have the phone headset - a pretty high-end one, and I love it. It's about 10 years old and has never failed me and I use it all day on coaching calls sometimes.\n\nThis headset I bought for Google+ HOA sessions. I've used it twice - the first time I had about 10 minutes of light static during a 30 min. session. Yesterday I wore it for an hour - halfway through my training session I started getting static, then only the ears were working, no one was able to hear me. I had to finish the session using the built-in mic on the MacBook Pro - which does not cut out the background noise.\n\nBy the time the one hour was over, my ears were in pain! This thing was not built for hour - long calls.\n\nLast night I bought the Logitech 540 - for about $15 more - but it sounds great, sound is great, and it's comfortable - I used it for 90 minutes of recording this morning and love it.",
            "title": "Static and the Mic Quit Right in the Middle of Live Training - and...",
            "userName": "David H. Stelzl \"dhs\""
        },
        {
            "date": "January 14, 2014",
            "rating": "5.0",
            "text": "I chose this headset because of the wonderful reviews it has received by other reviewers. And I'm in agreement. They are very good. Audio is fantastic for Skype calls, webinars, and just listening to music during work. The mic folds up and away when not in use, and people I call on Skype say I sound loud and clear.",
            "title": "Great headset",
            "userName": "Elena Baralt"
        },
        {
            "date": "January 13, 2014",
            "rating": "5.0",
            "text": "bought this for my son for Christmas and so far he hasn't complained so he must really like them.He loves that he can't hear any outside noise.I hate it because he can't hear me yelling for him LOL.",
            "title": "Headset",
            "userName": "Susan Ibarra"
        },
        {
            "date": "January 12, 2014",
            "rating": "5.0",
            "text": "I got these for my husband and he loves them. He said they are great for travel and uses them for his Dragon Speak on his Mac.",
            "title": "Gift",
            "userName": "Christa"
        },
        {
            "date": "January 12, 2014",
            "rating": "5.0",
            "text": "Love this set! I bought these to do Google Hangouts and am now doing Screencasts and it works beautifully. Totally worth buying!",
            "title": "Great for Screencasting and Google Hangouts!",
            "userName": "Gini Wozny"
        },
        {
            "date": "January 10, 2014",
            "rating": "5.0",
            "text": "Excellent choice for using the Rosetta Stone software. Microphone is accurate enough to be heard clearly with the voice recognition software. Microphone is reversable so can be used for either right or left ear.",
            "title": "Headphones work as described",
            "userName": "Danny A. White"
        },
        {
            "date": "January 10, 2014",
            "rating": "4.0",
            "text": "Reasons for my 5 star rating.\n1. Work beautifully on Skype, and Microsoft Lync\n2. volume and mute controls at your fingertips\n3. Windows loaded the driver automatically\n4. I have now control over headsets as the speaker/mic combo or native windows speaker/mic choice\n5. Very lightweight. They fold like reading glasses and unit comes with a nice velvet bag. easy to transport.\n\nOverall a 5 star rating without any hesitation.",
            "title": "Very nice set of headsets. Must have for VOIP conference calls and meetings",
            "userName": "Sanjay Date"
        },
        {
            "date": "January 7, 2014",
            "rating": "5.0",
            "text": "We bought this solely to replace the headset that came with DNS. What a difference in recognition accuracy! Windows 7 home / DNS 12.",
            "title": "Fantastic for Dragon Naturally Speaking",
            "userName": "Amazon Customer"
        },
        {
            "date": "December 15, 2013",
            "rating": "5.0",
            "text": "This was the perfect headset that I needed for use with the Rosetta Stone. Well-built for everyday use. Sound quality was better than expected and the fit was quite comfortable. Convenience of the on-cord action button.",
            "title": "Excellent sound quality",
            "userName": "H. Lee \"zman\""
        },
        {
            "date": "December 6, 2013",
            "rating": "4.0",
            "text": "The head set is pretty good, you get what you pay for. The headphones dosent look durable because its so skinny so it will probally break if your rough with them. Also they kinda squeeze your head when you wear them for a while. But the sound and mic quality is great for the price! I recomend it to who want cheap but really good head set!",
            "title": "There awesome, just has some minor problems.",
            "userName": "Kira"
        },
        {
            "date": "December 6, 2013",
            "rating": "4.0",
            "text": "Overall a pretty decent headset, The sound quality is crisp and comes through loud and clear. The earpads are also warm for the wintertime.",
            "title": "Pretty good",
            "userName": "David S. Fox"
        },
        {
            "date": "December 5, 2013",
            "rating": "5.0",
            "text": "These have worked very well, clarity is excellent. mute functions are useful for large conference calls. I would buy them again",
            "title": "These Headphones are very clear and make skype calling a pleasure",
            "userName": "Mark Bateman"
        },
        {
            "date": "December 1, 2013",
            "rating": "2.0",
            "text": "not the best sound, others can hear me only some of the time and I like the call to be loud and clear, I can't make this go loud enough to hear everyone on a conference call",
            "title": "doesn't go loud enough for me",
            "userName": "beanbabe"
        },
        {
            "date": "November 22, 2013",
            "rating": "5.0",
            "text": "I liked the first one so much I bought one for work and one for home. My son also liked it because of the cord length which makes it easier for gaming so I may end up purchasing a third. Travels very nicely.",
            "title": "Wonderful product for the price.",
            "userName": "A. Trujillo"
        },
        {
            "date": "November 17, 2013",
            "rating": "5.0",
            "text": "I have so many plantronics head sets, they all have been excellent. this is no exception. The more you spend the nicer they get, but the sound is great on any model.",
            "title": "very good",
            "userName": "Ghango \"Gang\""
        },
        {
            "date": "November 17, 2013",
            "rating": "5.0",
            "text": "The headset was exactly what I was looking for. Works great for VOIP. Light, good sound quality and flexible drivers.",
            "title": "Just Right",
            "userName": "Significent"
        },
        {
            "date": "November 13, 2013",
            "rating": "4.0",
            "text": "I use this for an online class that I teach and they work great. Audio quality is excellent. I'm going to buy a similar pair but with bluetooth connectivity soon!",
            "title": "Great Audio Quality",
            "userName": "David Tweed"
        },
        {
            "date": "November 12, 2013",
            "rating": "5.0",
            "text": "After struggling with more expensive headset/headphone combinations for years (which all fell apart or broke despite very light use), I just bit the bullet and bought the highly rated, inexpensive, Plantronics Audio 478 headset. I'm glad I did. It's been reliable, the sound quality is fantastic, it's sturdy, and even if it did break, it was cheap enough that I wouldn't feel the pinch.\n\nIf your main headset need is skype, voice conferencing, or light gaming, this is a great option.",
            "title": "A great low-cost headset.",
            "userName": "M. Cantor"
        },
        {
            "date": "November 10, 2013",
            "rating": "5.0",
            "text": "Excellent Skype-compatible headset. Call answering button and mute are very useful. Very comfortable, even when worn for several hours. Sound quality is fine for speech, but not exactly HiFi for music. Very good product.",
            "title": "Great price, nice features, works well",
            "userName": "Dawn Tarin"
        },
        {
            "date": "November 10, 2013",
            "rating": "4.0",
            "text": "It is sleek and light-weight and folds nicely to fit into carry-on. Volume control device gets a bit warm when used for long periods.",
            "title": "Very good product",
            "userName": "Oscar Spencer"
        },
        {
            "date": "November 8, 2013",
            "rating": "4.0",
            "text": "Excellent quality and fit. The only knock I have is the cord length and no cord clip. If you only use a laptop, this is the product you want. The cord length is perfect and won't get in your way. If you also us a PC, the cord is a little short. Due to the size of the control block for volume and mute a cord clip to attach to your clothing would be useful.\nYou will not find a better business headset at this price and I have had dozens.",
            "title": "Best Quality at this price, Cord is a bit short",
            "userName": "KDK"
        },
        {
            "date": "November 6, 2013",
            "rating": "5.0",
            "text": "Great Price...Got exactly what I expected in the quality department...performs as advertised...ordered two headsets...they came in the mail on the date promised...have used them now for 4 months without any problem....Not sure what else a consumer might expect.",
            "title": "Low Cost Headset for Skype type application--Great Deal",
            "userName": "lawboss"
        },
        {
            "date": "November 4, 2013",
            "rating": "5.0",
            "text": "I spend many hours a day on conference calls from my home office. For a couple of years my carrier of choice has been Google Voice and until I bought this headset, I've depended on the mic and speakers in my Macbook Air.\n\nThe Plantronics is a huge improvement. The headset is light and comfortable enough to wear for extended periods without fatigue or discomfort. The audio quality is as good as one would ever need for voice calls and much better than expected for music. And I'm told that my voice is coming through more clearly and consistently than ever. The inline volume control / mute button is handy, too, and the headset is immediately recognized by the Macbook as soon as it's plugged in.\n\nI haven't worked with other headsets so I can't say how well this one compares. I can say that I'm completely satisfied with the Plantronics as well as Amazon's service, which was exemplary as always.",
            "title": "Big step up for home office - highly recommended!",
            "userName": "Hozay"
        },
        {
            "date": "November 3, 2013",
            "rating": "3.0",
            "text": "This headset definitely works, but it's not that comfy. It sits a bit odd around my ears, and I find they hurt if I wear it too long. Which is annoying, since I bought it to go with DragonSpeak and will therefore be using this a lot. The sound quality is solid, though, and the volume/answer buttons on the cable work nicely. Just wish the headphones themselves were more comfortable.",
            "title": "Not very comfortable",
            "userName": "Sarah Montee"
        },
        {
            "date": "October 30, 2013",
            "rating": "5.0",
            "text": "I purchased this to record audio to accompany slides for an online class I'm teaching, and this has done a good job so far. Other products I looked at had installation disks, weren't USB compatible, or were just plain expensive; this one is plug and play and meets my requirements. The headset is lightweight, provides decent audio, and the mic is easy to position and use. Since I use a laptop and tend to record on the go, the collapsing feature was a definite plus.\n\nTo be fair, I'm sure there are better headsets out there - I suppose if I were an audiophile or needed to record in extremely windy environments then I'd be less than thrilled with this product. But for my needs, this is a great fit!",
            "title": "Decent Recording and Audio",
            "userName": "That Fellow Who Buys Things"
        },
        {
            "date": "October 29, 2013",
            "rating": "4.0",
            "text": "I'm not a complete audiophile and I'm definitely not snobby about it.\n\nThat said, these headphones work great in the office for making calls through VOIP. The voice clarity is good and not too bassy. The mic extends and retracts nicely.\n\nMy first set I received became defective after a couple months, but Plantronics support was extremely friendly and sent me a new pair within a couple days.\n\nAs for listening to music, I enjoy using Grado's at home.\nFor the price, it's actually a decent set of cans that are semi open back. It has decent bass response and very little distortion. The balance is a bit off, but overall, it still sounds great compared to any other headphones in this price range.",
            "title": "Decent headphones that can please some audiophiles",
            "userName": "Josi Kim"
        },
        {
            "date": "October 21, 2013",
            "rating": "4.0",
            "text": "Quality is great...comes with a travel sack and headset folds up nice and compact for travel. Mic is clear and sound is great. Recommend for players of online gaming.",
            "title": "amazing headset",
            "userName": "Rd3185"
        },
        {
            "date": "October 16, 2013",
            "rating": "4.0",
            "text": "I loved everything about this headset. However, after I downloaded and installed the \"software for Plantronics Audio(tm) 478/628/648 - Skype Certified Headsets\" so that I could use that button to answer/end Skype calls and then plugged in the USB, I saw a notice that Skype will stop supporting this feature in December 2013 ([...] It was a real bummer! So any of you who want to buy this headset because you would like to use that button, keep this in mind.",
            "title": "The answer/end Skype calls button to be retired in 12/2013!",
            "userName": "Akhara"
        },
        {
            "date": "October 15, 2013",
            "rating": "5.0",
            "text": "We picked up a bunch of these for Skype and Video voice over in the marketing office. Whether we're listening to music, on a webinar, or recording voice overs for video, the quality is excellent. If you're trying to avoid a noisy office by listening to music while working, it is perfect. Quality is fabulous! You will notice others using headsets to be of lesser quality.",
            "title": "Sound quality is amazing!",
            "userName": "Chad O'Mealy"
        },
        {
            "date": "October 14, 2013",
            "rating": "5.0",
            "text": "It was great for the price.. sometime you can hear a little back noise but no big deal. So far for what I need it works perfect... i will like for next time buy a wireless one but i could not get an affordable one with good reviews, so i ma happy with them.",
            "title": "great for price",
            "userName": "Juan"
        },
        {
            "date": "October 14, 2013",
            "rating": "5.0",
            "text": "I needed this headset for online job training and it works perfect. No issues at all. It has a nice volume and mute control on the cord. Worked well integrating automatically with my Adobe training courses.",
            "title": "Excellent Headset",
            "userName": "Matthew Dobeck \"Matt\""
        },
        {
            "date": "October 11, 2013",
            "rating": "4.0",
            "text": "Works as advertised and audio quality is decent. Seems sturdy enough, although I worry that the plastic hinges to collapse these headphones will eventually crack.\n\nOverall a fine USB headset.",
            "title": "I'm pretty happy with this headset",
            "userName": "Amazon Customer \"Tree Hugger\""
        },
        {
            "date": "October 11, 2013",
            "rating": "4.0",
            "text": "I bought this to call out and answer my office phone from my home. It was easy to install and the application using it found it with no trouble. I was albe to configure it easily and within minutes I was able to make a phone call to my cell phone using this device and our application. Then I called my office phone from my cell and was able to easily answer the call and talk. The hands-free operation is an imperative in my work and it has proved to function well.",
            "title": "Seems to be a good buy for the money, easy to install and use.",
            "userName": "Pete M"
        },
        {
            "date": "October 10, 2013",
            "rating": "4.0",
            "text": "Good set. Nothing bad to say about it. Got it for the Skype compatibility, which is it's main use, but is good for music as well. I recommend it.",
            "title": "Works good.",
            "userName": "DRT"
        },
        {
            "date": "October 8, 2013",
            "rating": "5.0",
            "text": "I have used other headphones but these have a really nice sound quality for communication and they are comfortable for all day use. I can not say how they would work for gaming because they are not designed for that. For clear communication for work I am not disappointed.",
            "title": "Sound quality is great",
            "userName": "Christina M Hoag"
        },
        {
            "date": "October 6, 2013",
            "rating": "5.0",
            "text": "I use this headset with a Cisco VOIP solution, folks tell me that the sound quality coming through is excellent. I really appreciate it's light weight, the skype call ./ hang up buttons are of no use to me, I also have a Plantronics wireless head set model 955, the sound quality is better in the 478 than in the wireless 955.",
            "title": "Very nice, excellent sound quality...",
            "userName": "Marc Bassinne"
        },
        {
            "date": "October 5, 2013",
            "rating": "4.0",
            "text": "The USB mic is better than non-USB mics. The speakers are great. Vol control great. Folding design is great. Would buy again.",
            "title": "Nearly perfect.  Great value.",
            "userName": "KEVIN T HANKINS"
        },
        {
            "date": "October 2, 2013",
            "rating": "5.0",
            "text": "The headset is comfortable with great sound. I like the inline volume control rather than trying to control volume on the device I am using.",
            "title": "Great sound.",
            "userName": "Alyce"
        },
        {
            "date": "October 2, 2013",
            "rating": "4.0",
            "text": "I bought this headset based on its Amazon reviews and price. I finally decided on this device against the Logitech Wireless H600/H800 line of headsets due to my previous experience with wireless headsets. I needed the headset for VOIP calls at my office; this headset and the Telephone app on the mac replaced my bulky SIP phone. Since wireless devices I used prior to purchasing this headset tended to produce so much latency that it made conversations unbearable, I opted for a cheap USB set.\n\nThe build quality is cheap and feels like it could easily break. The design of the headset is unassuming and simple. The cable that extends from both sides of the headset are cumbersome and could be relegated to a single side, but I'm assuming this somehow has lowered the cost of manufacturing. It elegantly folds away, which was also a consideration. On my head, it feels comfortable enough to make calls and have conversations without too much discomfort. It doesn't feel good, but it doesn't feel bad enough that I regret getting the headset. I don't get a chance to use the buttons as they do not work with the Telephone app that I use, but I have pushed them to see anyway. Again, the buttons also feel very cheap and loose.\n\nAll in all, this is a very affordable headset and worth the low price for casual phone conversations on VOIP or Skype. It's not the best design and not meant for ultimate comfort, but it does it's job with little to no latency on calls. Since purchasing I haven't had echoes or delayed voice during conversations.\n\nNotable features include:\n\n Headset folds down and can be easily tucked away\n USB connected\n Quick buttons for use with some applications\n\nLets weigh the pros and cons of this device.\n\nPros:\n\n Good as an entry-level and casual-use headset\n Low latency USB connection\n Affordable price\n Decent fit and not too uncomfortable\n Tucks away with the foldable design\n\nCons\n\n Cheap plastic feel and boring design\n Wires extending from both sides is cumbersome\n Not ideal for comfort and extended use\n Tied down to range of wired cable\n\nFor $25 (at time of writing) and the very light use it gets at work, I think this is an excellent headset for casual VOIP usage. I wouldn't use these for gaming or long phone conversations.",
            "title": "Plantronics Audio 478 USB Headset Review",
            "userName": "westurner \"wMaurice\""
        },
        {
            "date": "October 1, 2013",
            "rating": "5.0",
            "text": "I do lots of online meetings with Skype and GoToMeeting both at home and at coffeeshops. My big headset did not work for me... did not fit in my \"man bag.\" My earbuds with inline mic fit the bag but sound quality was terrible in a noisy Starbucks. The Plantronics Audio 478 Stereo USB Headset (Audio 478) really solves the problem. The price is right at USD 25.00. They fold into a neat little package that rides well in my Timbuk2 bag. People have complimented me on the sound quality. And background noise is mostly cancelled. Recommended.",
            "title": "Perfect for my needs and budget",
            "userName": "James R. Trott \"just a normal guy\""
        },
        {
            "date": "September 21, 2013",
            "rating": "5.0",
            "text": "I work as a tutor teaching English to students over Skype which requires me to wear a headset for several hours a day. This headset is so comfortable and the sound is very clear. My clients on the other side of the world sound like they're in the next room.",
            "title": "Fantastic product. Fantastic price.",
            "userName": "tneal77"
        },
        {
            "date": "September 18, 2013",
            "rating": "5.0",
            "text": "The ergonomics of the phone are strange considering the advancements in headphone design. However, I use the headphones /mic with Lync for my work laptop and the sound and mic work perfectly. No hissing noise and people can hear me fine.",
            "title": "Works for what I need",
            "userName": "Roger J Clayton"
        },
        {
            "date": "September 7, 2013",
            "rating": "5.0",
            "text": "I love this headset. I've had it for a few months with no problems. Clear sound and mic works great! Easy to connect....even a child can do it.",
            "title": "Great Quality!",
            "userName": "Tasia washington"
        },
        {
            "date": "September 6, 2013",
            "rating": "5.0",
            "text": "I purchased this headset because my microphone port stopped working on my computer - the USB helps with that, obviously. The headphones provide clear audio (for speaking - I haven't tried them with music or anything like that) and others on calls with me have told me that they can hear me very clearly. (I did ask them if they could hear me okay - it wasn't a spur-of-the-moment exclamation!)\n\nI'd recommend this product. At the price, it's a great value and it's worked for my needs very well. I haven't owned it long or used it often, so I'm not sure how well it holds up. But right now, I'm very happy with this purchase.",
            "title": "Clear Audio From Headphones AND Mic",
            "userName": "Alyson Lex"
        },
        {
            "date": "September 5, 2013",
            "rating": "5.0",
            "text": "Works great for me on both Sametime and Skype. Sound quality is good and I it folds down well for easy transport.",
            "title": "No complaints.",
            "userName": "How"
        },
        {
            "date": "August 25, 2013",
            "rating": "5.0",
            "text": "Great sound for calls and even for listening music con your laptop or desktop computer., fully compatible with Cisco IP Communicator. I Strongly recommend this product!",
            "title": "Great headset!",
            "userName": "Joe Benitez"
        },
        {
            "date": "August 24, 2013",
            "rating": "4.0",
            "text": "I bought this for business Skype calls and it hasn't disappointed. I use it every day for UK/USA communication and it's is spot on.",
            "title": "Great product, easy and clear sound",
            "userName": "Robert Bodill"
        },
        {
            "date": "August 21, 2013",
            "rating": "4.0",
            "text": "Good product, I use it for Rosetta Stone. It works really good, sounds really good and had a nice length to the cord. The foldable option to them is great too!",
            "title": "Good sound easy to use",
            "userName": "N. Weier"
        },
        {
            "date": "August 16, 2013",
            "rating": "4.0",
            "text": "I bought this headset to replace a Logitech headset that started to fall apart after a year. I've had the Plantronics headset for about six months. It's a very nice headset if you accept its limitations. I work from home as a programmer.\n\nI use the headset for listening to music and for Skype teleconferences. For listening to music, it's pretty good, but not spectacular. Good enough when listening to music is your secondary focus. It provides very little isolation from external noises in the room, so it's probably not so good in a noisy environment.\n\nTeleconferencing performance is very good. I come through very clearly with no noise (in a quiet room). The voice quality is better than my landline. The fit and comfort is good enough to wear it for a few hours at a stretch. I have a large head and the headset can be adjusted for a good fit.\n\nLike all headsets I have seen, it looks very fragile. I'd buy a hard case if I planned to do much travelling with it. Mine stays at home, hanging on my monitor when I'm not using it.",
            "title": "Good for the price",
            "userName": "Wild Bill"
        },
        {
            "date": "July 25, 2013",
            "rating": "5.0",
            "text": "Just pluggin and answer a couple questions and you are able to use this product on your pc computer, I am running windows 8 on this system so do not know how it works on other systems. Unplug it and I am back to regular speakers, provides clear sound when talking to others people via skype which I use on all of my calling whether it be business or personal.",
            "title": "Simple to use / Great Value",
            "userName": "Gary D. Golden"
        },
        {
            "date": "July 20, 2013",
            "rating": "4.0",
            "text": "i bought this to use on my weekly multiple skype conference group calls. it was exactly what i was looking for. the headset fits nicely but goes get a little warm around the ears after awhile. it works seamlessly with the skype application. however on the Mac, i can't answer the calls directly from the headset nor can i initiate a call/hangup either. everything has to be done via the skype application. however i do use the volume controls directly on the headset control. for the price, everything was really clear and audible.",
            "title": "nice headset for the price",
            "userName": "WPM"
        },
        {
            "date": "June 30, 2013",
            "rating": "3.0",
            "text": "The headset works well for what I am doing -- recording lessons. But one of the ear phones went out after using it a couple of times. Now, I only get sound from one side...disappointing...",
            "title": "Lost one side of headset right away",
            "userName": "Linda Marcot"
        },
        {
            "date": "June 17, 2013",
            "rating": "4.0",
            "text": "This is really a five-star quality headset, but I had to give it four stars because there's no volume control and it a claims it can be used to make Skype calls, no real instruction comes with the headset regarding the use of the buttons on making calls and the use on Skype is not logically intuitive. I downloaded some software from the Plantronics site, which comes with the same problem: no clear instruction on how to use it. As a result my use is limited to the mute button because I cannot make or receive calls on Skype without more explanation/instructions. Although the functionality must exist I do find this limitation a little annoying. I'm also left wondering whether it would work to automatically answer and make calls on RingCentral or Google voice.",
            "title": "I use it for Dragon Naturally",
            "userName": "Dennis"
        },
        {
            "date": "June 7, 2013",
            "rating": "3.0",
            "text": "Though this headset claims to work with MAC OSX platforms, I had a hard time getting it installed and functioning. After hours on their website and downloading various drivers, searching message boards for solutions and toggling settings on my MAC, I just had to give up and return it. It is Skype approved, which is what I needed it for, and if it functions the way it claims, I'm sure it's a great set. I really wanted it to work but didn't have the stamina to continue to try to track down a solution. It seems to be very plug and play on PCs so I'm hoping PC users have better luck.",
            "title": "Great headset but had problems with MAC",
            "userName": "Jennifer Corum"
        },
        {
            "date": "June 5, 2013",
            "rating": "5.0",
            "text": "I had been using a standalone mic and my stereo speakers for skype conferencing and when I turned on the a/c in the room, everyone heard it like I was in a factory, so I caved and bought a headset. A friend loved this model so I went for it and I'm totally satisfied.\n\nThese are not audiophile headphones, but for speech they're great, especially light on the ears such that I often forget to take the headset off when I finish a call.\n\nThe volume control on the cord is a plus.\n\nTotally satisfied.",
            "title": "Works great!",
            "userName": "Jack F. \"Jack F.\""
        },
        {
            "date": "May 30, 2013",
            "rating": "5.0",
            "text": "I plug these into my MacBook and they work flawlessly. The sound is great and the microphone picks me up and doesn't pick up a lot of the surrounding noise. Definitely recommended.",
            "title": "Works Great",
            "userName": "Jeff S"
        },
        {
            "date": "May 24, 2013",
            "rating": "4.0",
            "text": "This is a great headset for the price! Only used it for a month, but no complaints:) crystal clear sound quality and mic function .",
            "title": "Great headset!",
            "userName": "Zen"
        },
        {
            "date": "May 23, 2013",
            "rating": "5.0",
            "text": "I bought this for a friend because we would have group Skype calls and there would always be so much interference and background noise with her old mic. For the price, this is great. We can hear her great. Wasn't expecting such great clarity from them. She loves them, lightweight and comfortable.",
            "title": "Bought this for a Friend",
            "userName": "Chris G"
        },
        {
            "date": "May 16, 2013",
            "rating": "4.0",
            "text": "The folding design is great for storage. The headphones are comfy for extended wear and the mic works well, I can always be heard clearly. Overall, it was a good purchase.",
            "title": "Good design",
            "userName": "Amazon Customer"
        },
        {
            "date": "May 10, 2013",
            "rating": "3.0",
            "text": "i have dragon and wanted to use it for that purpose but it will only work if you talk loud and there for it will get just an ok from me",
            "title": "they are ok",
            "userName": "Tedmund Smith"
        },
        {
            "date": "April 23, 2013",
            "rating": "4.0",
            "text": "Sound quality is very good for the price. Easy installation on Windows 7. Convenient controls on the cable. A bit of a problem staying properly on my head when wearing it for a while. Overall a good buy.",
            "title": "Good buy",
            "userName": "Ben Cisco"
        },
        {
            "date": "April 22, 2013",
            "rating": "5.0",
            "text": "This is my second Plantronics USB headset. The first, a 470, still works, but the USB dongle it came with seems to now have problems with the mic input portion. I tested that headset with the dongle and it worked fine. I could get one of those Syba USB audio interfaces to replace it, but this gave me an excuse to have a second on hand.\n\nBack to the 478. Like the 470, everyone I talk to says the incoming audio quality on their side is fantastic. Little to no background noise and most describe it as sounding like I'm in an audio booth. The sound quality through the earphones portion is surprisingly good with music. I wasn't buying it for that purpose, but it means I don't have to switch headphones at the office when transitioning between calls and listening to tunes. Not a ton of low end, but much better quality than I was hoping for.\n\nI use this with Macs without a problem. Nothing to install though there is a Systems Preference widget you can get from their website. The volume and mute controls work, but alas, the answer button is only supported on PC's. That seems odd to me that that functionality isn't carried over. Hopefully with the recent announcement by Logitech that they will be supporting all their gaming devices fully on OS X, Plantronics will find a way to do the same.\n\nFor conferencing and light music listening, this headset is really hard to beat, especially at its price point. It doesn't have a super robust build, but my 470 (minus the dongle) has survived just fine for a couple of years so I expect this will as well. The fold flat feature is nice for transport and should help.",
            "title": "Love Plantronics' USB headsets",
            "userName": "Trevor \"Rotorhead\""
        },
        {
            "date": "March 11, 2013",
            "rating": "5.0",
            "text": "This headset has good sound quality, microphone is good as well (I've been asking different people I skype'd). It's perfect for Skype, but I also use them to listen to music, and I think the sound is fine. Worth its money.",
            "title": "good",
            "userName": "KuVaNi"
        },
        {
            "date": "February 10, 2013",
            "rating": "5.0",
            "text": "My daughter is using this headset for some school projects and also on line gaming. She finds them quite comfortable and there was no trouble for her to make them work in her iMac right-o-way.",
            "title": "Great Purchase",
            "userName": "JOSE OSVALDO MANCINI"
        },
        {
            "date": "February 6, 2013",
            "rating": "4.0",
            "text": "Does not work on Windows Vista! The item has really good sound quality when I used it with my Windows 7 laptop, but when I tried to use it on my Vista desktop, I continually got the blue screen of death causing my computer to reboot itself. I tried it on another port and did not get the blue screen, but it was not being recognized by Skype or Windows. After looking for and loading drivers, deleting drivers and Skype, reloading Skype, reading Plantronics website, I finally called Plantronics support who told me this headset is not supported by Vista (not anywhere on their site at the time of writing)\nInitially I was told to just buy another one that would work, however they finally agreed to do a replacement with another model that would work. I have used many Plantronics items over the last 10 years as I work from home, including CT10 and 12, cordless and wired headsets, and this is the first time I have had an issue, and they resolved it. Also, it works very well with Windows 7.",
            "title": "Great but ...",
            "userName": "ALG"
        },
        {
            "date": "December 29, 2012",
            "rating": "5.0",
            "text": "I use this headset on my computer every day for programs like Skype and Ventrilo. I have also used it for voice recognition under Windows 7 with very good results.",
            "title": "Great Sound and Good Mic",
            "userName": "Psi Star"
        },
        {
            "date": "December 6, 2012",
            "rating": "4.0",
            "text": "I find this headset great for a few internet calls a day. I use it for hourly consulting calls and was looking to save money on calls. I also use it for personal calls while traveling internationally. I like the quality of the sound and comfort level and setup wasn't too difficult.\n\nIt was helpful for me when another reviewer mentioned how to use it, and what it works with, so I'll add to that. I use it with google talk and skype. To set it up you should go to plantronics.com/audio to install the driver for mac or pc for \"audio 478\" if you search on their website. For my mac I used the download on the left of the screen called \"plantronics spokes software\". You then have to activate your internet chat service to recognize the headset. You can login to skype and go to preferences > audio and/or your google account > settings > chat and tell it to recognize the microphone and speakers on the headset. It should be in a dropdown likely with your default computer settings/hardware.\n\nOverall I'm very satisfied with this purchase and it's cheaper on amazon that through plantronics so that isn't bad either.",
            "title": "Super useful and easy to use",
            "userName": "Roxanne Banta \"roxbanta\""
        },
        {
            "date": "December 5, 2012",
            "rating": "4.0",
            "text": "This product folds as compact as possible for a USB/over the head device. I really like the length and flexiblity of the mic/boon. The body gear works for me, small frame women. It may be too tight for male or larger size head diameters. I do not care for in-the-ear devices and always use over the head. This product produces high quality recordings for audio engineers. I go through headsets like most people go through socks. This device is better than most other products in this price range.",
            "title": "Plantronics 478 headset perfect for business travel",
            "userName": "Starlite"
        },
        {
            "date": "August 4, 2012",
            "rating": "5.0",
            "text": "* I bought these to use with my work computer's \"softphone\" (Cisco IP Communicator) which lets me use my work phone while working at home; pretty slick tech!\n* I have a big noggin, and these feel comfortable; the nice big ear pads rest comfortably against my ears and stay in place.\n* I am now a big fan of binaural headsets (speakers on both ears) as it really enhances sound quality (the person on the other end is speaking inside your head, not off to the side).\n* callers reported that the quality of my voice was excellent.\n* I did not download any software for it, but Windows 7 recognized it and it was ready to go within seconds.\n* as a USB device that shows up as a separate sound device, you can do a cool thing in at last *my* phone software: I can set it to be the headset for phone calls, but still have the phone ring through the computer speakers: as a result, I don't have to wear the headset all the time, just when I am taking or making a call. With a regular plug headset, it's like earphones: once you plug them in, the speakers stop working.\n* The only negative I found is that the microphone picked up the wind noise from a fan I was using (that was blowing right at me from several feet away); I wish they had included a foam windscreen.\n* Someone else had mentioned that the foam pads were not removable/replaceable and had suggested getting a set of covers, which I did: and when trying to stretch the new covers over them, I discovered they *are* removable :-), they are just installed so nicely that they don't look like it. So now I'm saving the other set Plantronics Ear Cushions (1-Pair) for if and when these go bad.",
            "title": "comfortable, good sound quality",
            "userName": "Jeffrey Gillman"
        },
        {
            "date": "July 30, 2012",
            "rating": "5.0",
            "text": "Use this while playing games. I hate talking on online games so the mute button is nice. Crystal clear sound, works seemlessly with my Skype. Price makes it a good deal.",
            "title": "Haven't found a complant",
            "userName": "TXdust \"Gabe\""
        },
        {
            "date": "January 19, 2012",
            "rating": "5.0",
            "text": "I love the Plantronics .Audio 478 Stereo USB Headset. Plain and simple. Here's why:\n\n1. Very comfortable, soft, over-the-ear headphone, just snug enough to stay in place, just loose enough to allow for some airflow and plenty of comfort.\n\n2. Excellent mic for the money! I've used these on Skype and I was told I sounded great. I did the Skype audio test run and heard my own test-recorded voice played back to me and it did really sound good. The midrange was great, the low range was great, and either I didn't have too many highs in my voice or they were filtered out to make the voice sound clean and pure. Great job, Plantronics!\n\n3. Totally plug and play on my MacBook. All I had to do was go into System Preferences, go to the input and output controls, and select the Plantronics unit for each and I was ready to go! Full compatibility and functionality on the first shot, no drivers to download.\n\n4. Easy inline controls, far enough down the cord to reach and see and adjust easily. Controls: Volume up, volume down, mute, and a call button (ask/answer call).\n\n5. The whole unit folds down neatly into about the size of a pair of eyeglasses, and a travel pouch is provided to keep the headset safe inside your backpack or computer bag.\n\nHighly recommended.",
            "title": "Great sound coming and going",
            "userName": "J. Friedman \"J-F\""
        },
        {
            "date": "January 1, 2012",
            "rating": "5.0",
            "text": "We routinely use VOIP for phone service so these were perfect for our needs. This is a nice headset - nothing fancy but gets the job done right. Inteded for use as a USB stereo headset with voip capacity including skype, this no nonsense set sound good and are simple to use. The inline controls are very intuitive as well as comfortable - volume and mute are easy to use. The folding might be nice but isn't really something that makes or breaks the set...just be aware, they don't fold that much. The overall footprint is still rather large. They will fold enough to tuck away nicely on the desk but don't expect a lot of space savings. Sound quality is good and distractions are kept to a minimum.\n\nNegatives:\nSize...these seem large over the head area even after some adjustment they had a tendency to drift a bit now and then. Nothing substantial but enough to be noticed. My spouse did not experience this issue whatsoever so it may depend upon hairstyle and head shape.\nCan't plug into phone...the other disappointment was the inability to plug into a standard phone. Many VOIP providers allow traditional phone sets to extend the use of the phone rather than having to sit in front of the computer and we were hoping these would allow plugging into a phone. Unfortunately, that is not possible due to the exclusive use of the USB. Since these are designed as/for USB/computer use no points were docked but really wish there had been dual options...these would have been nearly perfect with both plugin types.",
            "title": "Work very well for intended purpose.",
            "userName": "javajunki"
        },
        {
            "date": "October 27, 2013",
            "rating": "2.0",
            "text": "Here are the issues:\n\n1) The mute button has a tiny dim light backlighting an ornate little microphone silhouette with a slash through it (indicating mute) that is not easily visible when viewed at an angle. Compounding the problem is the fact that it is located along with the other buttons at chest level, which is the logical location for it, however the poor visibility of the light impels one to hold it up to see it. It is so close to the head that when I look at it I am nearly cross eyed and it takes a moment to focus. I find myself pulling the wire taut and thereby pulling on the headset to see the dim little light. Perhaps a younger person would not have these issues. Note to designer: After the speakers and the microphone, the mute button is the most important feature on the headset. It is used very often. It is imperative that the user can determine quickly with no doubt when it is engaged. It should be a large bright indicator light viewable from all angles and from a distance. When someone puts the headset on mute there is a REASON. They must have certainty under all conditions. When I look down to see if I am on mute (I can't hear that I am on mute) I want a fast unambiguous answer at any angle. I don't want to have to position the light. Sometimes I leave my desk temporarily while a conference call continues and then I look back to make certain my headset is on mute. This is going to be very difficult with this design. Perhaps you could have a little dim light to indicate the headset is plugged in (possibly a different color). Function should always dictate design. Beauty is functional, not an ornate first impression.\n\n2) The headset has an individual wire running to each ear piece. I prefer a single wire running to one side, though I'll concede the button controls are more intuitive to grasp when they are located at the nexus of the dual wires centered on the torso. The dual wire system uses two thin wires rather than one thicker wire. Sometimes I step on the wire or catch it in some way (as with any headset) before I get up from my desk and the headset is subsequently torn from my head. The thin wires on this headset look a bit too delicate to sustain much roughness. Usually, headsets fail because a connection goes bad. This headset looks like it has a couple of weak links. Also, I don't like the lasso formed by the two wires as they come together. It is much more likely to catch things on my desk as I hang the headset up or grab them to put them back on.\n\nOther than what I have written above, the headset seems well made. They do fold up very nicely and are as compact as practicable, however all things considered they are not that much more compact than the ones that don't fold up. As to how they sound, I'll leave that to others to comment on. My old headset sounds fantastic so I expect just as much from this one, that is a given. There is far too much attention paid and time spent discussing incremental improvements in sound that few people will notice or care about. The ergonomic design is the issue.\n\nParadoxically, my old Plantronics headset is, as a practical matter, better than this new one. Unfortunately, it was discontinued several years ago and I cannot buy it anymore. I am not nostalgic or sentimental, just stating the facts. Fortunately, years ago I bought ten or twelve pairs (mostly for people in my office) and kept several pairs for myself. They were about $50 per pair back then. I have one left that I am using and will continue to use until it breaks. My headset is used heavily all day long, every business day. When it breaks I will use the new pair (maybe).\n\nUnfortunately, the new pair and another new Logitech pair I just bought (with a host of its own serious design flaws) were the closest in design to the tried and true Plantronics pair I am currently using. The state of the art has moved backwards. I would pay $50 today to buy a new pair of my old headset simply because everything about the design is correct - and it would probably only need to cost half that much.",
            "title": "Disappointed",
            "userName": "Robert A Steinbeck"
        },
        {
            "date": "January 24, 2013",
            "rating": "3.0",
            "text": "Being a frequent user of Skype, and having heard and read that headsets are better than the microphone that comes with webcams, and computer speakers due to occasional feedback issues, I was guided by the many positive reviews on Amazon and purchased this one. The loudness controls on the cable are a real plus, and the on/off button is also convenient. A software download is necessary in order for the latter to function. The problem with this headset is the sound quality--on both ends. There is a distinct echo effect (could be classified as a distortion) that I have found to be both annoying and disappointing. The people with whom I have spoken have the same experience listening. Not enough to return it, but bad enough to give the headset a perhaps generous three stars. The earphones are a bit snug, but not objectionable. I only use the headset with Skype and cannot speak to other uses, but I would not purchase this headset again.",
            "title": "Borderline okay",
            "userName": "Joe from LA"
        },
        {
            "date": "January 12, 2013",
            "rating": "5.0",
            "text": "I bought my first pair of Plantronics 478 a year ago. I'm very picky and do a lot of research before deciding on a purchase, specially with PC headsets as I don't use speakers. Deciding on a good pair of headsets is not easy as most have either bad sound quality, they break easily or they don't last long. When it comes to PC headsets I always bought Plantronics. MY previous USB DSP headsets broke after 7 years of constant use (can't complain!), so I decided to test the 478 as a replacement. They have very good sound quality for the price, they seem to be sturdy (1 year so far and they perform like new), and they have excellent design for travel and voice IP. They are so good that I bought a 2nd pair this year for my notebook and as a spare just in case. I recommend this headset, you won't regret at all! Thanks Plantronics!!",
            "title": "Excellent headsets by Plantronics",
            "userName": "perseid"
        },
        {
            "date": "January 31, 2013",
            "rating": "4.0",
            "text": "I received the headphones a day early and was also pleasantly surprised to find it in perfect condition. The packaging was good and sufficient padding was provided. The headphones have good sound (I'm not an audiophile and the music I was listening sounded good to me) and are comfortable for the first hour or so, but it starts getting kind of uncomfortable when you reach the 2 hour mark. Additionally due to the flexible frame (it is compact and can be folded), It keeps slipping off my head which is really annoying. But I would say that it's a good balance of functionality and sound, and if it's a few dollars cheaper, it would be a no-brainer in the foldable headphones category.",
            "title": "Could be more comfortable, but has good sound",
            "userName": "Hari R Raamanathan"
        },
        {
            "date": "May 16, 2013",
            "rating": "4.0",
            "text": "I have owned multiple Plantronics DSP-500 USB headsets, which are now discontinued. They indeed canceled the noise during recording, and they recorded quite clearly (good frequency response). This newer Audio 478 headset, in contrast, does not live up to that reputation whatsoever. It records absolutely no better than standard-issue 3.5mm analog microphones. There is plenty of noise -- no more, but no less, than standard analog PC mics -- and the sensitivity is also substandard when considering how close the microphone is to the mouth. Admittedly, I did not experience any problems with breathing sounds, but the puffball on some mics takes care of that pretty well. I thought that being like 8 years newer, this microphone would be able to provide --at least-- the quality of the older DSP-500, especially since even budget digital cameras and other sound equipment is so much better these days than it used to be, but I guess Plantronics decided to throw away the idea of caring about sound quality. I would not recommend this headset for anything other than basic gaming and chatting, and maybe cheap voice recognition. This headset is not suitable for even semi-professional applications.\n\nPS: Yes, the noise can be cancelled using third-party software, and Skype could do that for all I know, but the unit alone does not -- despite it clearly sounding like it does in its description. For those curious, I used Windows 8, 64-bit, with the built-in drivers, for this product test.",
            "title": "Not what I call noise-canceling",
            "userName": "Michael"
        },
        {
            "date": "May 13, 2013",
            "rating": "2.0",
            "text": "The wires going into each side of the headset from day one continually wound around each other under my neck, creating a nice strangulation effect. No amount of dangling to reverse the effect keeps them apart.\n\nThe control with hangup and mute buttons is conveniently placed front and center, just where the edge of your desk is likely to be. I have muted or hung up calls many times by inadvertently leaning into my desk while talking.\n\nI wish I had returned them.",
            "title": "Okay sound. Really annoying design.",
            "userName": "Shambhavi Sarasvati"
        },
        {
            "date": "October 14, 2012",
            "rating": "4.0",
            "text": "Easy set-up. Works great with Skype on my Windows 7 PC.\n\nThough the headset is just as advertised, if I were to buy again I would try a model with cups that fit around the ears instead of this model, which has flat foam pads that rest on the ears. The foam gets warm when worn for long periods. Perhaps this is inevitable with any style except in-ear, which has its own comfort issues.\n\nAnother opportunity to improve the design would be to place the mute button in a more convenient area. I frequently mute/unmute when on conference calls and I have to hold and look at the control to know what mode I'm in (a light goes on/off to show the mode).\n\nAudio quality is reported by those on the other end of the line to be excellent, but the microphone also picks up outside noises like birds just outside an open window. I have not used other headsets so I don't know if this is common or not.\n\nOverall, a good product for the price.",
            "title": "No problems",
            "userName": "Globe Tripper"
        },
        {
            "date": "April 14, 2014",
            "rating": "5.0",
            "text": "It's as described. Headphone with good frequency answer and microphone works properly. Plug and play. Good stuff which I recommend.",
            "title": "Glad to got it",
            "userName": "Roberto"
        },
        {
            "date": "April 14, 2014",
            "rating": "5.0",
            "text": "I like the fact that it's a USB interface, so you don't have to fiddle with the audio in/out plugs. It's folds up fairly well, with a little man-handling. It feels more fragile than I think it really is I suspect. The sound quality is just fine, even in a semi-noisy environment. The microphone seems to manage to mitigate backgound noise, at least the minor variety in an office setting.",
            "title": "Compact and decent sound quality",
            "userName": "Amazon Customer"
        },
        {
            "date": "April 12, 2014",
            "rating": "5.0",
            "text": "I have used this for communicating with the PC in gaming, and Skype, as well as watching movies and listening to music. All without a glitch. I am not an audio critic, but the sound is very acceptable, however, I have heard richer tones and base from more expensive headphones, but for the price, and what I needed it for, I am happy with the purchase! The folding design and carry case is genius! The inline volume, mute button are great, yet I have not used the Skype button successfully yet, but I don't skype often. I have listened to recordings of my online gaming communications posted on the gaming site, and the voice quality was clearer than I expected.",
            "title": "A great general purpose headphone, well designed!",
            "userName": "Daniel E Temkin"
        },
        {
            "date": "April 11, 2014",
            "rating": "4.0",
            "text": "Would recommend to friends and family. I am not using it at the moment but I have and it is super.",
            "title": "Great",
            "userName": "Lisa Yasko"
        },
        {
            "date": "April 11, 2014",
            "rating": "5.0",
            "text": "I give this headset 5 stars, but don't confuse that for 5 stars in a expensive headset. I bought one for each of my two kids and they get hours of use per day. I have used them on occassion too. Comfortable and good sound. This is a very good headset, much better than the price suggests. A top value for the dollar.\n\nIt works well in Skype, which is most of their use but we all do listen to music and while they are not as high fidelity as top end headsets they are very acceptable.",
            "title": "Perfect for price point.",
            "userName": "John"
        },
        {
            "date": "April 9, 2014",
            "rating": "5.0",
            "text": "I can use this with Dragon Naturally Speaking outdoors on a windy day (like at the beach) and it cuts out all the wind noise, and transcribes properly. It's not super fashionable though in public. But I tried the very expensive bluetooth sets with noise canceling where it rests on your ear, and this still worked a lot better at getting rid of noise and wind.",
            "title": "Works great",
            "userName": "Jose Gonzalez \"Jose\""
        },
        {
            "date": "April 9, 2014",
            "rating": "5.0",
            "text": "This works great. I like how compact it is. Works well. I use it for Rosetta Stone and it works great. Good mic. One minus is that I am a big guy (6'4) with a like-sized head. At full extension the headset is a little tight. It seems like a standard size because most headsets are a little tight. That said I plan to use this often and the tightness is a small inconvenience.",
            "title": "Great headset.  compact",
            "userName": "John P. Hoven"
        },
        {
            "date": "April 9, 2014",
            "rating": "4.0",
            "text": "I have transitioned to working from home and needed the ability to use the Internet Phone...this was the perfect fit!.",
            "title": "Recomend the Plantronics Audio 478 Stereo USB Headset",
            "userName": "Amazon Customer"
        },
        {
            "date": "April 8, 2014",
            "rating": "5.0",
            "text": "Works very well with Skype and Go to Meeting. I use it every day. Quality is good and have had no problems.",
            "title": "Great Headset",
            "userName": "Joseph J. Eusebio"
        },
        {
            "date": "April 6, 2014",
            "rating": "5.0",
            "text": "Sound effect is very clear; price reasonable; and I especially like its design, including the USB. I'd highly recommend it.",
            "title": "Pretty good",
            "userName": "Yi Yang"
        },
        {
            "date": "April 5, 2014",
            "rating": "5.0",
            "text": "I bought this headset to use with Skype. They are easy to install. Perfect for the task I bought them for.",
            "title": "Great for Skype",
            "userName": "Symplecton"
        },
        {
            "date": "April 5, 2014",
            "rating": "5.0",
            "text": "Excellent audio quality when used over Skype to give English classes. Mic is also very clear too. Folds away neatly.",
            "title": "Perfect for online language teaching!",
            "userName": "Stephen C."
        },
        {
            "date": "April 4, 2014",
            "rating": "4.0",
            "text": "I use this headset on my work Mac Mini for Lync and Skype calls. The headphones are very good for spoken conversations, and fine for audio (but don't expect to be blown away by the depth or range of sound). The microphone comes across very well (according to others). The built-in control includes an answer button, volume buttons, and the mute button. The only button that has worked for me so far is mute; I can't seem to get the volume buttons to work. I will look for a driver and update this review as appropriate. The mute button works perfectly and has a built-in LED light to show it is engaged. Very good headset if you don't mind the wires!",
            "title": "Good sound quality, comfortable, useful controls",
            "userName": "Mark Berela"
        },
        {
            "date": "April 3, 2014",
            "rating": "5.0",
            "text": "One of the few out there which are Skype certified. Drivers are no issue, installation is a breeze and those are rather comfortable. It will be hard to get a better deal comparing price and performance.",
            "title": "It works",
            "userName": "CamGuru"
        },
        {
            "date": "April 3, 2014",
            "rating": "4.0",
            "text": "The headphone set worked as soon as I plugged it into a USB prot on my Windows 7 laptop. I only use them when I am talking on Skype, clear, mute works well and the mirophone is clear. The only drawback is the comfort of the ear phones so I would not want to use them for long periods of time.",
            "title": "Works great and easy to install",
            "userName": "mewoodwork"
        },
        {
            "date": "March 30, 2014",
            "rating": "3.0",
            "text": "Not the best and not the worst. For the price and if you don't really care about the quality of the sound...it's fine.",
            "title": "Sound it .....so so",
            "userName": "Kirasheba \"kira\""
        },
        {
            "date": "March 29, 2014",
            "rating": "5.0",
            "text": "I absolutely loved this headset, I heard sound great, the mic was beyond amazing, and it was easy to use and work with through skype and my computers confusing sound board. I have had this headset for about a year, and one of the earphones (the one with the microphone) has gone out. This made me very sad, although I do realize I should have taken better care of it in the first place. My mic did not go out with the earphone so that made me hopeful, but if you are looking for a good headset, you found it!",
            "title": "Great headset!",
            "userName": "mamacarla"
        },
        {
            "date": "March 28, 2014",
            "rating": "4.0",
            "text": "It didn't simply meet my expectations, it surpassed it. Great sound quality and nice controls. A well deserved 5 stars review.",
            "title": "Superb product",
            "userName": "Leonardo S. Ramos"
        },
        {
            "date": "March 27, 2014",
            "rating": "5.0",
            "text": "This headset adjusts very well to my head -- much better than other headsets I've purchased in the past. Recommend it for anyone.",
            "title": "Excellent fit and ability to hear",
            "userName": "CL (64 year young lady)"
        },
        {
            "date": "March 26, 2014",
            "rating": "5.0",
            "text": "1. Light weight to travel;\n2. With USB I can use skype on my small laptop.\n3. Easy to adjust volumes.",
            "title": "Excellent to work with my Acer Aspire S3.",
            "userName": "sun \"sun\""
        },
        {
            "date": "March 24, 2014",
            "rating": "3.0",
            "text": "like the headset BUT the mic boom needs to be a little linger. unless I hold it closer to my lips the boom stands to far away for system to pick up my words. delivered in timely way.",
            "title": "headset with microphone",
            "userName": "G. Welch"
        },
        {
            "date": "March 23, 2014",
            "rating": "5.0",
            "text": "Good hearing quality and noise isolation. The headset is sitting comfortably. Very light. Easily adjustable. I would recommend to buy, especially considering a very reasonable price.",
            "title": "Very good product",
            "userName": "Yuri Idel"
        },
        {
            "date": "March 20, 2014",
            "rating": "5.0",
            "text": "I ordered this headset in order to make use of it with Dragon Naturally Speaking and it works perfectly. I had originally begun using the program with another type of plug-in microphone which made use of the soundcard, but I had read that a USB microphone was more accurate, and I have found this to be the case. The sound quality is excellent and I find that there are very few errors, which was not the case with the other microphone.",
            "title": "Excellent!",
            "userName": "Jayjayem"
        },
        {
            "date": "March 17, 2014",
            "rating": "2.0",
            "text": "I was looking for something I could use while on Skype, and while they technically work, it was a pain to set them up. They also refuse to work with anything BUT Skype, so they're not very versatile. Should've skipped it.",
            "title": "I don't know why I ordered these.",
            "userName": "Red Sesame"
        },
        {
            "date": "March 16, 2014",
            "rating": "5.0",
            "text": "I got these headphones for my boyfriend's birthday. He is a gamer. I was on a budget so I made some research. I purchased it and he was so happy with the sound quality! Mic is really good too. So we both happy!",
            "title": "Great sound's quality for a good price!",
            "userName": "OlgaW"
        },
        {
            "date": "March 16, 2014",
            "rating": "5.0",
            "text": "Really inexpensive for what you get. I use them primarily for phone calls over the computer, but often just for headphones for listening. I really like the quality of the call on my end, and the mic picks up very nicely for people on the other end. Simple operations.",
            "title": "Great quality sound and mike, comfortable",
            "userName": "Stephen Boland"
        },
        {
            "date": "March 16, 2014",
            "rating": "4.0",
            "text": "Plantronics Audio 478 Stereo USB Headset (Audio 478) is exactly as advertised and it works perfectly. It is small, compact and easy to install.",
            "title": "Awesome",
            "userName": "John Prewitt"
        },
        {
            "date": "March 16, 2014",
            "rating": "4.0",
            "text": "Work like a charm. Very clear sound. Easy remote volume. I do a lot of telemarketing and this is the headset I use.",
            "title": "Best value",
            "userName": "Jon Dittrich"
        },
        {
            "date": "March 15, 2014",
            "rating": "3.0",
            "text": "It's just okay but very outdated, it actually works like they say it does. And the budget price make it seem like a good value.",
            "title": "Headset",
            "userName": "Daniel"
        },
        {
            "date": "March 14, 2014",
            "rating": "5.0",
            "text": "I give this head set 5 stars because it gets the job done and is capable of doing what there suppose to, which is give clear and accurate sound with no interruption volume and mute buttons work perfectly. I like that the cord allows you to freely move\nabout, you maneuver around to handle other tasks. What I dislike is there is wires hanging from both sides of the ear piece and\nthe fact my plantronics windscreen kit supra Nc/polarisnoise Cancelling Mouth Piece that I purchased to go on the tip of the\nspeaker won't stay on. lol :) that;s not important. I work from home in customer service at UHaul, bottom line is it works great and\nI would recommend it to anyone... Stop!!! The search is over, you don't have to hunt anymore.",
            "title": "Best Buy!!! Give it a Try...",
            "userName": "Collene Fristoe"
        },
        {
            "date": "March 13, 2014",
            "rating": "5.0",
            "text": "I needed this for a web class and it has worked well. My teacher has been happy with its performance.",
            "title": "Worked Great",
            "userName": "J. R. Murphy"
        },
        {
            "date": "March 13, 2014",
            "rating": "3.0",
            "text": "I like that this folds and I can tuck it away. After a few months of weekly uses, I find myself wondering is there is a loose wire somewhere; I get little breaks in the sound on occasion.",
            "title": "it will do",
            "userName": "One shopper"
        },
        {
            "date": "March 12, 2014",
            "rating": "2.0",
            "text": "This is one of the most uncomfortable headsets I've ever worn. It feels like it's mashing foam into your ear canals all day. The cord is really terrible for this design, it splits in the front and will turn into a tangled mess every time you want to collapse the thing. It also feels really brittle, like a little pressure would snap it apart. Sound quality is ok, nothing special.\n\nDon't waste your money, you will not want to wear this thing for an extended period of time.",
            "title": "Cheap, tangled mess",
            "userName": "Chris Jacobs"
        },
        {
            "date": "March 11, 2014",
            "rating": "1.0",
            "text": "This is the second time this happens to me with this model. I thought the first was an accident but after the 3rd time others on skype couldn't hear me I've given up.",
            "title": "Mic cuts out",
            "userName": "hmmm"
        },
        {
            "date": "March 11, 2014",
            "rating": "5.0",
            "text": "Wow, was I surprised at the performance of this headset.\nMy purpose for buying it was Dragon Naturally Speaking 12.5 software ... and it doesn't disappoint..\nGood product and definitely worth recommending.",
            "title": "Plantronics 478 Headset",
            "userName": "Mr. E"
        },
        {
            "date": "March 11, 2014",
            "rating": "3.0",
            "text": "I bought these because I was using my wife's headset for weekly web narration and hers were very uncomfortable.\nThese do feel pretty flimsy, I would have been happier without the folding option, but I don't foresee them breaking if treated well.\n\nThe biggest issue is the sound quality of recordings. Compared to my wife's Logitec 350, these are awful. But I should mention that I didn't realize the Logitecs were $130 (My wife has good taste). So in light of that, I can't complain too much about this set vs others in this price range.\n\nI have other Plantronics headsets and they have always been acceptable, but never great.\nThis headset is more comfortable that the $130 Logitecs but still not great. Maybe my head is an odd shape or something, but these are too tight and the top band is long and flat unlike my head. Very odd design. If you have a smaller, flat-topped head these should fit great.",
            "title": "Poor sound quality, but fair for the price",
            "userName": "C farl"
        },
        {
            "date": "March 10, 2014",
            "rating": "2.0",
            "text": "I found it to be uncomfortable on the ears in less than one hour. The mute button is too close to the headset. The mute button is easy to mix up with the volume - button.\n\nIf you wear a headset all day and/or like to mute often, do not get this headset.",
            "title": "not so great",
            "userName": "MT"
        },
        {
            "date": "March 9, 2014",
            "rating": "4.0",
            "text": "Easy to fold and store in your travel computer bag. Easy to use, light weight, excellent communications with : clear without interferences.",
            "title": "Perfect sound, no interferences.",
            "userName": "GioGor"
        },
        {
            "date": "March 8, 2014",
            "rating": "5.0",
            "text": "My only regret is not getting this headset earlier. It works as advertised and better. It is so good that I purchased 3 more for our team. Highly recommended.",
            "title": "Excellent.",
            "userName": "Eduardo Angel"
        },
        {
            "date": "March 6, 2014",
            "rating": "4.0",
            "text": "Pros: Price, lightweight, great volume, handy volume control on cord.\nCons: Sound not good enough for getting the most out of your music. These are also not real comfortable, there is very little padding, just very thin foam covering the speakers. They don't hurt or anything like that but it would have been nice if they were padded more.",
            "title": "good for videos and TV",
            "userName": "Eric TenEyck \"Viking0040\""
        },
        {
            "date": "March 6, 2014",
            "rating": "5.0",
            "text": "For the price of this item, it's hard to go wrong. The sound quality is good, and others can hear me well. The headset folds up which is nice for storage or putting in a travel bag or something. I had a little bit of trouble getting the drivers installed correctly again after I changed which USB port I plugged the headset into, but I just used Check for Update in the Device Manager in Windows and it found the driver quickly.",
            "title": "For the price, a great buy",
            "userName": "N.W."
        },
        {
            "date": "March 4, 2014",
            "rating": "4.0",
            "text": "No issues. I can hear very clearly. Does a decent job at filtering out the loud music I listen to during raids. The Answer call button only works if you download some weird software from their website. It's pretty legit though once it's working.",
            "title": "Works Well",
            "userName": "Lina"
        },
        {
            "date": "March 4, 2014",
            "rating": "5.0",
            "text": "I work from home and always use Plantronics the best brand out there for work. I love these they are clear sounding. The noise cancelling is great too. I would highly recommend them. I am probably going to pick up another for spare.",
            "title": "LOVE !!!!",
            "userName": "KitCat"
        },
        {
            "date": "March 4, 2014",
            "rating": "5.0",
            "text": "Like the set very much! Performs as expected with no problems so far. have suggested same to others in organization",
            "title": "Works very well  I am satisfied and recommended to others",
            "userName": "Michael Bourbina Sr."
        },
        {
            "date": "March 3, 2014",
            "rating": "5.0",
            "text": "I bought these in December 2013. I'm very hard on headphones/headsets, and these don't even show a sign of wear and tear. Usually by now, I would have lost, torn or destroyed at least one of the earpiece cushions.\n\nI bought them especially for Skype calls, and I thought they were a problem at first. There's only one person I Skype with, so I finally discovered that the horrible echo I was hearing had nothing to do with me, rather it had to do with the person on the other end with their volume on their laptop too high.\n\nA note about comfort...As someone who has a relatively small head, wears very thick glasses, has long hair, and wears earrings, it's been difficult for me to find a headset that didn't hurt my ears. When I got these, I expected the same thing...ear pain. But I figured I'd just deal with it like I always have. But that's not what happened. When I first put them on, I had to adjust the band to fit me, but I got it to a comfortable spot. My expectation was as they got older, they would settle into discomfort. But as I write this email, and wear the headphones often 12+ hours per day, they're still just as comfortable as I took them out of the box.\n\nI never expected these to have amazing sound output or input, but again, I was surprised. If you're a music quality connoisseur, then you'll want a pair of headphones or a headset that cost you around $100. But with a price tag right about $30, they're great for everyday use, especially for Skype calling.\n\nLastly, I would like to say that the price is very reasonable for what you get.",
            "title": "Had these for awhile now",
            "userName": "Ruthie"
        },
        {
            "date": "March 3, 2014",
            "rating": "5.0",
            "text": "I work from home and I need a headset that is comfy, works well and has an extra mute.\nThis headset is compact but works great, doesn't pinch and isn't too tight.\nI work on the phone all day and I can hear and be heard just fine, there is additional volume controls and mute on the cord of the headset. USB. All I did was plug it into my computer and it started working perfectly.\nI've been using it for over a week now and no issues. Great buy.",
            "title": "Great headset",
            "userName": "Stephanie"
        },
        {
            "date": "March 1, 2014",
            "rating": "5.0",
            "text": "these are excellent headphones. Clear sound, plug and play, and comfortable headphones. Made ALL the difference in the world with her understanding what is being said over the computer - the basic computer speakers are absolutely lousy and she had been struggling with skype.",
            "title": "fantastic for Mom who skypes with son overseas",
            "userName": "Karen J. Bacon"
        },
        {
            "date": "February 28, 2014",
            "rating": "4.0",
            "text": "Solid headset, with no defects. Works fine and cannot really complain. If I had bought these 10 years ago, I would have been totally satisfied.\n\nI just think that I am getting a little spoiled by technology. The wires always seem to be twisted, and gets in my way. I have already decided to replace this model with something using Bluetooth. It will be a lot neater and a lot less clutter.\n\nBut again, if you are looking for a wired stereo headset with microphone, this set works fine.",
            "title": "Works well enough, okay deal for the money.",
            "userName": "Richard D. Lamoreaux"
        },
        {
            "date": "February 26, 2014",
            "rating": "4.0",
            "text": "I bought this for my girlfriend, who has hearing loss, and wears hearing aids as a consequence. The sound quality is good at both ends, although she does experience some bleed from the earpieces into the microphone. To be fair, she has them turned up quite high due to her disability, so I wouldn't expect this issue in someone with healthy ears. Also, she says they aren't perfectly comfortable after a while, but again, the hearing aids contribute to the problem. No trouble with the Mac and OSX Maverick.",
            "title": "Pretty good.",
            "userName": "Ermghoti"
        },
        {
            "date": "February 25, 2014",
            "rating": "4.0",
            "text": "love it.... esp the flexi way to flip the two sides. it is easy to keep in small bag. the sound is great.",
            "title": "it's awesome",
            "userName": "shane"
        },
        {
            "date": "February 24, 2014",
            "rating": "5.0",
            "text": "I am learning 2 new languages with Rosetta Stone and needed USB headphones, these work wonderfully for me but I haven't tried Skype or anything, just Rosetta Stone.",
            "title": "Love these...",
            "userName": "MJ's mom"
        },
        {
            "date": "February 23, 2014",
            "rating": "4.0",
            "text": "The sound is great, and I like the volume controls. It is great that it folds up and has a storage bag. The Skype feature does not work for me, but maybe there is something I am not doing correctly.",
            "title": "skype feature did not work for me",
            "userName": "Jacki Sue"
        },
        {
            "date": "February 22, 2014",
            "rating": "5.0",
            "text": "I saw a coworker using these headphones in the office one day to make a client call. We use Google Voice a lot for these types of calls and for conference calls so we aren't accumulating minutes on our cells. I decided to give them a try. They are much, much clearer than using my laptop speakers/microphone. The usb cord is generous in length and the volume controls work perfectly and are very handy. Good buy - glad I gave them a try. Oh... great for listening to music, too.",
            "title": "Perfect for work! Clear conference and client calls.",
            "userName": "D. Ferguson"
        },
        {
            "date": "February 21, 2014",
            "rating": "4.0",
            "text": "Works well with my Dragon Natural speak. I simply pulled the head phones in and my computer picked it up. No issues except not the most comfortable ear pads in the world.",
            "title": "Dragon",
            "userName": "Michael McCarver"
        },
        {
            "date": "February 21, 2014",
            "rating": "2.0",
            "text": "I have a 24 iMac and bought this to use for doing google voice calls.\nWhile I could get it to work after a bunch of fiddling, the buttons never worked, and the quality was lackluster for the price.\nI ended up returning it and buying the similar plantronics unit that was dual 1/8 jacks That has worked flawlessly.\n\nI think if I were someone using this on a daily basis and willing to leave the weird audio settings configured the way they were, it'd work okay, but for me, I only need the headset sometimes, so using something that just works was preferable.\n\nIn the end, I can't recommend, as the full functionality was not there.",
            "title": "No good for my purposes",
            "userName": "Nate"
        },
        {
            "date": "February 20, 2014",
            "rating": "5.0",
            "text": "They work great, everything is clear, but I would recommend purchasing the wind guard as the microphone is sensitive enough to pick up breathing.",
            "title": "Great set of headphones.",
            "userName": "J. Privatt"
        },
        {
            "date": "February 19, 2014",
            "rating": "5.0",
            "text": "I like this headset a lot. It's comfortable to wear, and listening to music through it sounds awesome. I've not yet tried to make internet calls using it, so I can't speak to the sound quality doing that. But if the music coming through the headset sounds great, I would imagine the sound quality when using the headset for phone calls would be top notch.",
            "title": "Very nice, inexspensive headset.",
            "userName": "Steve"
        },
        {
            "date": "February 19, 2014",
            "rating": "4.0",
            "text": "Worked perfectly the first time and always. USB friendly which works everywhere. Clear and crisp sound and voice recognition is very good. Thanks!",
            "title": "Good quality and performance",
            "userName": "Jose Moreno"
        },
        {
            "date": "February 18, 2014",
            "rating": "3.0",
            "text": "Overall a decent headset. Sound quality is okay and the microphone picks up sound well resulting in fairly clear audio. I would have liked it better if the ear covers were more comfortable.",
            "title": "Not bad for its price",
            "userName": "2Bigdogs"
        },
        {
            "date": "February 13, 2014",
            "rating": "4.0",
            "text": "I bought this for answering calls for work through Google Voice. While GV unfortunately does not have the ability to pick up calls from the button (designed for Skype), the clarity is great and the microphone seems to work well. The design of the band is very wide, and I haven't found how best to have that fit my normal size head, so I docked a star for that, but this is otherwise a great product.",
            "title": "Works well for phone calls over the computer",
            "userName": "Andy G"
        },
        {
            "date": "February 11, 2014",
            "rating": "4.0",
            "text": "My wife uses these in her work and due to repeated and fairly heavy use, they wear out in a few months. They become static-y like the wires may be breaking down inside. We just keep an extra set on hand and replace them as necessary.",
            "title": "These are a good value for the money.",
            "userName": "Tom Christian"
        },
        {
            "date": "February 11, 2014",
            "rating": "3.0",
            "text": "As with many other USB headsets, the Plantronics Audio 478 does emit a constant background noise when it's plugged in and activated. I don't have this problem with analog headsets, but it's very common for USB headsets apparently - all of mine do this. Other than that, it's a great set - good sound quality, comfortable, foldable and all. :)",
            "title": "Constant background hiss :(",
            "userName": "Galen Wang"
        },
        {
            "date": "February 10, 2014",
            "rating": "4.0",
            "text": "I got this so I could use Skype quickly and easily, and it does 3/4 of that job, which is my only issue. It sets up easily, and when an incoming call is received, you just click the integrated cord-control, and you're talking. Hit the same button again, and you hang up. The volume controls are also a nice touch, since you don't have to be in front of the laptop to change or even mute a call. The one thing it lacks is the ability to initiate a Skype call. I'd like to see the same button you answer with, when not in a call, to pop up Skype on screen and let me select a contact to call, and initiate the call. Overall, very nice, and the carry bag was a nice little add-on. Good sound on phones and mic.",
            "title": "Very nice headset - Read further",
            "userName": "Christopher W. Monro \"Scuba\""
        },
        {
            "date": "February 9, 2014",
            "rating": "4.0",
            "text": "The sound is good and the microphone is very good. I like that the controls are easy to access and I didn't have to do a single thing to set it up but plug it into my laptop. I was able to take it out of the package and immediately start working on my spanish assignment that required me to record my voice. From opening the package to finishing the assignment, it was completely done within 10 minutes and it took me a bit more than 10 minutes to do the assignment. My only complaint is that they are really uncomfortable after about 40 minutes to an hour. I was too lazy to take the headphones off when I completed my first assignment and just kept working on other written assignments for another hour. My ears really hurt right now. So if you're planning on wearing them for long periods of time, then look for something else. For the price though, I wasn't expecting ultra soft, fluffy, comfortable earphones. The quality is much better than I expected for what I paid. Certainly wouldn't use these headphones for a long gaming session or even a long skype call no matter how clear my voice sounds.",
            "title": "Very Uncomfortable",
            "userName": "abaglivi"
        },
        {
            "date": "February 9, 2014",
            "rating": "4.0",
            "text": "I purchased 10 of these for the office to use with Skype calls. I chose these headphones as they were decently priced and had good reviews.\n\nOur team uses these daily for many calls and the audio quality is a massive improvement over using webcam microphones.\n\nPROs:\n\n- Significantly clearer audio than a webcam mic.\n- Open-ear design allows you to stay involved in your surroundings without having to constantly remove and replace the headset.\n- In-line digital volume control and mute buttons are very convenient.\n- USB connection makes them easy to use on Mac and PC without dedicated headphone and mic inputs, I regularly swap these between my Windows desktop and my Mac laptop.\n\nCONs:\n\n- I don't think that the foam ear pads will last a long time.\n- Audio quality isn't amazing, you'll not really want to be using these to listen to music.",
            "title": "Decent audio, cheap, nothing amazing.",
            "userName": "James L"
        },
        {
            "date": "February 3, 2014",
            "rating": "5.0",
            "text": "I use this for my Spanish lessons and Dragon Dictate...it is a very good product to use for these purposes.",
            "title": "Great product",
            "userName": "MHarris \"Martyk\""
        },
        {
            "date": "February 2, 2014",
            "rating": "4.0",
            "text": "I had the dsp500 before this headset and it is a great replacement. I wish the cord was a little longer, but other than no complaints. The sound and mic are both very clear",
            "title": "Works well",
            "userName": "rpardi"
        },
        {
            "date": "February 2, 2014",
            "rating": "4.0",
            "text": "I have been using this daily now for a few months. II have never had any trouble with it, and the sound (both ways) has always been great. I have given a few presentations using this and always the sound (I have been told) has been excellent. They also fold, which was a big thing for me as I wanted to take them when I travel for work. Cord length is more than acceptable. These also seem to be holding up well. Will try to re-review later than for a long term overview of the product.",
            "title": "Great headset - long term review",
            "userName": "Graham S"
        },
        {
            "date": "January 31, 2014",
            "rating": "5.0",
            "text": "I ordered this to use for my online classes with my MacBook. These work great. Sound is good and no background noise when I use the Mic. Works well with MacBook pro.",
            "title": "Worked great with my macbook",
            "userName": "Casey T"
        },
        {
            "date": "January 27, 2014",
            "rating": "4.0",
            "text": "We primarily use the headset for dictation software ran on an Apple Macbook. Also works for me on my windows machine as well.\n\nThe sound quality is great for any purpose you would have. Calls are easily heard.\n\nMy only issue is that the mic is not as great as the headphones. You basically have to turn up the microphone to get about 75% of what you would expect for volume.\n\nOther than that, for the price it was perfect.",
            "title": "Great sound quality, decent microphone. Works with Windows/Apple products.",
            "userName": "jared m"
        },
        {
            "date": "January 23, 2014",
            "rating": "5.0",
            "text": "Great product, great quality - especially for the price.\n\nI use it with RingCentral, also great with Skype and Google Talk.\n\nHighly recommended.",
            "title": "Great Quality - Good Enough For Business Use",
            "userName": "DR"
        },
        {
            "date": "January 23, 2014",
            "rating": "5.0",
            "text": "Purchased to use with Duolingo language site. Works fine, speaker quality is very good. Very comfy on ears and the volume control in on the cord. Folds up easily for storage and the plastic used to make them is flexible and durable. Should last for years without breaking.",
            "title": "Very comfortable and folds up easy",
            "userName": "Roman A."
        },
        {
            "date": "January 22, 2014",
            "rating": "5.0",
            "text": "Crystal clear and very comfortable. You can hardly tell you are wearing them. Great for long gaming sessions. Would recommend .",
            "title": "Very Nice",
            "userName": "Michae E Doerr"
        },
        {
            "date": "January 22, 2014",
            "rating": "5.0",
            "text": "Good quality sound and voice. I like the volume control on the wire. I use it for music and conf calls using MS lync",
            "title": "works as expected",
            "userName": "brian lakatos \"Mr. Hitech\""
        },
        {
            "date": "January 21, 2014",
            "rating": "5.0",
            "text": "I bought this for my mother and she loves it.... She is a FOB and was able to use it!!! She barely speaks engrish and is not very tech savvy (anti tech savvy?).",
            "title": "So easy my Mama can use it!",
            "userName": "samuel"
        },
        {
            "date": "January 21, 2014",
            "rating": "5.0",
            "text": "This is my first headphone set. Will be using them for online tech support. Comfortable, seem to work as described.",
            "title": "Good choice",
            "userName": "701b"
        },
        {
            "date": "January 19, 2014",
            "rating": "4.0",
            "text": "Had to download software from Plantronics web site that took a while to locate, but besides that the product works as stated.",
            "title": "workes great",
            "userName": "Patrick"
        },
        {
            "date": "January 18, 2014",
            "rating": "4.0",
            "text": "Used on Skype and gotomeeting calls for work and it was just what I needed.\nClear and was comfortable for me.\nListeners on the call said my voice was crystal clear and the audio was excellent. I wish it had an adapter so that I could use it with an iPhone too but the USB is a perfect solution for my lap top. Thanks!",
            "title": "Used it for the first time this week and like it!",
            "userName": "Mia \"Mia\""
        },
        {
            "date": "January 18, 2014",
            "rating": "3.0",
            "text": "This is a decent headset but a little flimsy. Do yourself a favor and get the Plantronics .Audio 628. I have both now and only use this one as a backup.",
            "title": "Just Ok",
            "userName": "Eric Taylor \"ntgroup\""
        },
        {
            "date": "January 15, 2014",
            "rating": "5.0",
            "text": "These are very comfortable and actually fit my small head. I really like that it has a microphone also for when needed at work. sound is crystal clear and can go quite loud if i want it too.",
            "title": "Love the Headphones.",
            "userName": "Deann"
        },
        {
            "date": "January 13, 2014",
            "rating": "5.0",
            "text": "The sound and recording quality of these headphones are excellent. Especially for 30 bucks. Easy to set up and they work great.",
            "title": "Great Value",
            "userName": "Kmart223333"
        },
        {
            "date": "January 12, 2014",
            "rating": "5.0",
            "text": "I have several folks who work from home...kids and dogs in the background. They all rave about the headset and in speaking to them, they sound MUCH better.",
            "title": "Bought several for my team, everyone raves",
            "userName": "Chaim PB White"
        },
        {
            "date": "January 7, 2014",
            "rating": "5.0",
            "text": "The quality of sound is awesome. Very easy to use. Just plug in to usb port and your ready to go! Nice investment for working from home.",
            "title": "QUALITY SOUND!",
            "userName": "Shonlanda Alston"
        },
        {
            "date": "January 7, 2014",
            "rating": "5.0",
            "text": "I was reluctant to order a wired headset but these are very comfortable and the sound quality is excellent! I wear them all day and sometime forget I have them on my head...",
            "title": "Very comfortable headset",
            "userName": "John Hotaling"
        },
        {
            "date": "January 6, 2014",
            "rating": "5.0",
            "text": "Headphones sound great. Finally a pair that are loud enough for me! The mic works great, too. I hear no background noise. I have occasionally had to pull out of the usb port, and plug back in, to get it to work-- but that may be an issue with my computer. Highly recommend this affordable product.",
            "title": "Oh yes",
            "userName": "J. E. Evans \"Guitarist on 'Sleight of Hand' b..."
        },
        {
            "date": "January 6, 2014",
            "rating": "4.0",
            "text": "I got these because of the rating and price point. I needed a USB headset to use on my laptop when I was out of office and have had nothing but positive feedback on my sound quality when using this for calls such as Skype or Google+ hangouts. I've recorded it to hear how it sounds and I must say, it's about the average of what you'd expect from a USB headset. Similar to a phone, it cuts down on the really low end bass but keeps the chunk of mids and some highs.\n\nPadding could be added to make it comfortable over longer periods of time, but it does fold up well and compact for travel and does hold up to travel abuse.\n\nOverall, I'd recommend it.",
            "title": "Needs padding...but otherwise, is ok",
            "userName": "Dave S. \"SonicOrbStudios\""
        },
        {
            "date": "January 3, 2014",
            "rating": "2.0",
            "text": "Better than the last ear phones but still intermitted sound quality... I would not recommend this earphone to anyone. The up and down controls was a problem too... cust say it was poor sound quality.",
            "title": "poor sound quality!",
            "userName": "AUDRA CARTER"
        },
        {
            "date": "January 3, 2014",
            "rating": "4.0",
            "text": "Excellent headphones for skyping purposes. The little control center on the cord comes in really handy. Sound is excellent and listening to music is awesome, too!",
            "title": "Perfect for Skype",
            "userName": "Melanie Craven"
        },
        {
            "date": "January 2, 2014",
            "rating": "3.0",
            "text": "This product is okay. Sometimes it works and other times it doesn't. Needs some adjusting for sure. Looks good physically.",
            "title": "Doesn't seem to work all the time.",
            "userName": "Iliana Vayman"
        },
        {
            "date": "January 2, 2014",
            "rating": "4.0",
            "text": "This headset worked well and I am still using it. Sometimes, the headset doesn't work (in Windows 8) for Skype, in spite of connecting to different USB ports and troubleshooting, I had to restart laptop to refresh device settings for it to work properly. Except that, once get connected, works flawlessly.",
            "title": "Very comfortable and good quality voice for teleconference calls.",
            "userName": "AmazonBuyer57"
        },
        {
            "date": "January 2, 2014",
            "rating": "5.0",
            "text": "This is an affordable headset that's perfect for my needs. I highly recommend it for those on a budget and want quality.",
            "title": "Great headset",
            "userName": "Dorothy"
        },
        {
            "date": "January 2, 2014",
            "rating": "5.0",
            "text": "The headset worked perfectly with Grandsons new computer. Can now talk and play games with friends at the same time.",
            "title": "Headset",
            "userName": "Kristina Barkley"
        },
        {
            "date": "January 2, 2014",
            "rating": "5.0",
            "text": "Item was as advertised. Met all my expectations. On time delivery. All in all I am very pleased with the product. Audio is very good, and fits comfortably.",
            "title": "Good product. Would reccomend it.",
            "userName": "Amazon Customer"
        },
        {
            "date": "January 1, 2014",
            "rating": "5.0",
            "text": "My only problem with it is figuring out how to make it compatible with my computer. Still looking into it!",
            "title": "Good!",
            "userName": "newfiegirl16"
        },
        {
            "date": "January 1, 2014",
            "rating": "5.0",
            "text": "I need to learn to use Dragon and voice recognition for assorted reasons. I also happen to live with a musician, a drummer to be exact. I was able to use the software without any problem with the assorted musical rhythms coming for the room right next to where I was working.\n\nI also have a soft voice and once failed a lie detector test (I had the bright idea of becoming a police dispatcher.. nixed that one quickly) and when I used the mic that came with the software, it too had problems recognizing my voice. Plantronics was recommend to me and I am so glad I followed up on it!",
            "title": "My experience with my new microphone",
            "userName": "B. Zarrella"
        },
        {
            "date": "January 1, 2014",
            "rating": "5.0",
            "text": "well built, collapsable, clear sound, worth every penny.I bought for a friend as present, so I was glad they liked it.",
            "title": "ideal headphone",
            "userName": "yehuda kommemi"
        },
        {
            "date": "January 1, 2014",
            "rating": "5.0",
            "text": "This is a great head set for both the office and on the road. It's hinged design allows it to fold up nice and compact and this same design is comfortable to wear for hours. The controls built right into the cable make it easy to adjust the volume and mute the microphone, which is really handy for conference calls. This is a great headset at a very affordable price.",
            "title": "Comfortable and Easy to Use",
            "userName": "Prairie"
        },
        {
            "date": "December 31, 2013",
            "rating": "4.0",
            "text": "This headset is comfy and can be worn for hours. Audio quality is good and very seamless integrated with W7 (automatically selected as default comm device when I connect it)\n\nUnfortunately I expected more from the noise cancelling feature. I have made many tests and feedback received is that is not very good at cancelling noise around. I have paid attention to colleagues that are using headsets that seems more effective here; I will be looking to test these.",
            "title": "Good quality and clear audio though the mic is not really very good at noise cancelling",
            "userName": "Pen Name"
        },
        {
            "date": "December 30, 2013",
            "rating": "5.0",
            "text": "This was plug and play easy to set up and has remarkable clarity. Don't know what else one could ask of headphones. They are also light and comfortable. Others on the call (Go to Meeting) remarked on how clear I sounded, as if I were in the room.",
            "title": "very clear",
            "userName": "K. Soto"
        },
        {
            "date": "December 28, 2013",
            "rating": "5.0",
            "text": "I love this headset. I've had it for quite awhile now - maybe about a year. Its easy to use, reliable, and nice that it has a mic mute feature right on the cord. I've passed the Amazon link for it along to 3 coworkers who also ordered it.",
            "title": "Great Headset",
            "userName": "E. Finley"
        },
        {
            "date": "December 26, 2013",
            "rating": "5.0",
            "text": "I use this device for Skype calls from home for web meetings from home for my work with people around the world. It functions very well.",
            "title": "Works very well",
            "userName": "Bobby W"
        },
        {
            "date": "December 24, 2013",
            "rating": "4.0",
            "text": "Blocks out background noise when I am utilizing for my online courses. just what I needed! Sound quality is excellent.",
            "title": "Just what I needed",
            "userName": "Erin B."
        },
        {
            "date": "December 24, 2013",
            "rating": "5.0",
            "text": "I use this headset each day to speak with people around the world. The clarity of sound is excellent, like people are standing next to me. It folds up, and has taken some abuse, squished in my laptop pocket.",
            "title": "Excellent product",
            "userName": "bjspector"
        },
        {
            "date": "December 21, 2013",
            "rating": "3.0",
            "text": "Pretty cheaply made, the headband doesnt really fit comfortably unless you have a head the size of a watermelon.\nLots of crackling through the USB port, but that may have been my computer.",
            "title": "Okay, but there are much better ones.",
            "userName": "crazytrombone"
        },
        {
            "date": "December 19, 2013",
            "rating": "5.0",
            "text": "I needed to start using Google Voice because I work from home and all the calls made me go over my cellphone minutes. These didn't work when I first plugged them in, but a quick Google search for the make/model quickly led me to download installation software that got them working right away. I often have to change my settings on Google to make sure my computer recognizes them...but otherwise, the sound quality is excellent and I like the volume and mute features. My colleagues say it sounds like I'm on a landline.",
            "title": "Good sound, works with GoogleVoice",
            "userName": "R. Canan"
        },
        {
            "date": "December 17, 2013",
            "rating": "5.0",
            "text": "Good for dictation and online conversations. You can probably find a better solution for music. Don't know about gaming. Reasonably priced.",
            "title": "Accurate",
            "userName": "T. Singer \"JBS\""
        },
        {
            "date": "December 13, 2013",
            "rating": "4.0",
            "text": "Decent head phones for the money. Audio on other side appears to be a little low though. Comfortable to wear",
            "title": "Decent headphones for the money",
            "userName": "Eric C Dieckmann"
        },
        {
            "date": "December 13, 2013",
            "rating": "4.0",
            "text": "Works great. It's comfortable and I like the dual ear pieces. Wish I could get this in a headset for my phone.",
            "title": "Works Great",
            "userName": "Laurie"
        },
        {
            "date": "December 13, 2013",
            "rating": "5.0",
            "text": "Works great as a headset for my computer. Needed a headset for just listening to music and podcasts as well as a microphone when I had a class. Mute button and volume controls work great.",
            "title": "Perfect for work",
            "userName": "J. Curtis \"double dad\""
        },
        {
            "date": "December 12, 2013",
            "rating": "4.0",
            "text": "These are very decent, though the rubber ear pads could come off easily, they can be put back on, and the sound-booster controls are a nice touch. people can hear me well.",
            "title": "They work well for me, not perfect but better than others I have tried",
            "userName": "HowlingSandy"
        },
        {
            "date": "December 10, 2013",
            "rating": "4.0",
            "text": "Hard to compare to others because the price of this headset is great. People hear me without any issues. The Audio works well also. This headset is so comfortable I enjoy using them. I gave it four stars only because Skype is now giving me an error saying that it will no longer support this unit. This is a Skype issue. Will come back when it stops working to update the review.",
            "title": "So Comfortable!!",
            "userName": "Uriel Alvarez"
        },
        {
            "date": "December 9, 2013",
            "rating": "4.0",
            "text": "Works like a champ and those with whom I'm speaking say the sound is fine. The only trouble I've had is not with the headphones but getting sound to route to them vs my computer speakers.",
            "title": "Definitely worth the expense, works just as expected.",
            "userName": "Boz \"sgtboz\""
        },
        {
            "date": "December 2, 2013",
            "rating": "5.0",
            "text": "Great headset especially if you travel with your laptop since they fold. Loved them so much I bought them for all my staff. The price for them are also great. Mine has gone 4months of heavy use without any problems. I also think they sound great.",
            "title": "Great esp for travelers",
            "userName": "iclj"
        },
        {
            "date": "November 29, 2013",
            "rating": "5.0",
            "text": "Comfortable to wear and easy to use. Works with my IMac and with my husband's PC as well as my hard line phone. Great headset and great value for the money. Plantronics is a very good brand and I have used their products for many years.",
            "title": "Comfortable and Priced Right",
            "userName": "Amazon Customer"
        },
        {
            "date": "November 26, 2013",
            "rating": "5.0",
            "text": "Plantronics does it again. This is a very quality product. I've had it for almost two months now and I use it everyday. It has not let me down yet. I use a VOIP system and this headest gives me the quality and durability that I need. I can depend on it and that really matters to me since this is a work application.",
            "title": "Works well. Easy to use, no issues.",
            "userName": "I. Solutions \"P Diddy\""
        },
        {
            "date": "November 26, 2013",
            "rating": "5.0",
            "text": "Inexpensive and has been great! The mic is much more clear than my old one and I can hear very well also. Good buy.",
            "title": "Inexpensive and has been great!",
            "userName": "David Church"
        },
        {
            "date": "November 19, 2013",
            "rating": "5.0",
            "text": "Great headset! I use this headset nearly everyday for making outbound calls via Google Voice. It is perfect for what I'm using it for and the calls are crisp and clear.",
            "title": "Great headset!",
            "userName": "PKossow"
        },
        {
            "date": "November 16, 2013",
            "rating": "4.0",
            "text": "Delicious, its a great headset, and does what it needs to do, which is work properly. I say buy it!",
            "title": "It taste like it smells...",
            "userName": "John C Ritch"
        },
        {
            "date": "November 16, 2013",
            "rating": "5.0",
            "text": "This USB headset is great. Plug it in and the install is done automatically and your ready to chat, listen to music and play multiplayer games with your friends. The sound quality is great and I'm told the voice quality is great too.",
            "title": "Awesome",
            "userName": "Dame"
        },
        {
            "date": "November 14, 2013",
            "rating": "4.0",
            "text": "Works great, sound is quite good. Not sure I like the USB connector, though. Doesn't feel as versatile to me. No complaints about the quality of the product.",
            "title": "Good headset - Solid quality",
            "userName": "DebV"
        },
        {
            "date": "November 14, 2013",
            "rating": "5.0",
            "text": "I've been looking for a headset that works well on my small head, and works on both Windows and Mac. Since I have a Mac Pro (not Macbook, but the desktop variety) the mic input line is non-standard (well, an Apple standard). Having a USB connection is perfect for this combination of needs! I've used it twice now with great results. I can hear and be heard. It is a little tight so I wouldn't want to wear it all day, but I was quite comfortable during a 2 hour long Skype meeting.\n\nThe buttons on the cord are handy as well. There is a mute button, volume up/down buttons, and a skype answering button. I mostly use the mute button so far. Although it claimed to need software installed for the buttons to work on Windows, it worked for me without doing that (Windows 7).\n\nIt comes with a simple bag to keep it in, and folds up for travel. My husband has bulkier headphones that fold up to about the same size though, so I wouldn't buy this specifically for portability as it's not impressive in that feature. But, it's handier than having to carry it around in headphone shape, and they are quite light.",
            "title": "Great for video conferencing on Mac and Windows, wouldn't want to wear all day",
            "userName": "Megan Olsen"
        },
        {
            "date": "November 14, 2013",
            "rating": "5.0",
            "text": "So much nicer than my previous Microsoft and Logitech headsets. I use Skype for 2 hours daily using this thing, and it couldn't be more crystal clear. Plus everyone on the other end has commented on how much better I sound.",
            "title": "The headset to buy for constant Skype use.",
            "userName": "MV"
        },
        {
            "date": "November 13, 2013",
            "rating": "3.0",
            "text": "The inline controls for answer and volume up/down do not work with Google Voice calls. Because of this I haven't had reason to use them much.",
            "title": "Not for Google Voice.",
            "userName": "barefoot"
        },
        {
            "date": "November 13, 2013",
            "rating": "5.0",
            "text": "Easy to use, good sound quality, comfortable and adjustable. It's great for Skype/Google Hangout. I like that it connects via USB.",
            "title": "Pretty good quality for the price",
            "userName": "Alyssa Epstein"
        },
        {
            "date": "November 10, 2013",
            "rating": "5.0",
            "text": "This headset fits comfortably on my head. It is easily adjustable and the earpads are nice and soft. I love the way you can turn either of the pads away from your head. The mic is adjustable as well. I took the set out of the box and plugged it in and I was ready to go. My computer recognized the software right away. I use it in skype and my gaming with no problems with it on either end. I have been buying several headsets and this is the only one that has fit the bill. Great product.",
            "title": "Fits the Bill",
            "userName": "janan"
        },
        {
            "date": "November 3, 2013",
            "rating": "4.0",
            "text": "Good replacement for the plug type head phones. Particularly if your plug jack breaks. Decent sound quality, long enough cord. Little foam air baffle needs improvement as it tears and slips off.",
            "title": "Decent USB headphones.  Replaced broken plug type.",
            "userName": "Reddy Reviewer"
        },
        {
            "date": "November 1, 2013",
            "rating": "5.0",
            "text": "I bought this headset to use with Google Voice and it has excellent quality.\n\nThe only downside is that the Phone answer icon on the headset doesn't work with Google Hangout so you have to click on the answer button to accept calls. Volume up and down works fine as it should, with calls or videos.\n\nThe person on the other end said they couldn't tell the difference if I was on a land line or calling over VoIP. Hands free talking is a great benefit as well and the headset fit my large head no problem.\n\nFinally, this was plug and play on Windows 8.1, I just connected it to a free USB port and Windows found the driver and set it up.",
            "title": "Works great with Goolge Voice",
            "userName": "Nick"
        },
        {
            "date": "October 29, 2013",
            "rating": "4.0",
            "text": "Extremely comfortable to wear. I can easily wear all day long. I had compliments on how clear I sounded. Also nicely doubles for listening to music as they also sound great.",
            "title": "Comfort a+",
            "userName": "Brian T"
        },
        {
            "date": "October 29, 2013",
            "rating": "5.0",
            "text": "usb headphones have far better quality than headphone jack headphones. virtually replaced my phone, use for skype calls and recording.",
            "title": "Loud and clear.",
            "userName": "Jamie Ferro"
        },
        {
            "date": "October 27, 2013",
            "rating": "5.0",
            "text": "I am very satisfied with this product. People report that they hear me very well and the microphone does not pick up every little background noise. I have used it with both Skype and Google Talk. It is comfortable to wear and it arrived on time as promised.\nNote that Skype is killing off the API that allowed this product to work so well with Skype in December 2013.\n[...]",
            "title": "Great Product!  Timely Delivery!",
            "userName": "Kenneth Tower \"KT\""
        },
        {
            "date": "October 26, 2013",
            "rating": "4.0",
            "text": "Love this headset its easy to use and love the fact that its portable, the only thing i wish it could do is extend the sides a bit more.",
            "title": "Great headset but",
            "userName": "KARL PERALTA"
        },
        {
            "date": "October 25, 2013",
            "rating": "5.0",
            "text": "I use this headset for gaming and teamspeak on my computer. I dont have to shout to be heard and it picks my quiet voice up perfectly. The headphones are pretty comfy and are portable. They come with their own bag! I did not know that. It has a volume control on the headset with a mute button and a phone call button for Skype users. I find I have a tenancy to bump the volume button and end up muting my volume by accident. I also hit the mute button too and end up muting the mic. I love how the headset folds for easy storage and I love the long cord. I am very happy with this headset.\n\nUPDATE: The headset I received started glitching. The sound cut out intermittently in both ears simultaneously. They are shipping me a new one. I will keep you posted on how the replacement functions. I do have to say, Amazon was VERY fast dealing with the issue. They scheduled UPS pick-up of the defective headset (hey, it happens) and have already shipped the replacement with the whole process taking 5 minutes. I am VERY pleased right now at the ease and speed of all this.",
            "title": "Great for the PC",
            "userName": "slosson02"
        },
        {
            "date": "October 22, 2013",
            "rating": "5.0",
            "text": "They work great with our office phones, I bought the Amplifier Cord to go with it so folks can move while talking I will buy more in the future.",
            "title": "Headsets",
            "userName": "ltlbrt"
        },
        {
            "date": "October 21, 2013",
            "rating": "5.0",
            "text": "Recommended by a friend. Lightweight. Folds up. Comfortable. Great sound. Crystal clear recording. Nice big easy controls on the cord. Replaced a big heavy headset that was three times the money and not half the quality. (another brand)",
            "title": "Best for the Buck",
            "userName": "Jerry"
        },
        {
            "date": "October 19, 2013",
            "rating": "5.0",
            "text": "Bought this headset with microphone for my daughter who is studying in Italy because they could be shipped internationally. Her internally microphone and external microphone jack on her laptop cut in and out no matter what we tried. Decided to go with a USB microphone and bypass the mic jack. Ended up with a full headset instead of just the microphone due to other ratings, the need to ship to Italy, and product cost. These are great. We have had no problem on Skype when she uses this headset. Just what we needed.",
            "title": "Excellent for Skype",
            "userName": "Judith A. Kling \"JKling\""
        },
        {
            "date": "October 18, 2013",
            "rating": "5.0",
            "text": "This unit appears well constructed and has very clear sound quality. I bought them for teleconferencing and they work well for that application. I haven't evaluated them for music. Seems to be a very good product at a good price.",
            "title": "Very satisfied",
            "userName": "chuck"
        },
        {
            "date": "October 18, 2013",
            "rating": "4.0",
            "text": "EXcellent delievery time, well made, and the sound it great. Didn't think there was a microphone with it, but there is.",
            "title": "Great headset",
            "userName": "jacksrap"
        },
        {
            "date": "October 17, 2013",
            "rating": "4.0",
            "text": "Like just as describe, good feel looks good and works fine. If your looking for at this to purchase get its great.",
            "title": "Great",
            "userName": "Marivn Smith"
        },
        {
            "date": "October 8, 2013",
            "rating": "5.0",
            "text": "Audio quality is good, it's comfortable enough for business/travel purposes, and works great. I've been using it with MS Lync and am very happy with it. I'd definitely feel comfortable recommending this.",
            "title": "Works great with MS Lync",
            "userName": "47_MasoN_47"
        },
        {
            "date": "October 6, 2013",
            "rating": "5.0",
            "text": "Okay, first off, I'm not an audiophile. I was looking for an affordable, decent quality stereo headset with a USB connection, and this fit the bill. I use it primarily for skyping or listening to videos on my laptop, and it does just fine for that. I find it comfortable and easy to adjust, and the clarity of sound makes it easy for me to understand conversations (I have a minor hearing loss). Like the title says, it's perfect for what I need.",
            "title": "Perfect for What I Need",
            "userName": "Mississippi Ms"
        },
        {
            "date": "October 5, 2013",
            "rating": "3.0",
            "text": "This works great on my laptop and sure it would work well on a desktop. I needed it for online classes in a virtual classroom. The only feature that didn't work was the Mute for the microphone, I might have a defective unit but had no time to return and replace. Overall it was cost efficient and provided great sound and good voice quality return to the folks listening to me. I liked the inline control for listening volume and mic control, but my Mute didn't work.",
            "title": "Good Computer Headset",
            "userName": "Kevin"
        },
        {
            "date": "October 1, 2013",
            "rating": "5.0",
            "text": "I wasn't sure, due to the price. but when I got it.. I was very pleasantly pleased! These fit and work great.. sound is awesome with the USB conection and I am told the sound with my mic is also very good",
            "title": "Actually an AWESOME headset",
            "userName": "Lance Henderson"
        },
        {
            "date": "September 26, 2013",
            "rating": "5.0",
            "text": "This is a great product I absolutely love using it. It works great. You will not be disappointed with this product.",
            "title": "great product",
            "userName": "mom to 3 boys"
        },
        {
            "date": "September 24, 2013",
            "rating": "5.0",
            "text": "They work well and were a great bargain. Plug right in and start talkin'. Very clean sound in both directions.",
            "title": "Great Headphones Great Price",
            "userName": "Tim Ulman"
        },
        {
            "date": "September 24, 2013",
            "rating": "5.0",
            "text": "I have to use headphones very frequently and sometimes I have to attend meetings in noisy environments. It is embarrassing attend a meeting with a client in a noisy environment, the client can't hear me and he listens more noise than my voice, so I decided to try this product. I love it, the background noise is almost completely removed and my voice enhanced. The CALL button doesn't work with Skype as the announce says but it doesn't matter to me, I bought this product because my need was good audio and good voice, removing noise from environment, I almost don't remember I have this button.\n\nI have to mention this headphones work fine with my Mac Mini as well.",
            "title": "Clear audio and clear voice",
            "userName": "Alexis"
        },
        {
            "date": "September 23, 2013",
            "rating": "4.0",
            "text": "It works well, sound is good, the only thing that could have been better for me is less pressure on my ears and a little bit more extension or is my head too big?",
            "title": "works well",
            "userName": "Marcel"
        },
        {
            "date": "September 20, 2013",
            "rating": "3.0",
            "text": "Overall, it does its function but next time, I'll probably just avoid the cheaper, overhead headset style in the first place.\n\nPros:\n- Comes in a nifty protective case\n- Audio functions well as you'd expect\n\nCons:\n- Doesn't stay in place unless it's entirely resting on your head, flattening your hair. Occasionally slips off your ears",
            "title": "Audio is good, but it doesn't fit on your head well",
            "userName": "Mark"
        },
        {
            "date": "September 19, 2013",
            "rating": "4.0",
            "text": "Great headset all around. Sounds great; no voice cutouts. Very comfortable. The microphone does not stick out in front of your face like some other headsets. The one negative is that it does have wires coming off of both earpieces instead of just one, but it works so great I don't care.",
            "title": "Excellent Headset",
            "userName": "Scott G."
        },
        {
            "date": "September 17, 2013",
            "rating": "4.0",
            "text": "I'd been looking for a headset which I could use for recording as well as Skype calls and had been turned off by some of the high prices I was seeing online. Then I found this gem and my life has never been the same. It produces great recordings without background noise and handles phone calls well. I highly recommend it for those who are on a budget but still need to produce quality recordings. One note: it does pick up fan noise in the background so if you have one, turn it off during recordings. Other than that, this headset is great!",
            "title": "Works like a CHARM",
            "userName": "SleepingAngel"
        },
        {
            "date": "September 16, 2013",
            "rating": "3.0",
            "text": "The size of this headset is ideal for traveling and the sound quality is quite good. I just wish the control switch would be a little further away from the headphones themselves. Grabbing the controls and using them feels awkward to me and doesn't allow for my arms to be in a natural position. It may sound strange but I've had other larger, bulkier headsets for desktop use that were very comfortable to use the switch and it makes a big difference.\n\nOverall, especially for the cost and size, the headset is a good choice for frequent travelers.",
            "title": "Poor placement of control switch",
            "userName": "Tim B."
        },
        {
            "date": "September 15, 2013",
            "rating": "5.0",
            "text": "Feels light and okay shaped on the head, feels reasonably sturdy while wearing it. The speakers have good clear basic sound. It folds up neatly in the carry bag. USB connection suits it for my laptop.",
            "title": "great headset",
            "userName": "Heather Gladney"
        },
        {
            "date": "September 15, 2013",
            "rating": "3.0",
            "text": "Two different computers, two operating systems (Ubuntu and Windows 7), same problem. The headset pops and clicks unless you hold your head rock-steady. Guess some internal connection is not very good.",
            "title": "Clicks and pops",
            "userName": "Alexandre Emelianov"
        },
        {
            "date": "September 13, 2013",
            "rating": "5.0",
            "text": "My office is eliminating desk phones and moving everyone to Lync voice services integrated with the phone system. Since I was a pilot user, I'm already there. Also, we can be reimbursed up to $50 for a headset. Wanted a USB headset since they seem to be truly plug-n-play and one that would travel well, since I often work from home. This product fits the bill with good sound quality and no fuss set up. Have recommended to fellow cube-mates.",
            "title": "Good price, good product.",
            "userName": "Emy R."
        },
        {
            "date": "September 13, 2013",
            "rating": "5.0",
            "text": "I love my Plantronics headset. I was a switchboard operator for over 50 years and I know that Plantronics has the quality. I had a hard time hearing some of the websites I visited. Now, no problem. I love the stereo feature especially when I listen to the music. Excellent product. No doubt about.",
            "title": "This stereo headset is a dream",
            "userName": "Nancy Keeler"
        },
        {
            "date": "September 9, 2013",
            "rating": "5.0",
            "text": "I only tried this out before sending to my son overseas. He wanted this to use with Skype.\nI wanted to make sure they worked and they seem like a very good quality with good sound quality.",
            "title": "Nice Sound",
            "userName": "C. Vinson"
        },
        {
            "date": "September 5, 2013",
            "rating": "5.0",
            "text": "I was stunned by how good these are, both mic and headphones, especially for the price. You shouldn't plan to use them for music, but I couldn't be more pleased with using them for in game chat via team speak.",
            "title": "Ridiculously good for the price",
            "userName": "Bruce A. Coletta Jr."
        },
        {
            "date": "September 5, 2013",
            "rating": "4.0",
            "text": "The audio for both the headphones and mic are great. It travels well, but it's not the most comfortable. It may get better after it breaks in a bit though.",
            "title": "Great Quality",
            "userName": "Jeremy Spohn"
        },
        {
            "date": "September 2, 2013",
            "rating": "4.0",
            "text": "Good fitting headset. Great sound and mike volume. The set is amust have for the work at home client or office work here a headset is part of the daily routine.",
            "title": "This headset is winner!",
            "userName": "Frederick Matthews"
        },
        {
            "date": "August 28, 2013",
            "rating": "4.0",
            "text": "It is okey for my requirements!! I would like to suggest to buy this one.. Good sound and no pain in ear.",
            "title": "It is okey for my requirements!! I would like to suggest to buy this one.. Good sound and no pain in ear.",
            "userName": "sathishkumar"
        },
        {
            "date": "August 26, 2013",
            "rating": "5.0",
            "text": "The price is right, it does a great job, is light and sensitive and mild room noise doesn't affect its efficiency. I would recommend it and would buy another one if the need arises.",
            "title": "Great computer headset",
            "userName": "toocal"
        },
        {
            "date": "August 26, 2013",
            "rating": "4.0",
            "text": "Bought for another department that liked the product very much.\nThe quality is good for what they needed and they work just fine.",
            "title": "Bought for another department",
            "userName": "Sherrill Flohaug"
        },
        {
            "date": "August 24, 2013",
            "rating": "4.0",
            "text": "Microphone filters out noise from surroundings. Gives decent sound for telephony, movies and music. Headset is comfortable and does isolate from ambient sound better than lighter headsets.",
            "title": "Works well",
            "userName": "Hassan Alam"
        },
        {
            "date": "August 23, 2013",
            "rating": "5.0",
            "text": "Convenient to use with laptop. Its clear sound. I use it to go on conference call and no complains from the other party as they can hear me clear.",
            "title": "Convenient",
            "userName": "rizza albano"
        },
        {
            "date": "August 22, 2013",
            "rating": "5.0",
            "text": "Great sound, comfortable fit. I use with Cisco IP Communicator on a Dell Latitude and am very happy with the product.",
            "title": "Fantastic",
            "userName": "C. Murray"
        },
        {
            "date": "August 20, 2013",
            "rating": "5.0",
            "text": "Nice, came through with all it said it was going to deliver, picks up on my old worn out laptop to the best delivery of sound and great\nfor listening",
            "title": "Love them great value$$$",
            "userName": "Theresa K."
        },
        {
            "date": "August 19, 2013",
            "rating": "5.0",
            "text": "I'm no sound quality snob but these sound really good to me. My headphone jack stopped working and one of my speakers broke on my laptop. This USB headset works great for me.",
            "title": "Great sound for price",
            "userName": "Pablo Escobar"
        },
        {
            "date": "August 18, 2013",
            "rating": "4.0",
            "text": "I bought this for making VoIP calls through my computer, and it does the job adequately. I did not have any problems with compatibility - Windows recognized it without an issue. The volume and mute buttons on the cord are a nice touch, and the cord is thinner and much more flexible than on the Logitech headset I also own, resulting in less noise being transferred into the headset when I move. The comfort and sound quality are adequate but not great. The foam pads make my ears sweat after a while, which is a problem I don't have with headphones that fit around the ear rather than on it.",
            "title": "Reasonable performance at a decent price",
            "userName": "BG"
        },
        {
            "date": "August 18, 2013",
            "rating": "4.0",
            "text": "Good overall functionality however I was disapointed in the audio, all calls sounded very hollow. With technology today the audio should be better.",
            "title": "Plantronics Audio 478 USB Headet",
            "userName": "Chris Maletick"
        },
        {
            "date": "August 17, 2013",
            "rating": "4.0",
            "text": "These headphones work well so far. Sounds quality is decent, earpieces are comfortable. Time will tell if they're durable enough.",
            "title": "So far so good",
            "userName": "Melissa Summers"
        },
        {
            "date": "August 17, 2013",
            "rating": "5.0",
            "text": "very good option for cheap gaming headsets which are not too large or heavy. I hate the big headsets which cover the ears completely so these are a perfect fit for me",
            "title": "good product. works excellent",
            "userName": "Anay Paranjapye \"dhaboo9\""
        },
        {
            "date": "August 15, 2013",
            "rating": "5.0",
            "text": "First headset and mike combination, and I am very surprised at the quality of the sound in this unit!!! Very pleased. Fast shipping, overall great experience.",
            "title": "Great Sound!",
            "userName": "LFGEnergy"
        },
        {
            "date": "August 7, 2013",
            "rating": "5.0",
            "text": "I use it for recording software demos, internet calling and online meetings and webinars and MS Lync. Crisp, clear sound. Simple, basic buttons. I went to their site and downloaded the latest Plantronics free software. Worked first time with no issues. Thanks!",
            "title": "Great sound quality and features for a very affordable price",
            "userName": "Christine"
        },
        {
            "date": "August 5, 2013",
            "rating": "5.0",
            "text": "I purchased the Plantronics audio 478 stereo headset to support voice recognition software that I purchased with it. It fit the bill perfectly. The only thing that would be better is if it had a little clip on the cord to stabilize the it.",
            "title": "Excellent fidelity",
            "userName": "Mickey Sarver"
        },
        {
            "date": "August 4, 2013",
            "rating": "5.0",
            "text": "They are very comfortable and I can wear them for a long time without them hurting my ears or head. I use them for Skyping and Dragon Naturally Speaking Software. They work great!",
            "title": "Great Headphones",
            "userName": "Sharr65"
        },
        {
            "date": "August 2, 2013",
            "rating": "5.0",
            "text": "I bought this for a special video recording project and was very pleased with the sound quality on both the earphones and the microphone.",
            "title": "Good quality all around",
            "userName": "William B. Hurlbut"
        },
        {
            "date": "July 30, 2013",
            "rating": "5.0",
            "text": "Use with Google Voice all the time. Works very well according to folks on the other end of calls. I inquired with the first 100 cal recipients. I also use it daily for domestic conference calls without issue. This may be more a tribute to GVoice but the headset counts too right!",
            "title": "Good Headset",
            "userName": "J. A. LeBeau \"Jalo\""
        },
        {
            "date": "July 28, 2013",
            "rating": "5.0",
            "text": "I used this headset for 1 whole week for online training and I can't complain a bit about anything. It worked great and did not cause any discomfort with long-time use.",
            "title": "Great product for the price",
            "userName": "Brian"
        },
        {
            "date": "July 24, 2013",
            "rating": "4.0",
            "text": "Originally bought by my husband for PS3, but didn't work with our system. My son uses them for computer gaming and loves the sound quality.",
            "title": "Son loves it",
            "userName": "KBkat"
        },
        {
            "date": "July 24, 2013",
            "rating": "5.0",
            "text": "This headset does exactly what it is suppose to do. It cancels background noise and the controls are very convenient and easy to use.",
            "title": "Great headset",
            "userName": "Mika Safford \"Mika\""
        },
        {
            "date": "July 23, 2013",
            "rating": "5.0",
            "text": "The headphone has a fantastic sound quality and good noise cancellation. With its simple design, its easy to store. I would recommend gamers to use it too!!",
            "title": "great quality",
            "userName": "williamchua"
        },
        {
            "date": "July 20, 2013",
            "rating": "5.0",
            "text": "So far, I'm very pleased with this headset. It folds up and transports easily. The sound quality is very good in both directions.",
            "title": "Lightweght, good voice quality",
            "userName": "James Russo"
        },
        {
            "date": "July 19, 2013",
            "rating": "5.0",
            "text": "All my history of Plantronics devices have been positive and this headset did not disappoint. It is not audiophile quality, but it is comfortable to wear, sound quality good and voice quality is good. The headband is adjustable and the mic arm rotates up and down, but does not flex. I really like the mute and volume controls on the cable. The USB makes this PnP, no set-up required with Win7. I also like the earpads are foam and do not surround the ear because I want to be able to hear some periphreal sounds. It does not have a foam windscreen for the mic, but no one I have spoken with has made comments to indicate I would need it. I use this at home, but could see where the ability to fold and carry would be a benefit for someone that wanted to use their own personal headset at work versus one supplied by the employer.",
            "title": "Solid Equipment for Daily Use",
            "userName": "D.R."
        },
        {
            "date": "July 14, 2013",
            "rating": "5.0",
            "text": "The price and quality is well worth it. The noise cancelling is excellent. Works great for Skype. Not as comfortable as others, but for the price and sound quality is definitely worth it. This is compact and easy to carry when travelling. Worth the small size to sacrifice some comfort.",
            "title": "Great Sound Quality",
            "userName": "R. Smith"
        },
        {
            "date": "July 13, 2013",
            "rating": "5.0",
            "text": "I have tried many headphones for talking over skype. This one has had the clearest call quality. Built in call controls are a bonus.",
            "title": "Works Amazing",
            "userName": "Lynn Call"
        },
        {
            "date": "July 11, 2013",
            "rating": "4.0",
            "text": "I've used a wide variety of soft phone headsets and the Plantronics is the best one for under $40 I've found.",
            "title": "Perfect value soft phone headset",
            "userName": "Kristofer Fitzgerald"
        },
        {
            "date": "July 11, 2013",
            "rating": "5.0",
            "text": "I love this headset, the quality is great! I love listening to music through them, no crackling and good base actually! The people I talk to over Skype say they can hear me really clearly! Very happy with this product, would recommend!",
            "title": "This thing is amazing!",
            "userName": "luke"
        },
        {
            "date": "July 9, 2013",
            "rating": "4.0",
            "text": "Has good pickup and doesn't sound tinny.\nNot as good for audio listening, but the mic works great!\nWould recommend for recording and using on skype.",
            "title": "Works well",
            "userName": "R. Vogelsang"
        },
        {
            "date": "July 6, 2013",
            "rating": "4.0",
            "text": "Recommended by my IT department. I have lots of compliments on the sound quality. They are not heavy and I love the volume and mute buttons.",
            "title": "Plantronics Stereo USB Headset",
            "userName": "MIGirl1957"
        },
        {
            "date": "July 4, 2013",
            "rating": "5.0",
            "text": "Great product. Speech recognition has very low error rate (although a lot depends on how well you train your computer). I fly rarely and am not an audiophile, so the sound quality is very acceptable. The set is highly adjustable. It's easy to flip around for mic to be on either side, and to rotate up out of use when just listening. And here's a bonus for the visually challenged - it is left/right agnostic, so you don't have to hunt for the tiny and fiendishly hidden L or R to determine which way to put it on. It folds up very compactly (fits easily into laptop case). I like the separate wire to each eaprpiece design. The USB dongle is compact, unlike the oversized ones that are common in many models. The cord is generous in length, so it works well with desktops that might be several feet away. I deduct half a star on one account only - the top of the headband is square rather than round, so if you prefer a close fit, the weight is transferred to your skull by one one hard plastic, dime-sized spot. A little foam strip applied here makes a huge difference, easy to add on. I like it so well that I have one for office and one at home.",
            "title": "Great performer, 4 and a half stars (Senior Citizen reviewer)",
            "userName": "ChamisaLady"
        },
        {
            "date": "July 1, 2013",
            "rating": "5.0",
            "text": "This is a great little headset, especially for the price. It's lightweight and snug, easy to forget you're even wearing it. Music sounds GREAT coming through this headset. I also use it for speech recognition when I write. Very happy with this headset!",
            "title": "Just what I was looking for",
            "userName": "Dj Wells"
        },
        {
            "date": "June 25, 2013",
            "rating": "4.0",
            "text": "I just got this today, and I must say I quite like it. It was easy to install the software needed to use the Skype buttons, and it was also easy to download the software that needed to be installed upon plugging the device into my USB port. It was definitely easy to get out of the package.\n\nThe sound isn't all /that/ fantastic, but for a $25 headset, it's pretty decent. The buttons work fine, too, and people seem to be able to hear me alright.\n\nMy only complaint is that the earphones do get uncomfortable on your ears (not unbearably so; it's more just a warm sensation on your ears that eventually gets uncomfortable).\n\nOther than that, this is a pretty good product.",
            "title": "Audio 478",
            "userName": "Alanna Snyder"
        },
        {
            "date": "June 25, 2013",
            "rating": "5.0",
            "text": "These have been excellent and are just want I was after. They work great with the software I am using.",
            "title": "Excellent headset for the software I am using",
            "userName": "Clinton Harris \"Pacus\""
        },
        {
            "date": "June 24, 2013",
            "rating": "5.0",
            "text": "Good service, good product, everything I expected. I use it to make phone calls through Google talk, works perfect with no setup issues.",
            "title": "Good product",
            "userName": "Bruce K."
        },
        {
            "date": "June 8, 2013",
            "rating": "5.0",
            "text": "This is an inexpensive headset, that I use with Skype and with Dragon Dictate. It works great for both, and the fact that it folds makes it easy to travel with. I've tried more expensive headsets that don't work as well. The earpieces are sufficiently padded, and the microphone is sensitive enough but not overly so. The controls on the cable work well and make it easy to mute the audio or adjust volume without returning to the computer. Recommended!",
            "title": "Great Headset for Skype",
            "userName": "T. Bragg"
        },
        {
            "date": "June 7, 2013",
            "rating": "5.0",
            "text": "Three of these headsets were purchased for faculty to use during their presentations for a webinar. Two out of the three used the headset during the webinar. Although I can't speak for the faculty on how they felt about the headset, I was able to understand them crisply and clearly. The volume was also excellent. I can compare the headsets as well to the one faculty who did not use his headset. He used his computer speakers and mic and his voice sounded muffled. Not crisp and clear as the others using the headset.\n\nI will be placing an order for 6 more sets for the remaining 2013 webinars on the schedule. Hope this helps.",
            "title": "Worked well on the listening end",
            "userName": "A Payton"
        },
        {
            "date": "June 4, 2013",
            "rating": "5.0",
            "text": "I had almost given up using Dragon Naturally Speaking. When I started using the Plantronics audio 478 it cleared up all of my issues. As a matter of fact I'm using it right now. I highly recommend this product.",
            "title": "Does the job",
            "userName": "H. V. Hoechten \"Inspector1\""
        },
        {
            "date": "May 31, 2013",
            "rating": "5.0",
            "text": "I like how this fits. Comfortable after extended use. Controls are obvious and easy to use. Love the long cord too.",
            "title": "Great product",
            "userName": "D. Briddle"
        },
        {
            "date": "May 31, 2013",
            "rating": "4.0",
            "text": "I use it daily with my laptop for teleconferencing. The pricing for the product is good, and it folds and stores easily.",
            "title": "Great product that met expectations",
            "userName": "Jeff A."
        },
        {
            "date": "May 29, 2013",
            "rating": "5.0",
            "text": "We recently switched over to VOIP phone service and were in need of a handful of headsets to make the change. We are all very happy with the cost and quality of these headsets and would recommend them to anyone else who would be seeking a product such as this.",
            "title": "Great product at a great value",
            "userName": "Neal Glazebrook"
        },
        {
            "date": "May 21, 2013",
            "rating": "5.0",
            "text": "Working from home, I needed a superior headset. My original Logitech set is now by backup set, and Platronics Audio 478 Stereo USB Headset has become my full time set. I can lower or raise the volume on the headset, as well as mute. It fits comfortably and the sound is wonderful. I am truly enjoying using it and have actually begun using it to listen to anything (movies on Netflix, for example) when I want great sound.",
            "title": "Platronics does the job!",
            "userName": "Sally Seashells \"Loves Movies\""
        },
        {
            "date": "May 17, 2013",
            "rating": "4.0",
            "text": "Works great, the only think I don't like are the cords come from both sides under my chin.\nI feel like I am wearing a birthday hat or a bonnet.\n\nThey should have made the cord come out of only one side.",
            "title": "Sound and install very good",
            "userName": "mark"
        },
        {
            "date": "May 15, 2013",
            "rating": "5.0",
            "text": "This is my third pair of Plantronics USB headsets. They work great, but you'll need to download their software to boost the volume on OS X.",
            "title": "Well made, good sound quality",
            "userName": "R. Brueckner \"Flex Rex\""
        },
        {
            "date": "May 10, 2013",
            "rating": "4.0",
            "text": "I've gone through several headsets in the past few years, none of which traveled well and sounded good (on the receiving end)at the same time. The Plantronics 478 is the exception and is the first headset that I really like. The headband folds nicely into its pouch, so it travels well enough; the sound is good enough for listening to movies and music; and the microphone is pretty clear and crisp. Oh, and the Skype-minded volume and off controls is a nice extra. The only downside to this product is that its a little flimsy. But for the price, that's understandable.",
            "title": "Good value and sound",
            "userName": "laptophobo"
        },
        {
            "date": "May 1, 2013",
            "rating": "4.0",
            "text": "I was able to use it to communicate via Skype on an eight year old PC using a USB port.",
            "title": "Worked well as expected",
            "userName": "Dhani S."
        },
        {
            "date": "April 29, 2013",
            "rating": "5.0",
            "text": "So far I'm really liking these. They fold up nice and the audio quality from both the headphones and the mic are pretty good.",
            "title": "Nice setup",
            "userName": "MW"
        },
        {
            "date": "April 28, 2013",
            "rating": "5.0",
            "text": "I bought these because the price is very low for a company like Plantronics. I use it for Skype calls. So far everyone has commented how much better I sound now. So the microphone seems very high quality.\nThe sound I hear is very clear, distinct, and it's so much easier to understand the other party. Most my calls are overseas to non-English speaking countries. It's actually easier to understand them now.\n\nSo these are unbeatable for VoIP, gamers, and business people looking for an extremely high quality headset to make calls with.\n\nThe other surprise is how nice they sound listening to music. These are no Fostex TH-900's but with a little equalization, they actually sound pretty good.\n\nThey fold up nicely for travel, and have nice inline controls. Note, when muted, the mute button lights up red. A small detail but makes a big difference to know you're muted.",
            "title": "Wow, way better than I expected",
            "userName": "ShadySprings"
        },
        {
            "date": "April 23, 2013",
            "rating": "4.0",
            "text": "This headset has worked well. The sound quality is great for phone calls and no one has complained about the quality of hearing me, so I assume the microphone works well too. It is comfortable to wear.",
            "title": "Comfortable and good quality",
            "userName": "PepperHawk"
        },
        {
            "date": "April 20, 2013",
            "rating": "4.0",
            "text": "Good quality for use on the laptop with Google voice or Skype. Callers can hear clearly and the headset limits background noise and distractions while engaged in conversation.",
            "title": "nice for the laptop",
            "userName": "Jonesy"
        },
        {
            "date": "April 20, 2013",
            "rating": "4.0",
            "text": "Enjoying the product - good sound quality and function. A little disappointed with the calling button - it doesn't work on google phone.",
            "title": "Like - good sound quality!",
            "userName": "Herbert S. Ferguson"
        },
        {
            "date": "April 19, 2013",
            "rating": "5.0",
            "text": "Great sound from a reasonably priced product! Integrated without difficulty to my computer. A very satisfied customer. As I usually use a headset for gaming, it is great",
            "title": "Great sound",
            "userName": "T. Topper"
        },
        {
            "date": "April 16, 2013",
            "rating": "5.0",
            "text": "I've had a couple of Plantronics headsets, always liked them better than the Logitech stuff. Works without problems, comfortable and light. Good mic and sound quality as well.",
            "title": "Great headset!",
            "userName": "T. Davis"
        },
        {
            "date": "April 16, 2013",
            "rating": "5.0",
            "text": "My gaming friend said that he wants to cry tears of joy whenever he hears my voice because it makes him so happy. I had a very crappy headset before and this is a million billion times better. Cheap enough where I could afford it, but good quality. I also love the feature that you can download the skype download from the website and answer calls with the keypad. Awesome. I have recommended it to others already.",
            "title": "great sound",
            "userName": "kalpal"
        },
        {
            "date": "April 16, 2013",
            "rating": "5.0",
            "text": "I bought this to use with my Dragon Naturally speaking software, not realizing that the software came with its own set of headphones. I'm glad I purchased these anyway because I like them better than those that are included. Very clear sound, almost never misses a word (and I have a STRONG Texas accent), works like a charm. No complaints",
            "title": "Great!",
            "userName": "Pickylady"
        },
        {
            "date": "April 6, 2013",
            "rating": "4.0",
            "text": "Plugged in the first time and worked withing seconds (after the driver was loaded). The sound is clear, and the mic works well. I am pretty pleased. My only reason for not giving 5 starts is the adjustment for larger heads just isn't there - so the device is a bit snug and not sure I would be able to wear for long periods of time.",
            "title": "Works great, just a bit snug on my head",
            "userName": "R. Johnson"
        },
        {
            "date": "April 6, 2013",
            "rating": "5.0",
            "text": "Everything is fine and works well. It even came a little earlier than expected. The price was reasonable for this product.",
            "title": "Everything came in as was expected",
            "userName": "Dawn Duncan"
        },
        {
            "date": "April 2, 2013",
            "rating": "5.0",
            "text": "I give the Plantronics Audio 478 a five star rating, as it is an all around usb headset that is easily connected in windows 7, and it's attributes are many. It is actually comfortable to wear, audio is clear as can be, and callers say it is crystal clear when talking to them. I really like the mute button also.",
            "title": "Headset that compares to the more expensive...",
            "userName": "Ron Ramsey"
        },
        {
            "date": "March 29, 2013",
            "rating": "4.0",
            "text": "really like this headset they are really clear when talking to someone else or listening to music. Im really satisfied with this headset.",
            "title": "crisp and clear",
            "userName": "Kristianandreas"
        },
        {
            "date": "March 29, 2013",
            "rating": "4.0",
            "text": "Not much to say. It works and because I require 14 more words I'l repeat that it works. Now my review is done.",
            "title": "Great sound reasonable price",
            "userName": "Glen"
        },
        {
            "date": "March 28, 2013",
            "rating": "4.0",
            "text": "comfortable for extended use. Great for use with voice programs like teamspeak and ventrilo. Microphone picks up voice cleary without picking up background sound and in line controls make it easy to adjust volume. The plug and play worked great with windows 7",
            "title": "Great for the price",
            "userName": "moshi"
        },
        {
            "date": "March 24, 2013",
            "rating": "5.0",
            "text": "Works great. I don't have to hold down on the mute button like I did with my old ones. Sound is good and the headset is comfortable.",
            "title": "Headset works great!",
            "userName": "Lawrence E. Lopez"
        },
        {
            "date": "March 18, 2013",
            "rating": "5.0",
            "text": "This was my 2nd attempt at a USB headset. First one from Logitech was a disaster. These, however, meet all my expectations. Sound quality is superb. Functionality is good -- with inline volume control and mute options.",
            "title": "Great value and functionality",
            "userName": "MBWillo"
        },
        {
            "date": "March 9, 2013",
            "rating": "5.0",
            "text": "These are great. The headphones don't filter out ambient noise around you when you're working/talking which is my only complaint.\n\nI use them for consulting and group conference calls with Skype and GoToMeeting on a Macbook Pro, and the programs recognize them no problem. People hear me crystal clear, and the background noise is filtered out for them, which is the most important thing.\n\nBonus: They fold up nice and come with a nifty little pouch!",
            "title": "Great sound, microphone filters out background noise for working in busy environments",
            "userName": "S. COLOMBO"
        },
        {
            "date": "March 8, 2013",
            "rating": "5.0",
            "text": "Good quality, bash proof, useful mute feature.\n\nI travel with them and use them a lot.\n\nThe quality of the sound is good, plenty good enough for phone calls and speech anyway",
            "title": "Still using it after 2 years",
            "userName": "D. Ashforth \"Smash\""
        },
        {
            "date": "March 7, 2013",
            "rating": "5.0",
            "text": "These are replacing some phones I bought here for ~$11. After a month they lost one channel caused by an irreparable cold solder joint on the circuit board. These are much better built. A little tight on the head but I've used them for 90 minute Skype calls without a problem.",
            "title": "Worth pay that little extra",
            "userName": "Rob Meadows"
        },
        {
            "date": "March 4, 2013",
            "rating": "5.0",
            "text": "works well on SKYPE -the price is right- would recommed for audio on a computer system -comfortable fit -a buy",
            "title": "good headset",
            "userName": "G. McCausland"
        },
        {
            "date": "March 1, 2013",
            "rating": "4.0",
            "text": "I use it for inter-office communication. My team is in two states and we find this headset is suited for team meetings.",
            "title": "Good for team meetings",
            "userName": "Siri Krishna Prudhivi \"siri\""
        },
        {
            "date": "February 23, 2013",
            "rating": "5.0",
            "text": "Great clarity. Doesn't hurt your head/ears to wear it. I would buy it again. Works great. Very happy I bought this one.",
            "title": "Great headset",
            "userName": "Stephanie Burns"
        },
        {
            "date": "February 18, 2013",
            "rating": "4.0",
            "text": "I ordered this headset to use with Skype and it works great. Sounds good, and the microphone works well. I would recommend this product.",
            "title": "Just what I needed",
            "userName": "Liza Jane"
        },
        {
            "date": "February 16, 2013",
            "rating": "5.0",
            "text": "Plugged it into my Windows 8 PC and fired right up. Sound quality is good, person on the other end has not complained.",
            "title": "Easy to use",
            "userName": "James E. Truchon \"Jim\""
        },
        {
            "date": "February 9, 2013",
            "rating": "4.0",
            "text": "The product came on time. The wrapping was perfect. The product fits my head without pressure after adjustments. My only complaint is that the Skype button does not work.",
            "title": "Excellent sound for the money",
            "userName": "Pedro Bermudez"
        },
        {
            "date": "February 5, 2013",
            "rating": "5.0",
            "text": "Very good headset, am very pleased, works extremely well.\nWill order the Plantronics Audio 478 again if I should ever need an additional one",
            "title": "Plantronices USB headset",
            "userName": "jd"
        },
        {
            "date": "January 20, 2013",
            "rating": "4.0",
            "text": "My wife uses it to Skype with her children overseas. She finds that they fit more snugly than her previous headphones and that it is much easier to hear the Skype conversation",
            "title": "Good value",
            "userName": "Bob"
        },
        {
            "date": "January 18, 2013",
            "rating": "5.0",
            "text": "It appeared to work plug and play on my Windows 7 laptop. But microphone was very low, un-usable low. None of the control button work either.\n\nI went to download and installed Plantronics Spoke, it include a driver for the headset. ([...])\n\nIt now works perfectly. I can wishper still beeing heard perfect on the other side. Control buttons work too.",
            "title": "Excellent, make sure you install Plantronics driver.",
            "userName": "N. Trinh"
        },
        {
            "date": "January 15, 2013",
            "rating": "5.0",
            "text": "I am very pleased with this product. It works flawlessly. Good sound quality and noice cancellation is quite effective. Would consider other products from Plantronics.",
            "title": "Plantronics headset",
            "userName": "lighthousebeach"
        },
        {
            "date": "January 14, 2013",
            "rating": "4.0",
            "text": "I use this on my MacBook for Skype calls. I'm very pleased to date. I don't think it would be very good for music.",
            "title": "Good For Skype",
            "userName": "E. Collins"
        },
        {
            "date": "January 13, 2013",
            "rating": "5.0",
            "text": "GREAT Product...GREAT Price...5 STAR ***** EVERYTHING !!! Was an absolute pleasure doing business and I will be back for more purchases I HIGHLY recommend. Thanks a MILLION.",
            "title": "GREAT!",
            "userName": "Jerry L. Yzquierdo"
        },
        {
            "date": "January 2, 2013",
            "rating": "5.0",
            "text": "I used to have a different brand, Logitech, everyone I connected with on skype and other games voi would complain/yell at me about the horrible noises and sound bleeding over my voice and terrible static, and they could hear me even if it was on mute! I noticed the logitech drivers were about 5 years old *gasp* and they have never been updated. I was so disgusted with my old product (desperate even), that I tried these, THEY FIXED everything! The sound is wonderful, the controls are handy, the drivers are up to date. No more noise to the people I connect too. I definitely will stick with this brand in future. Thank You Thank You!",
            "title": "Great Product.  Perfect for Skype and Online Gaming",
            "userName": "Lisa"
        },
        {
            "date": "December 28, 2012",
            "rating": "4.0",
            "text": "Purchased to use on skype and these headsets are awesome. Very easy to use and have great sound. They are usb so I can only use them on my laptop and not on my phone.",
            "title": "great sound and easy to use",
            "userName": "Farrah Benoit"
        },
        {
            "date": "December 26, 2012",
            "rating": "5.0",
            "text": "Worked with everything and multiple operating systems,window XP, Vista, and Windows 7. I have brought several and this one is the best so far. Its well worth the money and well built for the price definitely a keeper will buy another when this one give out.",
            "title": "Without A Doubt A Keeper!!",
            "userName": "Rainy"
        },
        {
            "date": "December 23, 2012",
            "rating": "5.0",
            "text": "I love the in-line mute, volume and receiver on/off functions. The cord is mid-length - not too long, not too short. Sound is good. Excellent value.",
            "title": "Comfortable and works well",
            "userName": "onlinegal"
        },
        {
            "date": "December 21, 2012",
            "rating": "5.0",
            "text": "And a good fit... Thought it might be bulky but it's not. I'm still wavering a bit on the Dragon software.",
            "title": "Great sound...",
            "userName": "Rita L"
        },
        {
            "date": "November 11, 2012",
            "rating": "5.0",
            "text": "Nice USB headset that always works. Mute button lights up so I know when I'm muted. It would be nice if there were a clip on the control box to clip it to my shirt so it isn't flapping around.",
            "title": "Nice quality, always works",
            "userName": "K. Ford"
        },
        {
            "date": "November 9, 2012",
            "rating": "5.0",
            "text": "Arent we all on a BUDGET these days, but I have had so many PLANTRONIC products, but I had never purchased anything in this line. I recently started using my VOICE RECOGNITION Software and I find a Microphone that is close and filters out back ground noise makes it so much more ACCURATE and Plantronics has such an AWSOME product for the PRICE. AWSOME sound quality!",
            "title": "WOW what a BARGAIN!",
            "userName": "Michael"
        },
        {
            "date": "October 16, 2012",
            "rating": "5.0",
            "text": "Awesome product, I just loved it!! Practical, not heavy, high audio quality, it contains a small bag to keep it clean, comfortable. Excellent price, a perfect investment, recommended 100% =)",
            "title": "Plantronics Audio 478 Stereo USB Headset (Audio 478)",
            "userName": "F. MURIEL \"Fabiola\""
        },
        {
            "date": "October 7, 2012",
            "rating": "5.0",
            "text": "Review for: Plantronics Audio 478 Stereo USB Headset (Audio 478)\n\nHeadset quality test based on:\n- Using skype (voice over internet protocol) VOIP.\n- Music mp3.\n- Youtube video.\n\nPros:\n1) Sound clarity for receiving end of my voice: indistinguishable from a landline connection.\n2) Sound clarity for sending end (my end): indistinguishable from a landline connection.\n3) Comfortable, rotatable ear pieces to conform to geometry of side of the head and adjustable height; well\n designed and functional.\n4) Works well on PC and Mac.\n5) For PC, the four button dial module on the cord is fully functional.\n6) Microphone boom rotates (left or right side) out of the way for using the headset to listen to music.\n7) Microphone boom can bend to modify proximity of microphone to mouth.\n8) Headphones fold up compactly and can be stowed in carry pouch provided.\n\nCons:\n1) Mac (iMac G5) software is not provided for OS 10.4.11. On four button dial module on cord of headset\n plugged into the iMac G5:\n call answer/end button: non functional\n volume increase: functional\n volume decrease: functional\n mute: functional\n (Note: If need to end the call then just use the computer into which this headset is plugged)",
            "title": "Plantronics Audio 478 Stereo USB Headset works well for Skype",
            "userName": "Owner Review"
        },
        {
            "date": "September 29, 2012",
            "rating": "5.0",
            "text": "I love the fact you can mute the phone conversation from the cord. But be careful, because I have also accidentally hung up on people when I just meant to mute the conversation.",
            "title": "Works Great",
            "userName": "Keisha S. Lyle"
        },
        {
            "date": "September 15, 2012",
            "rating": "5.0",
            "text": "Purchased for use with Skype and to avoid using the microphone/audio jacks on my laptop. I had to download software from the Plantronics website to complete the installation (instructions included) but once completed it works incredibly well. All indications are that the sound quality is excellent (no complaints so far). The cord has convenient controls to answer calls, mute the microphone and raise or lower listening volume. Highly recommend.",
            "title": "Works great! Very clear sound!",
            "userName": "Amazon Customer"
        },
        {
            "date": "July 7, 2012",
            "rating": "4.0",
            "text": "The device works as described. The headset is comfortable to wear, and you can hear callers very clearly. I highly recommend this reasonably priced unit.",
            "title": "Great headset!",
            "userName": "Bret"
        },
        {
            "date": "March 5, 2012",
            "rating": "4.0",
            "text": "They are a little uncomfortable for extended use because they fold. They don't really deliver high quality sound suitable for serious music listeners. They do a very good job of delivering voice and conversational sound without a lot of background noise. The microphone seems to be pretty good and is convenient if you find yourself needing it. I use these at work to listen to dialog files then stash them in the bottom of my backpack for weeks at a time before pulling them out again. They still look and act like new even though I don't treat them like they are delicate. I just store them in the provided stash bag. They aren't the smallest earphones in the world but they do cover my ears comfortably enough and seem to block a decent amount of ambient sound.",
            "title": "Nice portable earphones that don't mind living at the bottom of my bag.",
            "userName": "pixels and bits"
        },
        {
            "date": "October 16, 2013",
            "rating": "1.0",
            "text": "Product looked good, and on my windows 8 machine it did not install properly. I have other headsets, but apparently this one has poor support. AVOID.",
            "title": "Poor quality product software - did not work with my pc",
            "userName": "S. KRAMER \"VisualSuccess\""
        },
        {
            "date": "May 13, 2013",
            "rating": "1.0",
            "text": "This product does not work well at all with Skype on Mac. This is beyond the issue with the buttons not working on Mac noted in the description. You can get Skype working initially, but it cuts out. The sound quality was poor too. The unit did work better on my PC, but I bought for my Apple computers. I tested both on my iMac and Macbook Pro. The headphone performed poorly on both units.\n\nBottom line, not Mac friendly.",
            "title": "Apple/Mac users STAY AWAY",
            "userName": "D. Fromm"
        },
        {
            "date": "February 18, 2014",
            "rating": "1.0",
            "text": "I was very excited about these headphones until I could no longer use them. I used them for about a month until the piece that connected to the usb port broke. Unfortunately, I waited too long to use them and could not return them, as the return window expired. I have another set that was not as comfortable that never stopped working and guess I will have to go back to them. I do like that these folded easily for storage and convenience. They were also very comfortable.",
            "title": "USB port connection broke after a month of use",
            "userName": "A. Taylor"
        },
        {
            "date": "December 7, 2013",
            "rating": "2.0",
            "text": "Sadly, when recording audio there is static and noise. I used both a Mac and a PC and the noise is still there. I do not notice the noise when I am on voice calls. If you are using this for audio recordings, It is not very good!",
            "title": "OK for the phone but horrible for audio recordings.",
            "userName": "Stephen"
        },
        {
            "date": "September 28, 2013",
            "rating": "2.0",
            "text": "These did not seem to be recognized by my software. I am using Windows 8 and tried it with Magic Jack and other things. They just didn't seem to work very well for me. I returned them and bought a different pair which were not USB and that seems a lot more reliable (and independent of the software).",
            "title": "Had problems with software",
            "userName": "Amazon Customer"
        },
        {
            "date": "July 21, 2013",
            "rating": "4.0",
            "text": "I'm so happy when using this headset for podcasting. This is recommended as it's met requirement of cheap price and good quality...",
            "title": "Right choice for recording or talking",
            "userName": "Thi Phan"
        },
        {
            "date": "May 25, 2013",
            "rating": "2.0",
            "text": "This was a Logitech replacement. It works OK but it has wires going to both ear pieces which make them tangle prone and have to untangle them every time I want to use them. Overall quality could be improved. Not worth the money.",
            "title": "Not user friendly",
            "userName": "mrm"
        },
        {
            "date": "February 22, 2013",
            "rating": "4.0",
            "text": "Great sound and good controls. Cord is long, adjustments are good. Good value proposition. Perfect for Skype and other VOIP apps.",
            "title": "Very good",
            "userName": "Amazon Customer"
        },
        {
            "date": "January 26, 2012",
            "rating": "4.0",
            "text": "I'm actually somewhat disappointed that this headset connects to devices via USB. Personally, I would have preferred something that I can plug into my cell phone or home phone. Overall the headset is quite functional. I can't say it's the most comfortable, but for quick conversations, that won't last for hours, it's comfortable enough. The best feature is the Inline control panel, which, again, would have been great to use with other devices that do not have a USB. Sound quality was fine, it isn't bluetooth so there isn't that much you're risking as it is directly connected to your PC or Mac. Price wise it is a little more than I'd want to pay, but overall you're getting a pretty good headset.",
            "title": "Plantronics Stereo USB Headset",
            "userName": "T. Kunikov"
        },
        {
            "date": "January 19, 2012",
            "rating": "3.0",
            "text": "Just what I expected from a headset. The audio quality is fine, and the mouthpiece/speaker can be repositioned in many ways.\n\nWhat's unique is its ability to fold up small to be packed away, but I would be reluctant to pack it in the simple cloth sleeve it comes with, as it feels like it would get crushed.",
            "title": "Good",
            "userName": "Peter"
        },
        {
            "date": "January 24, 2012",
            "rating": "5.0",
            "text": "I have found these to be best with Skype and for listening to books on tape. They are especially good at canceling out the ambient sound while talking to someone on Skype. My computer has a built in mic so I always think that it is sufficient but I know from listening to other people that the built in mic is not very good. I'd like to put a pair of these on everyone I talk to in the course of a day. The Plantronics are comfortable to wear and I have found them to be expandable enough even for my big head. ALL of the errors caused while wearing these headphones were mine.\n\nPICNIC= Problem in Chair, Not In Computer\n\nFIRST I tried to plug these into my ipod and if that had worked, my husband would have made none of the following Statements in this order:\n\n1. You are the most inept person I have ever known.\n2. I can't believe you just did that.\n3. You're not a systems person. You are too impatient.\n4. You know how to wreck a football game.\n5. I wish to have a home in which I can experience tranquility.\n6. Michigan has got no defense. Pathetic.\n\nThese headphones are USB, which I paid no attention to, none whatsoever. When they didn't have the right plug for my ipod, I put the ipod down and tried to plug them into my computer only to discover that my entire music library had been STOLEN. Then I was informed that my husband has been trying to get my computer away from me for SIX weeks so he could connect my itunes to his icloud. Some mumbled comments continued and then were followed by Statement 1.\n\nSo I finally hooked up to his iCloud and then found the Amy Winehouse album. But then the headphones transmitted NO SOUND whatsoever. No sound even when it was turned up ALL the way. So I went off to explore a whole new mystery. And I found the solution in my system preferences. It was called, aptly, SOUND. I selected the Plantronics as my device. It STILL didn't work.\n\nAnd that was when I made my last mistake. I clicked on output and then changed it to Plantronics .Audio478 USB.\n\nWhen Amy Winehouse started playing at my highest possible volume, I screamed and fell off the couch, head first, because my legs were over the back of the couch. That knocked the cat off my stomach. The cat jumped on the dog who got up and barked, which caused the cat in my husband's lap to run up his face and try to stick on his head.\n\nStatements 2, 3, 4, and 5 followed this debacle.\n\nThey tried to get me to watch football and I said no, no, no.\n\nHoping not to hear football either, I looked for noise canceling capabilities but this was not to be. Otherwise I would not have heard Statement 6.",
            "title": "Perfect for hearing voices",
            "userName": "Gertrude, the Angelic Queen \"Live well, laugh..."
        },
        {
            "date": "February 23, 2014",
            "rating": "1.0",
            "text": "Annnnd it happened just outside the Amazon warranty. I use Dragon naturally speaking and with this headset, the software is rendered practically useless.",
            "title": "Worked well for a while, then the right speaker fizzled, microphone quality degraded.",
            "userName": "Billy Bones"
        },
        {
            "date": "December 9, 2013",
            "rating": "2.0",
            "text": "I ordered this product to use with my computer for VoIP calls and when I needed to listen to audio privately (not over speakers). The product seems poorly constructed and feels cheap. Audio quality is very poor. Strangely does not work with all applications (should be PnP).\n\nI would not recommend this product for any professional/business use.",
            "title": "Cheap, Poor Audio Quality",
            "userName": "Mark Z"
        },
        {
            "date": "December 12, 2013",
            "rating": "4.0",
            "text": "I've used this headset on multiple occasions to meet with clients via GotoMeeting and Skype. While they they perform quite well and are very portable, they are also a tiny bit on the flimsy side because of their folding capability.\n\nI would hesitate to travel without first putting them in a protective case. Other than that, I think they're definitely worth what I paid and would recommend them for others to use.",
            "title": "Good for the money, will want protective case for travel",
            "userName": "James \"Videographer, Graphic Designer, Photog..."
        },
        {
            "date": "December 10, 2013",
            "rating": "3.0",
            "text": "Connector is not proper size to use with iPad air, so I'm not able to use product for the purpose I bought it for.",
            "title": "Connector blues",
            "userName": "Magee150"
        },
        {
            "date": "December 4, 2013",
            "rating": "5.0",
            "text": "I'm loving this headset. Perfect!!! for Skype and other things like Secondlife which was the real reason I got this headset. % stars simply cause I paid for what I wanted.",
            "title": "5 deserved stars",
            "userName": "Jonathon Frey"
        },
        {
            "date": "November 18, 2013",
            "rating": "3.0",
            "text": "Pros:\nDecent sound quality.\nWas comfortable for 3-4 hours of gaming.\n\nCons:\nMicrophone picks up the sound of the air blowing past from a fan a few feet behind me and the sound is transmitted to the headset even when I'm not using push-to-talk.",
            "title": "Decent bargain headset",
            "userName": "David Hale"
        },
        {
            "date": "June 13, 2013",
            "rating": "4.0",
            "text": "I brought this item for Internet phone connection yet its sound quality is good enough for music also. My only problem with it is the wiring. It is a little cumbersome with wires coming out of both earpieces, otherwise it would be a perfect piece for my purpose.",
            "title": "Excellent sound",
            "userName": "George W."
        },
        {
            "date": "May 31, 2013",
            "rating": "4.0",
            "text": "Comfortable to wear and talk on computer (skype, gtalk, webmeeting).\nHave not used it for music etc. but great for talking.\nPleased so far (about 1+ month), ordering one more for home office.\nIf you talk a lot on computer, this is one of the good headset for the price.",
            "title": "Comfortable, high sound quality for taking",
            "userName": "Raj \"rg\""
        },
        {
            "date": "May 11, 2013",
            "rating": "4.0",
            "text": "This is a great product overall and is basically used for home office remote purposes. The sound quality is ultra clear, crisp and basstastic! Having the controls to adjust volume, mute and switch to Skype use is of the utmost convenience. Try it and like it.",
            "title": "Plantronics USB Headset (Audio 478)",
            "userName": "nayaT"
        },
        {
            "date": "August 19, 2013",
            "rating": "1.0",
            "text": "The specs say that it does; but like other reviewers, even after downloading the appropriate software on Plantronics' site, it never worked on my Macbook Air (Mountain Lion OSX). I returned it for credit.",
            "title": "Does NOT work with Mac!",
            "userName": "Laurie"
        },
        {
            "date": "June 13, 2013",
            "rating": "1.0",
            "text": "The unit is average operating.\n\nWhat is complete nonsense is the foam earpads HAVE NO REPLACEMENT. You know - those $1.50 foam things? Google as I might - only commentary how they are impossible to find.\n\nIn speaking with the Plantronics customer service - they confirmed as such and suggested I send in the unit for review.\n\nGot a call (promptly - rah) - that there is no replacement for the earpads - and 'all they do' - is 'determine if it is under warranty send it back to Mexico' - and they can send me a new one for what you will pay for it on Amazon.\n\nMine was 15 months old - so customer gets the shaft.\n\nNever again - adios plantronics.",
            "title": "If you want to buy one a year",
            "userName": "BOTA"
        },
        {
            "date": "March 14, 2014",
            "rating": "1.0",
            "text": "It's don't work in MacBook Air. I know that don't work with call but not entire macbook didn't work. d",
            "title": "It's don't work in MacBook Air",
            "userName": "Diego"
        },
        {
            "date": "January 27, 2014",
            "rating": "1.0",
            "text": "This item may be compatible with Skype but that's pretty much it despite claims from others stating it can be used with Dragon. This item is also rather uncomfortable with how it sits on the head and squeezes the ears. I have a small head and it felt like a small vise.",
            "title": "Uncomfortable and noncompatible",
            "userName": "W.Minx"
        },
        {
            "date": "January 24, 2014",
            "rating": "1.0",
            "text": "When my shipment arrive and I unboxed the headset it was clear that the retail packaging had been previously opened. Not a big deal to me, but I was hoping that the headset would function normally. However I was disappointed. The was something rattling in the left ear piece. These are being returned today.\n\nThis is not a ding against Plantronics, but against this seller. I don't expect to pay new prices for something broken and used.",
            "title": "Seller sent open box and defective headset",
            "userName": "Ken Seethaler"
        },
        {
            "date": "January 23, 2014",
            "rating": "3.0",
            "text": "We got these for using Skype on a Macbook but it turns out we didn't need the the microphone as it had one built in. We ended up returning it. It was nice though I guess.",
            "title": "Apparently we didn't need them",
            "userName": "LazyLab"
        },
        {
            "date": "May 3, 2013",
            "rating": "2.0",
            "text": "I'm underwhelmed by these... Perhaps I have a small head, but these look huge on me and really don't fit correctly. Also, some of the functionality on the remote doesn't work with Macs. All that said, the sound is great.",
            "title": "Poor fit, not fully functional with Macs",
            "userName": "A. Wilson"
        },
        {
            "date": "March 16, 2014",
            "rating": "1.0",
            "text": "The absolute WORST headset possible. Works so poorly it might as well not work at all. DO NOT BUY! I'm disappointed that Plantronics would put out such a poor quality headset like this.",
            "title": "Csveato Emptor!",
            "userName": "SFNeuropsych \"nah415\""
        },
        {
            "date": "January 25, 2014",
            "rating": "4.0",
            "text": "This head phone does no work with my Mac, even after getting the geeks to set it up on my Mac, it still does not work, I am very disappointed.",
            "title": "Poor rating for headsets!",
            "userName": "Claudia M Godfrely"
        },
        {
            "date": "May 15, 2013",
            "rating": "2.0",
            "text": "Mic was not very responsive when I was trying to record voice over on Pinnacle program. Not satisfied and am going to return the product.",
            "title": "Not responsive enough",
            "userName": "Christopher Thomas"
        },
        {
            "date": "September 23, 2013",
            "rating": "1.0",
            "text": "Ordered and waited and waited and waited. Said it was delivered, it was not. And then just try to get it replaced! This sucks as it was a special gift.",
            "title": "May be good, if you can get it",
            "userName": "S. Martin \"Be fair\""
        },
        {
            "date": "April 20, 2013",
            "rating": "1.0",
            "text": "Supposed to be a skype headset but won't work with my mac.. bummer as I had one product from Plantronics before and was happy to buy from them again",
            "title": "Don't work with my MAc",
            "userName": "Armand Atitlan"
        },
        {
            "date": "December 11, 2013",
            "rating": "1.0",
            "text": "returning and asked for refund not happy with this item, hated the head band and didn't like it pulling my hair, booo!",
            "title": "not liked",
            "userName": "Adam Sullivan \"ASulli\""
        },
        {
            "date": "May 20, 2013",
            "rating": "1.0",
            "text": "This product did not work with my computer. I had to order another headset which worked much better. This will not work with other programs or than Skype. This is such a disappointment.",
            "title": "Not A Good Product",
            "userName": "Gerda E. James"
        },
        {
            "date": "August 26, 2012",
            "rating": "1.0",
            "text": "This review is about an unpleasant seller not the Plantronics headphones.\n\nI bought my sister headphones from ANTOnline (Atlanta Network Technologies) and discovered that she already had a better set. My mistake -- and so it's only fair that I pay for postage. I knew this when I wrote to ask for an RMA with the option checked 'ordered by mistake' or similar phrase.\n\nANTOnline replied with an email well within the 48 hour window in which the seller should reply, so that was good. But their email was so in my face that I shrank back. Lots of bold face and capital letters, as if they were yelling at me and implying that I was pulling a fast one or maybe wanted to do this.\n\nYikes! I thought, get over it. e.g. \"Under no circumstances will returns be accepted after 30 days\" and \"under no circumstances will we accept returns with imperfecto packaging\" (OK paraphrasing on that one). The whole tone was just so unpleasant.\n\nOK they are in business, but I WILL NOT BUY FROM THEM AGAIN (see what I mean - but imagine those words are in bold as well). Not when there are cool and nice people out there selling. Next time I buy something I'll look into who is selling first and what they are like about returns.\n\nSo I've decided to keep the headphones because I don't want the hassle of dealing with these guys further. By the way, I haven't actually checked to see if the headphones work as yet. If they do I can give them to someone or put them in my own case as a spare pair.",
            "title": "Was this seller shouting at me?",
            "userName": "Carol A. O'Connor"
        },
        {
            "date": "August 12, 2012",
            "rating": "2.0",
            "text": "I do not wish to review the item as I did not use it. The item was returned in its original packaging.",
            "title": "Headset",
            "userName": "EngRP01"
        }
    ]
}